-- phpMyAdmin SQL Dump
-- version 4.7.3
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: 2017-09-26 01:55:51
-- 服务器版本： 5.5.56-log
-- PHP Version: 5.5.38

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `cirno`
--
CREATE DATABASE IF NOT EXISTS `cirno` DEFAULT CHARACTER SET utf8 COLLATE utf8_general_ci;
USE `cirno`;

-- --------------------------------------------------------

--
-- 表的结构 `comment`
--

CREATE TABLE `comment` (
  `comment_id` int(11) NOT NULL,
  `time` datetime NOT NULL,
  `comment` varchar(200) NOT NULL,
  `ip_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- 表的结构 `donation_rank`
--

CREATE TABLE `donation_rank` (
  `pic_url` varchar(200) NOT NULL,
  `name` varchar(10) NOT NULL,
  `donation` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `donation_rank`
--

INSERT INTO `donation_rank` (`pic_url`, `name`, `donation`) VALUES
('http://tfs.alipayobjects.com/images/partner/T1aK8xXldaXXXXXXXX_160X160', 'yd', 25),
('http://tfs.alipayobjects.com/images/partner/T1DRVDXoXcXXXXXXXX_160X160', 'za', 7),
('http://tfs.alipayobjects.com/images/partner/T1Gl4tXfddXXXXXXXX_160X160', 'tsh', 5),
('http://tfs.alipayobjects.com/images/partner/T1MtVEXmVXXXXXXXXX_160X160', 'chj', 5),
('http://tfs.alipayobjects.com/images/partner/TB1ZvreXlmKMeJjHvSTXXcmIpXa_160X160', 'xy', 1),
('https://os.alipayobjects.com/static/i/mobileapp/png/201509/5rNQKGl6CL.png', 'bh', 1),
('https://os.alipayobjects.com/static/i/mobileapp/png/201509/5rNQKGl6CL.png', 'zh', 1);

-- --------------------------------------------------------

--
-- 表的结构 `lnetacheck`
--

CREATE TABLE `lnetacheck` (
  `check_id` int(11) NOT NULL,
  `avid` int(11) NOT NULL,
  `reason` varchar(200) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- 表的结构 `update_log`
--

CREATE TABLE `update_log` (
  `log_id` int(11) NOT NULL,
  `date` date NOT NULL,
  `log` varchar(200) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `update_log`
--

INSERT INTO `update_log` (`log_id`, `date`, `log`) VALUES
(1, '2017-09-24', '数据修复');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `comment`
--
ALTER TABLE `comment`
  ADD PRIMARY KEY (`comment_id`);

--
-- Indexes for table `donation_rank`
--
ALTER TABLE `donation_rank`
  ADD PRIMARY KEY (`pic_url`,`name`);

--
-- Indexes for table `lnetacheck`
--
ALTER TABLE `lnetacheck`
  ADD PRIMARY KEY (`check_id`);

--
-- Indexes for table `update_log`
--
ALTER TABLE `update_log`
  ADD PRIMARY KEY (`log_id`);

--
-- 在导出的表使用AUTO_INCREMENT
--

--
-- 使用表AUTO_INCREMENT `comment`
--
ALTER TABLE `comment`
  MODIFY `comment_id` int(11) NOT NULL AUTO_INCREMENT;
--
-- 使用表AUTO_INCREMENT `lnetacheck`
--
ALTER TABLE `lnetacheck`
  MODIFY `check_id` int(11) NOT NULL AUTO_INCREMENT;
--
-- 使用表AUTO_INCREMENT `update_log`
--
ALTER TABLE `update_log`
  MODIFY `log_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;--
-- Database: `lneta`
--
CREATE DATABASE IF NOT EXISTS `lneta` DEFAULT CHARACTER SET utf8 COLLATE utf8_general_ci;
USE `lneta`;

-- --------------------------------------------------------

--
-- 表的结构 `lneta_info`
--

CREATE TABLE `lneta_info` (
  `av` int(11) NOT NULL,
  `comment` varchar(500) NOT NULL,
  `name` varchar(50) NOT NULL,
  `time` varchar(50) NOT NULL,
  `type` varchar(30) NOT NULL,
  `work` varchar(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `lneta_info`
--

INSERT INTO `lneta_info` (`av`, `comment`, `name`, `time`, `type`, `work`) VALUES
(105, 'FSL正式版接触STG到现在，fsl打高分都需要放b刷分...目前我还对分数不是很执著而且不是太喜欢放b的那种感觉故半年前给自己制订了一个目标，7月12号终于达成,只为分享,顺便群6574102', '月野うさぎ', '2009-07-14 19:13', 'NB', '风神录'),
(596, '作者：coa ..版本：1.00a ..难度：Lunatic..角色：灵梦B..处理落：0.06%（四舍五一为0.1%）..得分：2,160,400,040', '工藤Akira', '2009-10-02 00:28', 'NM', '风神录'),
(839, '玩家:farewall..难度：Lunatic..角色：咲夜A..处理落：0.116%..得分：1,138,483,660', '工藤Akira', '2009-11-23 00:32', 'NM', '妖妖梦'),
(158060, '原创 东方风神录LUNATIC魔理沙B低速封印魔理沙弑神炮ALL', 'htgz111', '2011-10-16 17:51', '低封', '风神录'),
(317622, '原创 第一次录噢，把之前打的录上。东方红魔乡 LUNATIC 恋符 NOBOMB_(:3_ )_3面手滑1MISS，4面小恶魔1MISS，5面杀人玩偶1MISS，6面开幕手滑1MISS，深红和幻想乡各1MISS……', '莉莉冰淇淋', '2012-07-25 02:54', 'NB', '红魔乡'),
(371933, '原创 第一次录视频帧数各种残念- -!从右上history可以看出up怒爆RP。。', '七份睡觉圣代', '2012-10-09 20:24', 'NB', '妖妖梦'),
(426496, '自制 很早就想尝试不用B过L难度，这次嘛.大家就不用吐槽技术了.5面道中真心是条件反射啊，条件反射！', 'mYm丶七七', '2012-12-29 14:37', 'NB', '地灵殿'),
(432223, '自制 大家新年快乐，奉上星莲船Lunatic难度NO MISS攻略，rep下载地址：http://www.rayfile.com/zh-cn/files/2cb5fd63-55a2-11e2-8037-0015c55db73d/', '魔魔丸', '2013-01-04 12:31', 'NM', '星莲船'),
(651469, '自录 Replay来自Royalflare， 完成日期：2013/07/09，机师:Y.S， NoMiss满残满B， 26SC收取24 原简介：No miss ★★★★★★★★/★★★★★★★★★ Clear!! Spell 26/24 get ww UFO 攻略役に立つでしょう (^p^)! (视频压制用意)', '本気', '2013-07-15 23:57', 'NM', '星莲船'),
(671590, '自制 东方神灵庙Lunatic满残NoMiss。rep下载地址：http://pan.baidu.com/share/link?shareid=409977&uk=1059276687 http://pan.baidu.com/share/link?shareid=424179&uk=1059276687', '魔魔丸', '2013-07-27 08:06', 'NM', '神灵庙'),
(673052, '皇家烈焰东方世界rep纪录并自行录制 （截止到2013年7月27日）机师：Nanashi 分数：22.07亿（2,207,945,130） 该记录完成于2013年6月26日。（其实有个特殊情况，其实真正的世界纪录是由我们国人-迪拉克之海，又叫海叔。他在2011年11月18日已经取得2,208,136,680的最高分，但没rep而各种不了了之，现在这个新纪录仅差20万分左右，所以基本没争议可言）风神录的刷分因素较少，魔C,不拿糟蓝点和掉信仰', '菊花爆破君', '2013-07-27 23:01', 'NM', '风神录'),
(705038, '自制 自打 感谢凋零帮忙录制', '鹿目圆香', '2013-08-12 22:35', 'NM', '永夜抄'),
(724254, '皇家烈焰东方世界rep纪录 （截止到2013年8月22日）机师：soc 分数：6亿（609,183,120）特殊挑战：no bomb，rep上传于2013年8月19日。东方辉针城目前的弹幕强度在nmnb被誉为地狱，目前这个成绩最好的，我们要用B产生残机，但他不放B就4面见boss满残，6面boss中再度满残，5面终符差点收了，6面只miss了一次，各种底力强扭和神穿，不忍直视啊。这次推荐大家用宽屏模式观看，这才爽。', '菊花爆破手', '2013-08-22 10:24', 'NB', '辉针城'),
(749779, '皇家烈焰东方世界rep纪录 看到b站好像没有，还是把这个空白填一下，这纪录目前应该是最早的，目前先放这2作，之后会把星莲船和神灵庙补充一下。当然旧3作也不会错过。这两个最早的纪录都是同一个机师：水月 来完成。一位日本大神。', '菊花爆破手', '2013-09-07 01:00', 'NMNB', '地灵殿'),
(749779, '皇家烈焰东方世界rep纪录 看到b站好像没有，还是把这个空白填一下，这纪录目前应该是最早的，目前先放这2作，之后会把星莲船和神灵庙补充一下。当然旧3作也不会错过。这两个最早的纪录都是同一个机师：水月 来完成。一位日本大神。', '菊花爆破手', '2013-09-07 01:00', 'NMNB', '风神录'),
(752644, '皇家烈焰rep纪录并自录制 机师：shin，这nmnbnu（不miss，不放bomb，不拿飞碟）挑战于星莲船发售1年后完成。总的来说，目前在nmnb难度上，辉针城还是比不上星莲船，shin作为目前统领高难度的星莲船机师，刷分和底力并存，一直保持到现在。这次也是第一次为这个自制搬运视频加入少量制作。我会在开头加入该作分数top5，以后会逐步完善加入更多娱乐型的东西，让大家看记录rep不至于沉闷。希望大家多多支持，毕竟传教嘛。', '菊花爆破手', '2013-09-08 21:01', 'NMNBNV', '星莲船'),
(752769, '皇家烈焰rep排行榜并自录制 机师：ASL，于2013月8月26日完成，在soc的7miss后，再一次减少miss数，犬齿收了，逆针收了，正以为能完成no miss no bomb，结果。。详情请看视频。这rep也是首次展示了“咲夜炮”的强大威力。6秒收符卡，有木有！快发售一个月了，继续期待！这次我完善了分数top5模板某些细节，并加入一些图片美化，视频结尾还有“福利”小剧场，音乐也是尽量配合整个游戏流程。会再度观察并完善', '菊花爆破手', '2013-09-08 22:31', 'NB', '辉针城'),
(753473, '皇家烈焰rep纪录并自制作 机师：水月 完成于2011年9月22日。我们又见到水月这位日本大神，完成了风神录，地灵殿，神灵庙的最早nmnb。神灵庙难度有所降低也是无容置疑，因为资源偏少。不过nmnb就没有什么资源可说，向来nmnb玩的就是rp和底力走位。没什么情况下次把旧3作的nmnb放上来，并且继续期待辉针城的nmnb。另外我也想求图包了！', '菊花爆破手', '2013-09-09 17:23', 'NMNBNT', '神灵庙'),
(773317, '皇家烈焰世界rep纪录并自制 （截止到2013年9月26日）机师：Nanashi 分数：22.14亿（2,214,529,240） 该记录完成于2013年9月25日。这机师在之前是在2013年6月26日以22.07亿登顶的，但被删除了。行傍如果要登顶有专人鉴定。4面5面6面打法有所变化，不冒险决死灵击，维持信仰的方法有所变化。风神录：魔C,不拿糟蓝点和掉信仰。另外我电脑录风神录总是某时候掉帧，rep没问题，是我电脑问题。', '菊花爆破手', '2013-09-27 09:29', 'NM', '风神录'),
(776571, '自制 大家好，半年没见，有变得更触吗（ 貌似投早了几天，不过踩点投稿是强迫症，要改要改~~ 妖妖梦都什么叒输出……所以画质妥协了，结果压出来501M……所以音质也妥协了……还有就是……我后黑我自豪（', '七份睡觉圣代', '2013-09-29 22:50', 'NB', '妖妖梦'),
(777275, '皇家烈焰世界rep纪录并自制 （截止到2013年9月26日）机师：HS参謀 特殊挑战：no miss no bomb no 爆结界。 完成于2011年3月28日。妖妖梦的各种记录争夺不像其他作那么激烈，直到从10年开始出现了HS参謀，不断高产的纪录令妖妖梦纪录榜增添生机。他的rep在他的高峰期也是教科书类型。妖妖梦总体难度跨度要比其他作低，这次可以看一下hs在某符卡利用结界结束的无敌主动化解危机，HS说自己真TM机智.', '菊花爆破手', '2013-09-30 16:37', 'NMNBNR', '妖妖梦'),
(789761, '皇家烈焰世界rep纪录并自制 截止到2013年10月8日，机师SOC，特殊挑战：no miss no bomb 完成于2012年7月28日。东方红魔乡02年的作品，直到2012年才有nmnb的纪录rep出现，玩家是soc.另外也是分数最高的nmnb，然后在同一天，另一位机师clio也跟风似的完成了nmnb。同一天完成还真是。soc玩着还刷了3亿多分，clio打得略为谨慎，红魔乡难掌控，详情请看视频', '菊花爆破手', '2013-10-09 07:58', 'NMNB', '红魔乡'),
(791598, '皇家烈焰世界rep纪录并自制 （截止到2013年10月10日）机师：にしゅびー 特殊挑战：no miss no bomb 。 完成于2013年10月1日。2个月之内神速！这机师rep介绍一点都没有标明nmnb，被错过了好几天。这位机师为啥这么低调（叼）？感谢提醒啊。这次为了回顾加了点没什么意义的片头。尝试了bgm同步性？nmnb，不仅是技术的挑战，还是rp和心态的挑战。咲夜炮的发挥炉火纯青，大大加速了nmnb的进度。期待梦A', '菊花爆破手', '2013-10-10 21:53', 'NMNB', '辉针城'),
(811902, '皇家烈焰rep纪录 （截止到2013年10月26日）机师：YZ，又称：蓬莱の魚の形。作为国人的nmnb全卡纪录，完成于2012年2月8日。在永夜抄里，比国外nmnb大神水月和soc还要早10个月完成（水月和soc是同一天完成的，2012年12月21日）。是不是最早不清楚。既然是国人当然支持了。这作系统信息量大，技巧略多,符卡量较多,练习量较大，据说机师打了2000多小时！详情请看视频。注意辉夜战开始后出现较大的掉帧，是渲染的问题，不是rep问题.', '菊花爆破手', '2013-10-27 09:44', 'NMNB', '永夜抄'),
(821027, '皇家烈焰世界rep纪录 （截止到2013年11月3日）机师：水月 特殊挑战：no miss no bomb 。完成于2013年10月26日。一直期待梦A，这次水月一如既往保持自己nmnb的标签，完成梦A机体。感觉对于水月，决定辉针城nmnb出现时间的因素：底力（可能比所需要的底力还要高），背板（看他道中精准的走位，没有多余的操作，模式化了）剩下rp了，对，缺的是rp。打的很稳，不少新姿势，5面道中，针妙丸2非点弹安定引法，UKT高墙的无限激活等。他目前再钻魔A的，片尾小剧场又跟咲夜过不去。', '菊花爆破手', '2013-11-03 15:05', 'NMNB', '辉针城'),
(828229, '自制 SOC是名出色的东方玩家，他最为著名的是打出了红魔乡L的NMNB，此外他也打过永夜抄、风神录、地灵殿L的NMNB以及星莲船L低封，此次的录像完成于2013年9月，在低封NB的基础上添加了No UFO的苛刻条件，但全程仅2miss少收1卡，其技术令人惊叹…', '步行龟', '2013-11-09 13:48', '低封NBNV', '星莲船'),
(829952, '自制 说好的半年后再见呢？拼歌技术越来越成熟了~~后黑注意，实际时间为显示长度的一半', '七份睡觉圣代', '2013-11-10 13:51', 'NMNB', '妖妖梦'),
(969973, '自制 妖妖梦L难度 低速封印（禁止shift） NoBomb 禁破结界（实际上破了2个结界 不过剩余3残就算补回来了） 第一次自己录视频。。。', '鹿目圆香', '2014-02-17 09:43', '低封NBNR', '妖妖梦'),
(972706, '自制 先谢巫女酱~感谢妙子和新月的调教~然后是……天国的地灵殿……永夜抄喜欢的曲子都塞进爱妾的视频了，所以这期的BGM就……', '七份睡觉圣代', '2014-02-19 00:16', 'NMNB', '永夜抄'),
(1042503, '自制 东方永夜抄Lunatic幽冥组 No Miss。果然我还是更适合用避弹机而不是用轰炸机。视频全程四老外围观！丧心病狂！全程高能！replay下载： http://pan.baidu.com/s/1c01l6gg', '魔魔丸', '2014-04-04 11:21', 'NM', '永夜抄'),
(1066016, '自制 这个是前天早上打出来的，1 Bomb是我个人目前最好的No Miss记录（NMNB遥遥无期...），总之还是希望大家喜欢。\r\n现在视频传新浪越来越麻烦了...orz', 'LYX-TEST', '2014-04-15 23:45', 'NM', '红魔乡'),
(1087520, '自录 我能扭星人水月带来的妖精大战争L难度冲金play。路线A1，全程no bomb，符卡战no ice，收9卡丢2卡。\r\nA1路线的符卡弹幕相比其他路线要仁慈不少，但想要收金牌仍然不是易事。', 'cdtu_xas', '2014-04-27 13:40', 'NB', '大战争'),
(1087613, '地灵殿魔B使ENAMEL带来的魔B LNN\r\n魔B是非常强力的机体，能够兼顾所有方向，火力强大，贴脸bomb威力巨大，但不适合初见开荒，因为切换属性这项操作需要大量时间去熟悉，如果用不正确的属性去面对相应场景的话会非常麻烦，在行动中强行切换也非常危险。\r\n本次ENAMEL采用了强刷分向的路线来完成LNN，分数高达23亿。但他并没有取得全卡，放弃猫步以得到鬼火阵的信仰点从而达到nomiss向刷分的目的。', '米格照相机', '2014-04-27 14:14', 'NMNB', '地灵殿'),
(1087646, '东方地灵殿LNMNBFS；玩家：くらげ\r\n这是标准的LNN，没有刷分，没有作死，为何称“花式”？因为机体是魔A。\r\n魔A是一个比较尴尬的机体，优点明显缺点也明显。8级火力输出非常强大，但高速是前方集中，低速是发散，低速下正面远距离火力极低，因此速破boss必须尽可能使用高速；满火力可以放8个B，但B的范围小，无敌时间超短且只有贴脸才有可观威力。因此混关来说魔A属于强规划机。但在大触眼里，一切皆有可能。', '米格照相机', '2014-04-27 14:27', 'NMNB', '地灵殿'),
(1111133, 'LNN兼刷分狂魔MB于2014年5月2日达成的星莲船LNNN，不出意外地拿到了星LNNN的最高分。但这不是第6个星LNNN的特殊之处，它的特点在于全程瞎狗眼。一般打LNN这种挑战的话都会选择较安定的规划或路线，但这个rep所呈现的完全不一样，虽然是微刷分向但放弃了许多送擦弹的地方，同时拼命抢蓝点。机师打这么个rep出来似乎并不是在挑战LNNN的高分，而是为了证明人类可以达到这种程度。', '米格照相机', '2014-05-08 19:32', 'NMNBNV', '星莲船'),
(1113472, '自制，纪念向，REP地址：http://pan.baidu.com/s/1c0cj0WS，REP为中文版注意。打得非常混....炸着炸着就NM了...........', '朝仓千弘', '2014-05-09 22:44 ', 'NM', '风神录'),
(1153996, '自制 地L的NM达成！暂时歇口气吧\r\n\r\n机体萌C\r\n\r\n期末考试也完了，假期打个萌A的NM15E好了2333', '神棍第2枚', '2014-05-28 18:44', 'NM', '地灵殿'),
(1489260, '自制 东方妖妖梦 Lunatic模式一命禁雷，感谢SJF帮忙录制', '三咲爽花', '2014-08-31 22:07', 'NMNB', '妖妖梦'),
(1496290, '自制 星莲船LNB 纪念', 'nyycbd', '2014-09-03 18:03', 'NB', '星莲船'),
(1604760, '自制 NoBomb纪念，红魔乡感觉NB与其花时间练熟不如堆次数和人品更靠谱，耗时一周达成，神穿神扭略多。该作同人曲收集难度略高，BGM总体很满意但是和画面契合度稍欠', 'nyycbd', '2014-10-08 18:28', 'NB', '红魔乡'),
(1682903, '- 妖妖梦终结者NAYA，在打出了惊天地泣鬼神的36亿以后又不声不响地在往垃圾桶里丢了这个rep：Lunatic一命禁雷禁破结界禁低速全卡ALL，还带有相当多的刷分动作，目测是执行了禁雷禁破结界的打分规划？', '米格照相机', '2014-11-04 15:53', '低封NMNBNR', '妖妖梦'),
(1695091, '- 东方全作打分及netaplay狂魔K·G在8月打出的东方地灵殿L低封禁雷挑战，残1 ALL。K·G是个非常另类的玩家，有着谜之多的打飞机时间，避弹相当了得，出成绩也相当快，但非常的不专一，每几天甚至一天就换一作打成就，可谓在幻想乡横行跋扈。这次的地灵殿低封NB ALL也是，扭得极其瞎眼，撞得极其糟糕。。另外这里也有不少值得借鉴的走位，对想打地灵殿LNB的应该有一定的参考价值', '米格照相机', '2014-11-08 22:35', '低封NB', '地灵殿'),
(1737936, '※replay取自royalflare replay uploader\r\n※“0红碟0卡no miss，全部符卡都炸了”\r\n※奇葩向netaplay，虽然0卡很诱人，但有两点要注意：1.机体是神机魔理沙B；2.非符不是符卡\r\n※对想打非强机（苗B）NM的玩家可能有一定参考价值', '米格照相机', '2014-11-23 00:19', 'NM', '星莲船'),
(1831656, '自制 东方红魔乡Lunatic梦A避弹参考，素材是我的红魔乡Lunatic No Bomb. 全程采用了比较安定的走位和避弹思路，希望能帮到大家。\n\n红魔乡弹幕全解析：http://tieba.baidu.com/p/3682668188', '星海天下', '2014-12-26 18:43', 'NB', '红魔乡'),
(1861299, '自制 上个月完成的红LNB http://score.royalflare.net/th06/replay6/th6_ud15c5.rpy 这次通过底端弹幕为大家解说', '脑浆炸裂☆根', '2015-01-05 02:26', 'NB', '红魔乡'),
(1876505, '自制 东方妖妖梦 灵梦B\r\nP1:Lunatic低封\r\nP2:Extra低封NoBomb\r\n两个月前的REP了，最近实在没有心情打飞机，只能翻出来充下数。。。\r\n灵梦B的低速封印堪称完美。恰到好处的速度、较小的判定、不错的火力、与森罗系统的高结合度，虽然雷的威力不像低速情况下这么高，但作为控场手段使用非常有效。\r\nP1Story模式看点大概就是四面和六面内避生者必灭了（\r\nP2低封收掉了四面楚歌也让我比较意外', '八云雪琉璃', '2015-01-10 18:11', '低封', '妖妖梦'),
(1876702, '自制 实况 普通的妖妖梦LNB 魔符 残5', '脑浆炸裂X根', '2015-01-10 19:06', 'NB', '妖妖梦'),
(1879804, '自制 全程实况 Lunatic咏唱组6A禁雷 同样的招式对圣斗士是不能使用两次的！！！！！', '脑浆炸裂X根', '2015-01-11 15:23', 'NB', '永夜抄'),
(1890353, '自制 我的东方风神录lunatic no miss\r\nreplay地址 \r\nhttp://pan.baidu.com/s/1pJkczcn', '安利忍', '2015-01-15 12:28', 'NM', '风神录'),
(1942113, '自制 自己的永夜抄Lunatic红魔组NoMiss 32亿分的rep，稍微带了一点混分打法。返4中出提前切了低速导致失败，除了这点都比较满意的rep。封面图id=11369493', '爱丽丝・玛格特罗依德', '2015-01-31 02:05', 'NM', '永夜抄'),
(2101328, '自制 感觉风神录的音乐很有催眠功能，加上最近晚上睡觉死活睡不着，因此从皇家烈焰榜上翻了一个梦C机体的NMNB，机师是世界级神触水月。', '能用就吃翔', '2015-03-12 20:33', 'NMNB', '风神录'),
(2109981, '自制 最近一段时间星莲船被黑得很严重，什么ENH是东方星莲船L是星莲船啊，怒首领船大魔B啊，简直无法直视(╯‵□′)╯︵┻━┻\r\n1P为魔B初通，2P为苗B低封初通，抱B抱成狗，Z键失灵都能通，亲民船超亲民~（棒读', '米格照相机', '2015-03-15 01:39', '低封', '星莲船'),
(2112561, '自制 受小豆委托，将他的风LNM录制成视频。全程各种作死，怪不得打了这么久才打出风LNM来。混关要收卡（biu），扭一会再炸（biu），这么作死打nomiss真的好吗？！', '能用就吃翔', '2015-03-15 17:21', 'NM', '风神录'),
(2157349, '自制 封面图pixiv id=26030150 收录天朝东方玩家的L难度no miss no bomb录像。NMNB的基本原则为不miss，不无敌消弹，纯靠底力躲过全部弹幕，故利用妖妖梦的森罗结界系统和神灵庙的灵界系统打出的NMNB均不计入。同机师同作品同机体只上传最优成绩的replay。P1：时间：2012/02/08 SCB：37/37 rf备注：ノーミスノーボムフルスペカ 永夜返し5は奇跡です', 'Shirob', '2015-03-29 12:16', '？？？', '？？？'),
(2210805, '自制 代投，小豆子的神灵庙LNM，妖梦机，受他指导，题目与风神录那期类似，而封面他表示直接忽略……这么对待自己的LNM真的好吗？', '能用就吃翔', '2015-04-11 23:50', 'NM', '神灵庙'),
(2220760, '自制 东方永夜抄单妖梦Lunatic6A Nomiss \r\n半年前的坑，终于填了~', '安利忍', '2015-04-15 00:33', 'NM', '永夜抄'),
(2226911, '自制 神灵庙lunatic NMNB留念。我要特别感谢两个人，一个是魔魔丸，感谢他让我知道了坚持不懈终能成功的道理。一个是圣宙一，他成功在5个月前预言了我可以在今年5月份之前打出LNN。', '能用就吃翔', '2015-04-16 23:45', 'NMNB', '神灵庙'),
(2229499, '自制 一开始叫我打风NN我是拒绝的，因为……接不上梗了233去年10月世纪机智地安利了这首歌（日放标题被退了只能放标签那里了）给我然后我就想做视频了，结果用魔胖子打了一个星期没打出来懒得推把又扔一边了，直到最近又听到这首歌……机体梦C，向STG启蒙老师水月致敬！\r\n\r\nBGM&rep（履历中提及的所有rep）&新浪直播录播下载地址：http://pan.baidu.com/s/1sj8xQc1', '七份睡觉圣代', '2015-04-17 20:45', 'NMNB', '风神录'),
(2235749, '自制 代投 空挂长的rep，Lnm的灵梦机体，其中收率都是Master~', 'jumbo♂lin', '2015-04-19 11:56', 'NM', '神灵庙'),
(2290657, '按照他人要求制作代投 东方地灵殿LNB初通，机体：梦A，机师：lv.0觉。Up主在这里帮师父录制代投一份视频以留做纪念。（注：机师说要用自拍当封面（ry', '一叶紫荆', '2015-05-04 22:18', 'NB', '地灵殿'),
(2303843, '按要求自制代投 东方红魔乡L难度No Bomb ，机体：梦B，机师：lv.0觉   Up主帮师父制作代投的第二个视频，师父打红LNB打了好久呢，最近看师父打了两次9961，看到师父好多次疮6面之后的落寞，也是挺无奈的。终于还是通了，好开心呢*^_^*', '一叶紫荆', '2015-05-09 00:01', 'NB', '红魔乡'),
(2306167, '按要求自制代投   亲民红超亲民（标题是机师取的，如果觉得不好不是Up主的锅。简介这句话也是机师说的，要我说，还是亲民庙超亲民吧。啊，红师傅太触了，根本无法同台竞技）', '一叶紫荆', '2015-05-09 16:06', 'NB', '红魔乡'),
(2341025, '自制 東方紅魔郷 the Embodiment of Scarlet Devil（画面重制版+VPatch+判定点补丁）Lunatic 博麗霊夢 夢符 No Miss No Bomb Full Spell Card ALL 327,857,880pts. Player 视频录制 by：LYX', 'LYX-TEST', '2015-05-19 11:45', 'NMNB', '红魔乡'),
(2350958, 'youtube转载 随便一发NB打分结果NM了的欧洲人cactu，在冲7e的路上仍然是非洲人……3次NN进6都全关NN了，敢把这RP留给打分么？\r\n原视频就是那么糊比', '米格照相机', '2015-05-22 14:25', 'NMNB', '红魔乡'),
(2395944, '恩，，两周之前打出的风L难度NB。。通关纪念。。', '灰杉丶晓美焰', '2015-06-03 22:08', 'NB', '风神录'),
(2399166, 'replay来自royalflare 尘封4年的风L梦C世界纪录近期以极为夸张的幅度被打破：21.57-&amp;gt;21.75，路线相比前记录有较大的变化，且机师的名字之前从未出现在榜单上，大概是某超级挂比的马甲吧。全程亮瞎注意，请备好钛合金狗眼', '米格照相机', '2015-06-04 22:08', 'NM', '风神录'),
(2400957, '自制 一个励志的故事，上百小时的付出换来东方辉针城Lunatic No Miss No Bomb. 机师是我的徒弟 匿神。因为匿神比较害羞所以由我来解说。全程采用了比较稳的走位和路线，希望能帮到想打辉针城LNB的同学。Replay地址：http://score.royalflare.net/th14/replay14/th14_ud065c.rpy', '星海天下', '2015-06-05 14:12', 'NMNB', '辉针城'),
(2402252, '恩。。这是我打的第一个LNB。。所以水平菜233大家看个乐子就好', '灰杉丶晓美焰', '2015-06-05 19:53', 'NB', '永夜抄'),
(2454502, '自制 当初打完全机体后就被告知可以尝试NB了，然后我也就开了这个坑，打之前学习了下酱宙一的NM/NNrep，然后打了几天也算是打出来了呢，全程咸鱼靠结界混过，果然妖NB还是看规划呢，不过怎么说也算是人生第一个L带N，还是本命作妖妖梦，真的挺高兴的。', '486934guo', '2015-06-18 22:21', 'NB', '妖妖梦'),
(2474752, '自制   机体使用魔a\r\nrep 地址\r\nhttp://pan.baidu.com/s/1hqgZhkg', '安利忍', '2015-06-23 17:08', 'NM', '地灵殿'),
(2541033, '自制 东方妖妖梦Lunatic难度 时符NMNBNR 拖延症犯了所以拖到现在才和PH的视频一块扔上来。这把运气非常不错，不过二面开幕打糟了，六面开始主要就是很紧张，所以缩了不少，樱78.9万，结算16.4亿，总体还算满意。天朝东方Lunatic难度NN合集：av2157349', '八云雪琉璃', '2015-07-08 01:58', 'NMNBNR', '妖妖梦'),
(2586803, '自制 妖妖梦超亲民', '幽U子', '2015-07-17 18:38', '低封', '妖妖梦'),
(2642577, '自制 自己的第一个L带N，纪念一下', 'mylove7210', '2015-07-28 18:36', 'NM', '风神录'),
(2761869, '代投 机师授权\r\n机师：火紫 机签：WHZ、zizi\r\n东方绀珠传lunatic难度 no bomb 5残通关\r\nup主：道中压的相当漂亮 boss姿势也比较完善 值得一学\r\n喜欢的话就刷些弹幕吧\r\n具体的讲解及REP：http://bbs.nyasama.com/forum.php?mod=viewthread&tid=50803', '脳浆炸裂ひさ子', '2015-08-19 02:54', 'NB', '绀珠传'),
(2904656, '自制 其实一开始让我10小时打完殿LNM我是拒绝的，然而在4面疮痍之后再开一把就NM了这种事我也没有办法（\r\n希望这个视频对同样喜欢魔A这个机体的人有帮助吧（\r\n亲民殿超亲民！', '死灵の夜樱', '2015-09-13 19:43', 'NM', '地灵殿'),
(2933302, '自制 开学好忙啊PAP。这个低封全关也是打了接近20H，比起混关，多了很多遭点，而且自机火力也会有所下降，难度和庙MN接近。估计这期出完了后面就是庙NM了吧。求关注，求点赞(づ￣ 3￣)づ么么哒！', '琴女买了个大圣杯', '2015-09-20 15:13', '低封', '红魔乡'),
(2951605, '自制 妖妖梦L难度NB1R残2，沙包第一个真正意义上的LNB，这次部分撞的地方也是挺蠢的，不过还好也收了不少东西，嘛，总之是成功打出来了，之后也会慢慢尝试别的作品吧', '486934guo', '2015-09-25 00:29', 'NBNR', '妖妖梦'),
(3030383, 'replay来自royalflare 地灵殿高分世界纪录保持者、强迫症患者、闲比、死宅、咸鱼王gobou肝了一个半月，终于成为了全球第一个达成绀珠传L模式L难度No Miss No Bomb成就的玩家（信じられない、君は本当に人間なのか？——ZUN）！鼓掌！【啪啪啪\r\n除个别地方打开方式不够正确看上去有点危险以外，大多数地方非常非常混，以至出不了奖残。有意开荒NB的同学可适当参考。', '米格照相机', '2015-10-08 18:58', 'NMNB', '绀珠传'),
(3031767, '自制 这人呐，发气来了挡都挡不住，回到家打算打一发练练手，居然直接NN了！可以看到我一开始手感都没找回来，并且一些地方的失误也十分明显，不过这都挡不住发气的溢出。从开坑到今天完成NN，一共花了约35小时……想成为大触，对自己的信心是必须的。之前在贴吧看到泪世一一发LNN，虽然觉得厉害，但是觉得自己也能办到，所以便在NN妹红受阻后有了这个想法。经过不断努力研究与练习终于成功了。不要认为大触高不可及，相信自己也能行！', '萌吃货UZ', '2015-10-08 23:37', 'NMNB', '妖妖梦'),
(3039238, '自制。rep地址：http://pan.baidu.com/s/1sjEEsUT\r\nrep完成于10月2日。好像比nm那个打的稍微浪了一点。\r\nnb感觉不比nm难多少吧。。因为可以全程无雷无敌扭。就是决死比较烦。。。我是拔了X才打出来的。\r\n玉枝差点神作。。还好有惊无险。。\r\n封面P站id=52053527', '黑白瓶', '2015-10-10 17:53', 'NB', '永夜抄'),
(3039239, '自制。rep地址：http://pan.baidu.com/s/1pJw13f1\r\nrep完成于9月23日。。（拖延症什么的。\r\n永nm应该算是nm里没那么糟的了。。毕竟可以决死。也是第一次打出L难度的neta。\r\n封面P站id=52419951', '黑白瓶', '2015-10-10 17:53', 'NM', '永夜抄'),
(3061916, '按朋友要求制作代投 星莲船LNB伪NV，机师：风车星莲V四季（现在名字有没有简化呢？不知道……）。4面道中上线收点不小心一口气吃了两个碟碎片，之后倒是就没再吃到碟碎片了，全程4Miss，分别在三前半，溺符，莲二非，魔神。一路看着看四季3月份开始开荒船的neta，然后船LNB，船L10E刷分，船LNBNV，他也一路坚定着对星莲船的信仰走到了这里。也是不容易呢，可喜可贺，可喜可贺。', '一叶紫荆', '2015-10-15 13:48', 'NBNU', '星莲船'),
(3086553, '自制 亲民红超亲民！亲民妖超亲民！亲民永超亲民！亲民花超亲民！亲民风超亲民！亲民殿超亲民！亲民船超亲民！亲民城超亲民！亲民传超亲民！', '死灵の夜樱', '2015-10-19 21:20', 'NB', '永夜抄'),
(3123696, '2015年10月25日22时', '米格照相机', '2015-10-26 22:17', 'NMNB', '红魔乡'),
(3133013, '自制 2015年，东方花映冢的十周年之际，铃仙终于再一次当上了自机，不同于体验版，绀珠传正式版的铃仙拥有着不俗的实力。\r\n随着power降低，兔子火力的降低幅度并不大，兔子有着和魔理沙相当的火力且在对付大体积的纯狐时进一步能造成更为可观的伤害。\r\n兔子作为绀珠唯一的贯穿机体可以轻易的击杀稀神探女，可以说是绀珠传的代表性强力机体。\r\n\r\n所以这次理所当然的选择了5道中能玩的灵梦。\r\nreplay：\r\nhttp://pan.baidu.com/s/1i3nR8Pn', '啊呜蛙蛙', '2015-10-28 23:25', 'NB', '绀珠传'),
(3220034, '自制 人生第一LNM达成，全程采用了较为安定的思路，参考是米卡爷爷的风nm，在此感谢，还有群里的各位给我的帮助和支持，一并谢过。\r\n高能：准备，神粥，天水1b（ 。喜欢针巫女的同学可以学习下，对开荒有一定帮助。', '999只琪露诺', '2015-11-14 18:43', 'NM', '风神录'),
(3229168, '自制 好久不见。考试挂归。这次是帮@风车星莲v四季 四季神触投的，东方地灵殿Lunatic NB视频，此人之前打过船的NBNV，是个会吃人的触手，打出NB也是随手，目测以后还会有一堆他的NB视频好投。作为一个渣渣，第一次解说NB视频，我有点不知所措23333。因为这个月有点空所以应该会投一个初通系列（风）。顺便，依四季师傅本人的意愿投了一个无解说版，内容其实是一毛一样的~', '幻雪アホに', '2015-11-15 23:55', 'NB', '风神录'),
(3249038, '自制 星莲船L苗b机体nb通关 机师：mengo\r\nrep完成于11月5日，算是我的第一个L难度nb通关，56面高能，路线上参考了亲民船教主蛋西湖的船nb初通，在此表示感谢\r\n特邀神秘嘉宾进行解说，同时也感谢这位神秘嘉宾的录制\r\nrep地址：http://pan.baidu.com/s/1qWy3pt6', 'mengo', '2015-11-20 13:14', 'NB', '星莲船'),
(3274641, '机师yusuke，坑了这么久的东西终于打出来了。另外八分饱全程缩比233其它的我还没看，先搬了再说。视频来源：https://www.youtube.com/watch?v=tQJaAk39rgI', '幽U子', '2015-11-24 18:08', 'NMNBNR', '妖妖梦'),
(3281054, 'https://youtu.be/tQJaAk39rgI yusuke这几个月就都在坑这玩意。据本人说完成的那一刻感觉跟拿到WR一样爽。说好的梦B肛NAYA呢(╯‵□′)╯︵┻━┻', '米格照相机', '2015-11-25 22:43', 'NMNBNR', '妖妖梦'),
(3311735, '自制 打了一个月终于打出来了，在此之前一直是一只N党，感觉这个过程真的很不容易，同时感谢各位师傅的悉心指导。（p.s.打完太激动把机签的nb写成了nmnb真是哈子卡西，希望有朝一日也能真的打出NN吧（误', '九条爱丽丝', '2015-12-01 14:10', 'NB', '风神录'),
(3326516, '自制 replay：http://score.royalflare.net/th14/replay14/th14_ud06a3.rpy\r\n运气真是好~', 'apple丶Y', '2015-12-04 15:27', 'NMNB', '辉针城'),
(3328619, '自制 路线出来以后没几发就打出来了，由此证明，神灵庙超亲民。全作最水nm没有之一', '幽U子', '2015-12-04 21:13', 'NM', '神灵庙'),
(3383485, '自制 东方红魔乡Lunatic No Miss. 从去年12月开坑至今已整整一年，夙愿得偿再无牵挂，可以安心退坑了。\r\n\r\n视频分2P。Rep 4面boss出错（从5面继续没问题）Rep爆炸会传染吗？前几天针师傅的虫姬1Ultra就炸了\r\n\r\n因为2个月前8-3见蕾米然后龙珠了（然后把游戏删了好久），所以这次打得非常拼，糟了一年也算是发了一回', '星海天下', '2015-12-14 00:59', 'NM', '红魔乡'),
(3466668, '自制 我还没开坑，你就倒下了www\r\n晚上瞎打结果就打出这么个来，真是运气好到爆啊~依靠灵梦的好身材钻了不少地方呢orz\r\n别问我为什么用梦A，我也不知道。。。算是欢送2015吧，2016年希望能把现在挖的5个大坑填上呢~提前祝各位新年快乐', 'mylove7210', '2015-12-28 10:11', 'NB', '风神录'),
(3495688, '自制 新年快乐！东方风神录Lunatic难度 nomiss通关录像 机体魔理沙C~\r\n全程只收掉了1面道中符（其实这卡也完全可以炸掉23333\r\n底力差也能nomiss？风就是这么亲民！（~', 'pia♂pia♂~~', '2016-01-01 21:38', 'NM', '风神录'),
(3502766, '自制 |东方妖妖梦Lunatic难度NoBomb，机体：灵梦B。\r\nreplay下载：pan.baidu.com/s/1dDJurlf /封面id=3132810', 'Rainnye', '2016-01-02 20:00', 'NB', '妖妖梦'),
(3505964, '自制 感谢樱花师傅帮忙录制视频。封面pixiv ID=17184292\r\n本意是想用针巫女打的，不过因为打不过骚灵老大二非所以果断换魔理沙。（hhh\r\n全程打得偏咸鱼，请勿喷。', '聖鈴仙', '2016-01-03 06:32', 'NB', '妖妖梦'),
(3506547, '自制 东方风神录lunatic no bomb。全程卖萌。撞简单的收难的什么心态2333（\r\nmiss点就不说了，用心去体会（（锤地', '999只琪露诺', '2016-01-03 10:26', 'NB', '风神录'),
(3514016, '自制 封面p站ID=53770702\r\n人生第一lnb，总游戏时间84小时。\r\n也算是风神录lnn的阶段性产物，因为打的比较脸黑，所以各位在视频中会不可避免的看到“哦草这波真瞎”\r\n同时也是寒假前最后一稿，果然还是想以stg收尾呢~\r\n仍然会用底端弹幕进行一些蠢蠢的解说。\r\n感谢大家支持。', 'W羽天', '2016-01-04 12:02', 'NB', '风神录'),
(3566775, '自制 地灵殿Lnb梦a机体通关纪念 机师：mengo\r\n这个rep完成于去年12月初，是我的第二个L难度nb通关。期末季大家都比较忙所以一直到现在才投上来。视频是委托白god进行的录制，并附有白神的解说，在此表示感谢！', 'mengo', '2016-01-12 15:21', 'NB', '地灵殿'),
(3573049, '自制 rep：http://pan.baidu.com/s/1sjTjGM5\r\n希望对大家有所帮助', '幽谷啊哈', '2016-01-13 15:41', 'NM', '神灵庙'),
(3608388, '视频时间2015.10.29，机体：东风谷早苗，机师Y.S，youtube@매냐 / Y.S。\r\np1地址https://www.youtube.com/watch?v=M9K3XQqHc14', 'Neutrium', '2016-01-18 15:59', 'NM', '绀珠传'),
(3622980, '自制  神灵庙Lunatic禁雷禁灵界通关  机体：灵梦  机师：mengo\r\n这个rep是在考试周某天中午一发娱乐打出来的，说实话这么快打出来也挺惊讶的，本来还以为要再打半年的说……\r\n这次邀请的是亲民船教主蛋西湖来为视频解说，录制同样委托的是白神，在此表示感谢~\r\n巧合的是我前三个lnb完成时间分别是11.5 12.5 1.5，那风nb我就争取2.5打出来好了（大雾', 'mengo', '2016-01-20 17:34', 'NBNT', '神灵庙'),
(3628148, '自制 纪念向，感谢N神帮录制\r\n教科书一般的规划MISS，非洲人打什么麻将（', '朝仓千弘', '2016-01-21 13:04', 'NB', '风神录'),
(3628224, '自制 糟了几个礼拜打出来的东西，我发现每次打出这种东西都是在早晨，果然是早晨状态好吧。\r\n坠机点   一面穰子终符1miss\r\n             二面NN\r\n             三面NN\r\n             四面椛椛1miss，文文二百十日1miss，无双风神1miss\r\n             五面早苗一符客星1miss\r\n             六面道中最后的大蝴蝶1miss，神德2miss\r\n      所以文文你还不快去六面？', 'DPL团团团', '2016-01-21 13:15', 'NB', '风神录'),
(3640369, '自制 先感谢帮助我的两位师父，我忍和夜樱，尽管我还不能当你们的徒弟，但是，请允许我称你们为师父，还有来自强挂长的规划，真的太感谢了！\r\n历时30个小时，300次桶道中，毕竟魔A。这次是执行的最好的一次，尽管有失误，但是还是打出来了一点自己的东西，比如针山，比如阿空四非，比如四面后半道中，这些才是我真正自豪的。\r\n炸炸扭这种东西，实在是太糟了！魔机的判定，实在是太糟了！', 'jumbo♂lin', '2016-01-22 21:59', 'NM', '地灵殿'),
(3659657, '自制 耗时51个小时的东方神灵庙Lunatic NBNMNT。1月23日下午随便练一发居然打出来了，意想不到。神灵庙总体来说还是很糟的，许多地方很看脸，当然对底力要求也不低。', '萌萌吃货UZ', '2016-01-25 10:32', 'NMNBNT', '神灵庙'),
(3682100, '自制 基本上独立开荒。小四个小时打出来的，其中近三个小时在练习0P进5的走位，以及2P进4，0P进6的走位。这次虽然糟，但是早有准备，所以还是有惊无险。执行力不够怎么办？那就多规划一些容错吧，如果有容错的话。如果每一面都在练习的时候资源是结余的，那么，就算再糟，也有通的可能！0P进5,0P进6，就算这种情况，也有可能通！\r\nP.S.1.天水哪里上去的时候怂了炸太早了要不然能1B炸掉，导致最后很险。2.不要懒得用init然后开局放b联系单面，否则就会出现四面开局的sabi情况（拍脸\r\n封面来自风骚', 'jumbo♂lin', '2016-01-27 23:23', 'NM', '风神录'),
(3727586, '自制 魔理沙机体no miss 规划流程教学，展示各种1C2身（？\r\nrep：http://pan.baidu.com/s/1c1jrk4o', 'yudc11', '2016-02-01 22:43', 'NM', '神灵庙'),
(3743787, '自制 首先感谢夏世一帮忙制作的视频，那么这里也是有幸完成东方地灵殿Lunatic no miss成就，机体梦A。作为人生第一个Lneta的纪念，特地录制了此视频，其中大部分各位要是没见过的走位基本是我经历无数次biu后对一些nmnb和nm视频里的走位个人化改良，如有雷同，估计也是少数了，因此希望这些不同的走位能给开荒neta的各位带来帮助，最后也希望以此视频激励我继续前行 。\r\nrep：http://pan.baidu.com/s/1i42e561\r\np站id=16416537', '幽雨遥', '2016-02-03 18:34', 'NM', '地灵殿'),
(3745794, '自制 首次投稿，第一次学习录制，投上来看看效果。。感谢幻雪姐姐的教程\r\n替换了BGM，主要欣赏五boss和六道中吧233\r\n不过因为是直接把wav文件放到文件夹里的，说不定在哪个地方就循环了..', '七份蓝莓圣代', '2016-02-03 22:02', 'NB', '红魔乡'),
(3792037, '自制 2月6日完成的风NB，总开荒时间22小时\r\n学着用软件替换了BGM，fa乐器果然是最美妙的乐器呢233', '七份蓝莓圣代', '2016-02-09 10:52', 'NB', '风神录'),
(3809267, '自制 东方妖妖梦lunatic低封实况，这么打飞机的我脑子一定是有问题。\r\n电脑越来越辣鸡了，6面录坏了，所以看6面请移步2P。', '能用就吃翔', '2016-02-11 17:23', '低封', '妖妖梦'),
(3814826, '自制 第一次投稿……也是纪念一下第一个东方neta。\r\n感谢开荒该neta过程中给予我帮助的人。\r\n感谢jumbo的录制。', '深渊魔魂', '2016-02-12 11:57', 'NM', '神灵庙'),
(3821728, '自制 东方妖妖梦nb3r残3（nb伪nr达成）\r\nrep完成于几个月前。。具体时间记不清了\r\n感谢亲师傅白神@shirob的录制~！', '星色灯光瓶', '2016-02-13 01:42', 'NBNR', '妖妖梦'),
(3825321, '自制 replay：http://score.royalflare.net/th14/replay14/th14_ud06b6.rpy\r\n封面pixiv id：50598459\r\n运气还是很好233', 'apple丶Y', '2016-02-13 15:34', 'NMNB', '辉针城'),
(3826482, '时间：2016.1.26 这把初nb全程脸都很好，包括各种神穿、压制失误后的救场 大概算是开荒nb的首选机体', 'mengo', '2016-02-13 17:31', 'NB', '风神录'),
(3906513, '自制 妖妖梦NO BOMB通关。我还没开坑你就倒下了www\r\n妖梦道中符撞得真是太蠢了，我都没脸见妖梦了orz\r\n封面id：6540118', 'mylove7210', '2016-02-21 10:14', 'NB', '妖妖梦'),
(3951243, 'replay来自royalflare 风神录打分最不友好的机体之二灵梦A尘封长达4年半的记录被打破。', '米格照相机', '2016-02-26 01:17', 'NM', '风神录'),
(3960294, '自制 经过了艰苦的奋斗（其实连十小时都不够2333）终于是通了妖的LNB\r\n妖的NB主要是规划，然而对我来说控樱=拼脸，这次算是脸好，居然执行成功了一半的规划，所以也就打出来了\r\n由于妖的流程实在太长，所以一些无聊而且慢的地方我就直接快进了\r\n四boss和反魂蝶BGM高能', '七份蓝莓圣代', '2016-02-27 01:35', 'NB', '妖妖梦'),
(3975062, '自制 封面id=54011639\r\n好像不小心把视频录坏了，嘛，看看就好，白神那边应该会有比较好的版本（\r\n剩下的，好像没有什么要说的了\r\nSTG真是有趣啊（www', '死灵の夜樱', '2016-02-28 15:16', 'NMNB', '永夜抄'),
(3990951, '自制 封面来自Koishi，这个风格好赞pap\r\n再一次高估了游戏难度导致单面练习时间过多（而且没啥成效）\r\n0残，17卡，弹窗杀x3，值得看或者学习的地方——基本没有，四面道中的走位也许能学一下吧。\r\n不得不说，毒奶的力量真强大，刚奶了一口结界稳反魂蝶就少了一个森罗……\r\n妖妖梦能不能控制音量啊，我反魂蝶靠音效开结界，然后因为bgm声音太大而少算了一次（\r\n嘛，通了是通了，就算纪念吧。感谢ATM挂长以及guo师傅。', 'jumbo♂lin', '2016-03-01 17:07', 'NB', '妖妖梦'),
(4014768, '自制 永夜抄LNB，也不算很难的一个LNB\r\n虽然封面是辉夜，但其实打的是6A线  ....没办法，黑长直真的好漂亮好漂亮\r\n顺便说一句，如果有想开荒永LNB的同学，请千万不要去和辉夜玩耍(血的教训）\r\n五道中的BGM导出后才觉得挺不满意的，不过也懒得再换一次了，将就着看吧。。虽说也没什么人看\r\n六面的千年坷垃乡绝赞~', '七份蓝莓圣代', '2016-03-04 23:46', 'NB', '永夜抄'),
(4017137, '自制 东方星莲船l难度禁止扔雷，9L伪NB\r\n道中练习过于少于是试着试试水，结果发了…\r\n于是就有了这个道中瞎撞神穿好多的rep\r\n\r\n另外不知从什么时候开始，流行起一股不用背板随便扭扭的热潮\r\n理解为【我瞎玩都比你认真玩要厉害】的吹比句子就行不要真的以为避弹能解决一切啊', '啊呜蛙蛙', '2016-03-05 10:52', 'NB', '星莲船'),
(4026109, '自制，机师：SW-el\r\n\r\n纪念两天的人生，独立开荒的第二个NB\r\n0残见猫步0残见爆符的时候我已经无所畏惧啦！\r\n\r\nreplay : http://pan.baidu.com/s/1qWZBsr6', '平坂景子', '2016-03-06 02:03', 'NB', '地灵殿'),
(4030094, '自制 机体魔b\r\n本来想刷更高分结果打完发现差距很大，估计路线要大改\r\n初通留念', '九条爱丽丝', '2016-03-06 14:26', 'NB', '地灵殿'),
(4031515, '自制  神灵庙L满残NM  机体：魔理沙  机师：mengo\r\n某日看到群里讨论神满残后自己手痒的产物，填坑过程还算顺利，用时大概不到10h\r\n之前也看过很多神满残的视频，绝大多是是妖梦，也有魔魔丸的灵梦，所以这次选择了一个不同的机体，希望能给与我一样不习惯妖梦操作、想用魔理沙开荒满残的童鞋一些帮助吧~', 'mengo', '2016-03-06 16:39', 'NM', '神灵庙'),
(4082751, '自制，机师：SW-el\r\n\r\n今年的第一个NB。前面不糟后面糟，后面不糟前面糟。四残见神德怎么输？\r\n\r\nreplay : http://pan.baidu.com/s/1gdPyMxP', '平坂景子', '2016-03-13 02:13', 'NB', '风神录'),
(4083036, '自制，机师 : SW-el\r\n\r\n人生第一个NB，全程犯蠢卖萌撞注意(?\r\n\r\nreplay : http://pan.baidu.com/s/1c0sB2E0', '平坂景子', '2016-03-13 03:44', 'NB', '辉针城'),
(4100650, '自制 东方风神录L针17.79e。这分数也是混的比较菜了。不过运气也是不错，第一次尝试解说。。全程口胡233（（', '999只琪露诺', '2016-03-15 00:24', 'NM', '风神录'),
(4150354, '自制 昨天深夜打出来的，迷迷糊糊撞了好多不该撞的地方，不过也总算是通了\r\n六面的BGM我非常喜欢，大概是我用过的最魔性的BGM了\r\n顺便有好看的阿空图求推荐，我好换个更好看的封面。。', '七份蓝莓圣代', '2016-03-20 23:18', 'NB', '地灵殿'),
(4156594, '自制 机师：七份草莓圣代。该机师在2016年3月20日完成全作低封NB，辉针城是最后一作。由于在旁边全程观看（超紧张），所以录个视频纪念一下。也会把该机师比较好玩的REP放上来大家欣赏O(∩_∩)O', '已被领养草莓布丁', '2016-03-21 21:06', '低封NB', '辉针城'),
(4156946, '自制 机师：七份草莓圣代。机体：灵梦。2015年10月28日在B站直播打出，观赏性很强，剧情性也很强（谜）。据说这是该机师的绀珠传二通，初通是同天直播的0卡NB。一起来欣赏吧O(∩_∩)O', '已被领养草莓布丁', '2016-03-21 21:50', '低封NB', '绀珠传'),
(4164594, '自制 机师：七份草莓圣代。机体：魔A。两个多月前的一个REP，我觉得挺好玩的就录上来了。看这个视频会有种错觉——“哇这机体火力好高雷也好多教练我也要玩地灵殿”，然后，然后，根本不是想的那样的！个人认为一个非常有观赏性的录像O(∩_∩)O', '已被领养草莓布丁', '2016-03-22 23:05', '低封NM', '地灵殿'),
(4174648, '自制 本人的第一次投稿', '法界の火', '2016-03-24 13:31', 'NM', '星莲船'),
(4176669, '自制 东方神灵庙lunatic难度妖梦机体一命禁雷禁灵界。坑了不知道多久的东西，夙愿终于达成了。\r\n封面来自百度魂魄妖梦吧的精品贴。\r\n以后可以在别人面前愉快地装逼说自己是国内第一了（然而实际上在各路触手面前依旧是被吊起来打）。\r\nrep：度盘1nugBihN', '能用就吃翔', '2016-03-24 18:21', 'NMNBNT', '神灵庙'),
(4189258, '自制 机师：七份草莓圣代。机体：魔A。“什么？不仅高威力而且低封都能NM！教练我也要用佐机”——然而不幸的是，这个REP正好是在机师实况风魔ANB疮天水之后，直播一发打出的。所以高威力装备到底亲不亲民呢？一起来欣赏吧O(∩_∩)O', '已被领养草莓布丁', '2016-03-26 10:22', '低封NM', '风神录'),
(4200966, '自制 魔机大法好！感谢深渊魔魂师父，Aiissac，Mengob，啊哈以及二翔的帮助。妖梦很好用，我选择魔理沙。\r\n直播的时候一把发了……毕竟是我觉得最求稳的一种打法，希望能作为一种参考吧，估计nm收不到18的也没谁了。\r\n如果正常发挥应该有3残容错，可是太谐了。\r\n封面：49105799', 'jumbo♂lin', '2016-03-27 12:32', 'NM', '神灵庙'),
(4254425, '自制 结算14.7E，顺便：用魔机的都是谐星吗？\r\n既然机师自己没啥话要说，那我就瞎说几句吧：樱花妹妹的REP特别具有观赏性，尤其是果断而又精确的穿缝，完美的体现出了一个魔机狂热爱好者的实力。（不过也展现了魔机使一贯的谐星风格，不要打我）。以上，就请大家欣赏这个REP吧qwq', 'jumbo♂lin', '2016-04-02 20:07', 'NB', '地灵殿'),
(4282413, '自制 东方风神录LNM 机体：魔理沙C\r\n信仰+龙珠=奇迹\r\nGO FOR THE NEXT DREAM！', 'Torabi', '2016-04-05 09:57', 'NM', '风神录'),
(4287476, '自制 代投  机师：f（x）  【可以叫他函挂比，数学轻松满分水平，规划触】\r\n该机师履历为8n0h1L，打风LNM是因为害怕打其他作随手高残通【迫真\r\n风专精，魔C子机摆放水平秒杀吾等渣包orz\r\n最后，函挂长千秋万代一统风神之湖！\r\n-----分割线-----\r\n这个nm打的真的非常棒，走位很流畅，5面道中打得非常完美，Boss战全程皇家炸比模式，完全可以当成一份风L攻略呢\r\n希望能帮助到开荒风的同学www\r\nrep：http://pan.baidu.com/s/1hrL2wCk\r\n封面为风', 'SolitaryL', '2016-04-05 21:30', 'NM', '风神录'),
(4306720, '自制 攻略贴：http://tieba.baidu.com/p/4007564780', '星尘☆狂欢', '2016-04-08 13:05', 'NMNB', '妖妖梦'),
(4308743, '自制，总游戏时间44小时。\r\n人生第一个NB，画质渣不要在意。', '隐蓝', '2016-04-08 17:47', 'NB', '风神录'),
(4315272, '自制 恭喜朱大师！不知道被动C了之后射击算不算NT，我觉得是算的，嘛……\r\n本来以为这一段时间有机会能超过朱大师呢，结果差距还是如此的明显啊！毕竟是我师父。', 'jumbo♂lin', '2016-04-09 12:22', 'NBNT', '神灵庙'),
(4334698, '自制 多谢樱花再次帮助录制视频（2333\r\n辉第3LNB，花了接近一个月半才填上这个坑。\r\nmiss点：狼二非，二符，三非。4道中前半，弁弁一符，二符，三非。正邪一非，一符，二符。小碗四非双杀，终符也撞了。\r\n总共12miss。\r\n嗯，由此可见辉针城的禁雷也有很多的残去打，所以非常的亲民~（\r\n弁弁一生推，正邪小碗一生黑，继续打庙去了（', '聖鈴仙', '2016-04-10 23:34', 'NB', '辉针城'),
(4350915, '自制 总是疮17条，这次终于展现了欧皇实力', '蓝紫色的忧郁', '2016-04-13 00:14', 'NB', '神灵庙'),
(4360897, '自制 东方星莲船lunatic难度 满残nomiss通关视频\r\n也是个打了好久的坑了，终于有幸填上，不仅有自己的努力，也要感谢心善的莲妈_(:3」∠)_\r\nqmccqm bsbyw!', 'pia♂pia♂~~', '2016-04-14 12:23', 'NM', '星莲船'),
(4389627, '自制 断断续续打了三个月快四个月了呢，总算打出来了。说到底还是自己太作死啦www\r\n在海叔直播间学了不少神奇的姿势呢orz\r\n魔法阵真是瞎了，无意识下扭了两下结果过了，真是自己收的最莫名其妙的一次魔法阵了呢', 'mylove7210', '2016-04-17 09:40', 'NB', '红魔乡'),
(4394529, '自制 气势上树nn了正邪，残机城超亲民', '蓝紫色的忧郁', '2016-04-17 16:41', 'NB', '辉针城'),
(4408703, '自制 机体早苗，这个坑很早就有想过打，出于某种原因现在给填了，离理想分还差1000w，6面崩的不行强行给救回来了\r\n机师：九条', '九条爱丽丝', '2016-04-19 09:23', 'NM', '神灵庙'),
(4431624, '挑战风LNM成功！既紧♂张又兴♂奋！风L魔CNM达成！ 我是在1月28日早上NN的，谁说早上“糟”气蓬勃呢？ 从4面我开始紧张，虽然一边打飞机一边提醒自己只要完美执行这一面的规划就可以了，但是仍然控制不住紧张。NM成功直到当天8点，这种紧张感还没消除。 录像：http://pan.baidu.com/s/1gek4Yf5', '猫耳爬行者', '2016-04-22 00:40', 'NM', '风神录'),
(4490942, '自制 坑了很久的红魔乡LNB系列。也算是STG的一个进阶吧，配上了自己喜欢的曲子，希望大家喜欢~', 'pia♂pia♂~~', '2016-04-28 13:27', 'NB', '红魔乡'),
(4518059, '睡醒后的一发产物，浑浑噩噩的，感觉能撞的都脸过去了，撞得都是些稳得一笔的东西啊orz\r\nP2是1面的练习，1面打的太烂了，补一个还能看的一面好了www', 'mylove7210', '2016-05-01 00:49', 'NB', '永夜抄'),
(4523648, '自制  东方红魔乡Lnb纪念  机体：梦a  机师：mengo\r\nrep打出来有一阵了，不过前一阵期中各种忙所以现在才放上来，感谢瓶师傅的录制~\r\n红nb可以说是我开坑到填坑时间跨度最长的一个坑了，从9961到通关整整8个月，总之这游戏跟自己有种八字不合的感觉……这个rep高能的地方不少，尤其六面简直全程高能，具体哪里就请欣赏视频咯~', 'mengo', '2016-05-01 15:28', 'NB', '红魔乡'),
(4596494, 'rep：http://pan.baidu.com/s/1boJCsYb', '克劳恩啤酒', '2016-05-08 18:35', 'NM', '风神录'),
(4640112, '自制 东方地灵殿梦A LNB，没想到NB来得这么快\r\n道中糟成sabi', '隐蓝', '2016-05-13 18:59', 'NB', '地灵殿'),
(4660967, 'sm28637489 解说：のっぽん、みかみ\n选手：流星、めんこ、miso\n比赛最后演变成了一个NM就能第一的游戏\n先是流星3MISS不推把打出17.10亿 随后SOC1MISS糟出20.40亿 miso狂推一面 思考人生\n接着三位好像都有了点手感\n然而流星撞四终符，五终符，最后一把完美进六撞麻将山\nmiso先是撞六道中，后来一把又撞天水开幕\nSOC四面一如既往的惨，最后六面放弃治疗\n最终得分\n流星20.68亿\nSOC20.40亿\nmiso20.31亿\n旗鼓相当的精彩对决', '八云雪琉璃', '2016-05-15 13:11', 'NM', '风神录'),
(4676061, '自制 封面p站43947637\r\n人生第二lnb，总时长30小时。机体咏唱a（不是，你没看错）\r\n幸福来的如此突然以至于我不知所措。前三nn四面1m，后两面各种死于手抖，顺便黑死蝶超黑死飞行虫超飞行。\r\n依然会用弹幕进行解说。\r\n下来要挑战红船绀了吧。\r\n感谢大家支持。', 'W羽天', '2016-05-16 21:00', 'NB', '地灵殿'),
(4687998, '自制 又打了1个月，羡慕nb秒出的，羡慕神灵庙欧洲产的\r\n不多说了，希望大家喜欢~', '九条爱丽丝', '2016-05-18 10:02', 'NBNT', '神灵庙'),
(4692333, '自制。\r\nrep完成于一个月前。。懒人是这样的啊！\r\n感谢⑨⑨⑨师傅的魔改。\r\n东方半退坑状态，不知道下次投稿要等到什么时候了。。。', '西行寺丶瓶', '2016-05-18 19:23', ' NB', '风神录'),
(4702796, '自制 飞行时间20h左右。在经过了无数单关单卡练习之后一发糟通。主要练了黑死蝶，飞行虫，猫步。人生第一个Lneta，还是挺满意的吧，唯一不满意的就是没有状态，许多地方不该撞的。另外，在下新人沙包，请各位神触大佬多多指教~', '紅蓮TsunDere', '2016-05-19 22:09', 'NB', '地灵殿'),
(4803715, '自制 感觉这次算是最近能打出来的最好的一次了吧，NB3M，至少满残这个小neta有了，可以稍微水一波视频，希望能帮到喜欢魔A这个机体的人吧w（P.S.也不知道打的时候直播间里谁说了一句，还有埋骨，反魂蝶，稳了）', 'jumbo♂lin', '2016-05-29 17:11', 'NB', '妖妖梦'),
(4814725, '普通的殿LNB5M（\n1面究极难', '死灵の夜樱', '2016-05-30 19:17', 'NB', '地灵殿'),
(4842262, '自制 不知道谁让我打的全机体然后我就打了。。。感谢蛙挂长的妖梦rep指导，嗯。。好像没什么想说的了，各位观看愉快~', '九条爱丽丝', '2016-06-02 18:49', 'NBNT', '神灵庙'),
(4867077, '自制 于是懒癌晚期的up主又爬起来继续打飞机了。然而还是太菜（\r\n咋说，毒爪撞了之后本来还以为通不了，所以后面几乎弃疗。\r\n不过没想到这次婶子这么给脸。（一脸懵逼.jpg）\r\n这次感谢jumbo挂长帮助录制2333 \r\n看来离庙专精这个位置还是远得很...（慢慢打吧==', '聖鈴仙', '2016-06-05 02:06', 'NBNT', '神灵庙'),
(4891368, '自制 这里是新人UP主为大家带来的东方妖妖梦nomiss解说，希望大家喜欢。', '能用就吃翔', '2016-06-07 12:45', 'NM', '妖妖梦'),
(4903798, '初尝试低封混关，本来就是打算玩玩诱导机，觉得会不会太简单了点就选择打个低封玩玩...结果开荒了2个小时就通了，打的还挺满意的，0抱B，自己定的路线规划，第一次nm出3就通啦~（紧张.jpg）大概就是规划炸，熟练boss战，最好1p进下一面不然道中得被吃一残~\n最后：宁宁超萌超可爱~~~', 'ハッカちゃん', '2016-06-08 16:30', '低封', '风神录'),
(4905503, '自制，试着投个稿玩玩。本rep为东方风神录L难度nomiss录像。\r\nnm早在2015年六月份左右就打过了，不过当时没有存rep，这个rep是后来想打满资源nm时一发出的副产物。\r\n这是up主第一次（不算黑历史的话）录视频解说，各种口胡，电脑自带麦失真严重，大家凑合着看吧233', 'Mystery冰月', '2016-06-08 19:05', 'NM', '风神录'),
(4930371, '自制 日常打船结果发了一把', '云界伞妖', '2016-06-10 20:16', 'NM', '星莲船'),
(4939436, '自制 端午节前夜直播时候咸鱼了一个no miss出来，真的太咸鱼了都不太好意思发出来了orz\r\n之前打了一个49e的龙珠，如果有人感兴趣的话再评论区说一下吧，超过三个我就发出来了。。。\r\n前回→av4102039 再前回→av3689234 \r\n怎么说呢，国内不少东方玩家都有受到mmw的影响吧，从他的视频也学到了不少来着，向丸子表示感谢，顺便这里是丸子的no miss→av1042503', 'mylove7210', '2016-06-11 15:44', 'NM', '永夜抄'),
(4989879, '自制 NB有C3M，一发出，真的是佩服自己的脸和猴力233\r\n机师我很懒，这次就不写简介了233', '琴女买了个大圣杯', '2016-06-16 15:42', 'NB', '神灵庙'),
(5046638, '自制 第一Lneta（虽然还是很弱）\r\n妖L总时间20h+，正式开坑到打出大约7h\r\n基本独立开荒，参考了各阶段击破收点数量\r\n这次的rep完成度也是非常高（除了四面关底短暂的崩盘），练习都没有打这么好过（甚至看上去像是NN打糟的局）\r\n1235面NN，四面六面各3M，共收取14卡\r\n有空做个解说吧orz\r\n\r\n封面图id 53181937', '名字不能是空格', '2016-06-21 18:09', 'NB', '妖妖梦'),
(5074175, '非常好学（', 'Angel♂♂', '2016-06-24 11:49', 'NM', '风神录'),
(5157338, '自制 有些东西看起来不难，但只有真正去做，才知道有多糟，NN就是这么个东西.......\r\n所以为了减少芳度全程不敢收点2333\r\n不过既然打出来了就撒花吧~\r\n历经了三次1M，两次9961，已经没有什么好害怕的了（雾）', 'pia♂pia♂~~', '2016-07-01 12:55', 'NMNB', '妖妖梦'),
(5158724, '鈴仙太強，難度不高。', 'DJRock', '2016-07-01 14:56', 'NM', '绀珠传'),
(5174981, '自制 东方永夜抄Lunatic咏唱组Nomiss 机师：123sweet\r\n123挂长自称是我徒弟，但是实际上比我触（我没有你这么触的徒弟.jpg）\r\n这个rep各种底力强推，规划Bomb看上去非常少，充满了见机行事的决死，咏唱组的火力也是让人大呼痛快，嗯有机会我也想试一下。\r\n总之，表示祝贺，祝STG更上一层楼。', '幻雪アホに', '2016-07-02 19:50', 'NM', '永夜抄'),
(5175969, '(´；ω；`)', 'DJRock', '2016-07-02 21:02', 'NB', '风神录'),
(5200020, '自制，封面id=44900302\n以前投过视频，一直想解说但是没有麦，就让秒杀君帮我解说了一下，想想还是把前面那个视频删了重新投一个。这个rep完成于5月22日，是我的第一Lneta也是梦a的初通。\n走位很缩，非常咸鱼，不带任何打分动作。制杖撞数次，收卡21张，算发挥正常。\n为什么封面是⑤？看视频就知道了（\n感谢秒杀君，感谢各位指导我的dalao，感谢泡西湖。', '妄想KUN', '2016-07-04 18:42', 'NB', '地灵殿'),
(5206090, '东方神灵庙满残，自制。\n封面与视频内容无关。\n如果出现什么问题，锅在我录制技术不熟练上。\n这个坑差不多打了五个月……总算也是有了个结果。\n不过，也没什么好说的。毕竟神灵庙满残的规划比no miss严格得多，自己感觉中套路就是那么几条了……\n部分个人认为有价值的细节，会在底端蓝字进行解释。', '深渊魔魂', '2016-07-05 09:25', 'NM', '神灵庙'),
(5265994, '无数次见到神妈，无数次疮在麻将山，最后终于成功裸通\nmiss点：流刑人偶，四面第二只大蝴蝶，椛，猿田岔道，无双风神，八坂之神风，六面最后一只大蝴蝶，麻将山\nrep：http://pan.baidu.com/s/1kVi19YJ', '克劳恩啤酒', '2016-07-09 19:52', 'NB', '风神录'),
(5270401, '人生第一个NNN可喜可贺，苗机打完隐隐约约就觉得能打这个neta，也算是打掉了神灵庙这个作品比较核心的一个neta，之后可以随心填小坑了', '九条爱丽丝', '2016-07-10 02:19', 'NMNBNT', '神灵庙'),
(5305763, '东方红魔乡梦B no Boom ，不清楚打了多少时间了，感觉这个NB来得意料之外', '隐蓝', '2016-07-12 19:31', 'NB', '红魔乡'),
(5363130, '两周前的产物，怎么说呢，入坑两周年的纪念什么的吧？\n吹空调感冒了，所以源计划录的两个解说视频都只能往后顺延了，大概不会有生之年orz\n头好晕，姑且先这样了，祝大家观看愉快\nmiss点：2道中符，4开幕，桦，桦增援，文三非，5道中和。。。御柱\n封面如果引起不快请告之up主更换orz', 'mylove7210', '2016-07-16 23:08', 'NB', '风神录'),
(5424858, '还是蛮咸鱼没打NT，但也是打出的第一个lneta纪念一下，准备练习下糟点开坑NBNT，全程sabi撞地方特别多（貌似在发呆', '追憶鎮魂歌', '2016-07-21 11:52', 'NB', '神灵庙'),
(5457514, 'Up主新鲜出炉的龙珠（1miss）。因为前2面太简单所以视频从3面开始录。\n本人东方红魔乡总飞行时间已达1000小时却仍未NMNB，只打出了9颗龙珠。辣鸡游戏毁我青春。\n\nNMNB什么的，已经无所谓了。因为已经不再有子弹，值得去躲了。不动如山的龙珠，已经不需要了。因为已经不再有游戏，值得去肝了。第一次有了喜欢的STG，有了能打一辈子的弹幕。两件快乐的事情重合在一起。而这两份快乐，又给我带来更多的快乐。得到的，本该是像梦境一般幸福的时间……但是，为什么，会变成这样呢', '星海天下', '2016-07-23 16:21', 'NB', '红魔乡'),
(5500805, '渣解说：曦光\n机师：tmd放假了（放假是什么）\n风神录nm，放肆噫（划掉）8颗龙珠以后召唤出的no miss（解说里面7颗龙珠是口误，不要在意），恭喜放41晋升Lneta党，本人解说吐槽非常业余，对不起各位看官，家里设备也不好，用手机的耳机录的音，求轻喷', '曦光布园', '2016-07-26 14:44', 'NM', '风神录'),
(5502645, '不会弄清晰度只能录个糊画质\r\n人生第一L neta\r\n咸鱼NM超咸鱼', 'GYSS改', '2016-07-26 16:44', 'NM', '风神录'),
(5525608, '这是一个励志的故事 总游戏时间192小时36分钟 打出了风L梦b的NM', '射命丸silva', '2016-07-28 00:28', 'NM', '风神录'),
(5535213, 'rep:http://pan.baidu.com/s/1i54RnA9 作为我的入坑作，妖妖梦是我通关的第一个lunatic难度游戏，也是第一个达成lneta的游戏，能通关还是挺开心的。游戏时间全机体71h，作为全作最简单的neta，算是打得比较慢的吧，还是naive啊。\nmiss点：二面道中 奥尔良 春之京 增援 4*4妖精阵*2 生者必灭 三非 埋骨 八分饱直弹 八分饱红弹  撞的很多东西感觉都菜，果然紧张的话，实战就是不行。还是要和大触们学习一个。', 'chanveii', '2016-07-28 17:48', 'NB', '妖妖梦'),
(5552006, '人生第一Lnb\n神德2m啥的太菜了', 'GYSS改', '2016-07-29 18:50', 'NB', '风神录'),
(5590023, '东方永夜抄NB录像，惊险刺激的sabi撞，完美吃点（\n感觉还没练熟练就把NB脸出来了，毕竟只打了20多h', '隐蓝', '2016-08-01 08:47', 'NB', '永夜抄'),
(5595993, '初投稿，画质渣，有地方卡，见谅(\n今年一月份的辉针城Lunatic No Miss，最近看了看发现挺值得吐槽的，发上来给大家分享分享，顺便试试obs(', '残机消失之夜', '2016-08-01 15:59', 'NM', '辉针城'),
(5616217, '自制 2015/8/13\r\n东方神灵庙LNNN\r\n总体弹幕强度：低\r\nNN难度：中\r\n\r\n视频中所有对游戏的理解仅限个人观点\r\n神灵庙打的少 见解浅 \r\n有更高级想法或者打法的同学可以在弹幕或者评论补充', '砂砾籽', '2016-08-02 19:49', 'NMNBNT', '神灵庙'),
(5620224, '大小姐，就算你很萌也不能那么难啊', 'wasupandceacar', '2016-08-02 23:53', 'NB', '红魔乡'),
(5628826, '新人自制 由于A线极缺点，难以到1100，所以道中收点极为作死，正常通关请勿模仿。\n三面大量借鉴了星神的初通，信星神得永生！', 'Oblivion117', '2016-08-03 16:09', 'NM', '永夜抄'),
(5681437, '2015/8/6\n东方红魔乡LNN\n弹幕糟度：高\nNN难度：高\n\n注意用词，非强度而是糟度（\n看完你们就会觉得解说有啥用（\n\n例行宣言，视频见解一切都是个人意见\n有更好的打法可以弹幕提出', '砂砾籽', '2016-08-06 19:01', 'NMNB', '红魔乡'),
(5721754, '自制 咸鱼自制。\r\nnm2b，魔理沙二非和大兔子二符决死。\r\n几个月没打永，打了一发竟然满资源了。。道中BOSS不少地方都忘了，打的特别缩。。\r\n啊啊啊啊魔理沙二非第一波安定位置站错了太蠢了。', '西行寺丶瓶', '2016-08-09 06:19', 'NM', '永夜抄'),
(5772356, '自制 终于在开学前把这个坑填上了，使用机体为魔理沙C，开坑到打成大约花时20小时，十分感谢在直播间里指导我的各位挂长们。\r\nNo Miss看起来很高端，但是在风神录这个雷多的令人发指的游戏里并没有那么难，主要还是对规划、心态、发挥以及脸的考验了。\r\n具体的一些细节我将在弹幕里进行解说。', 'waley22', '2016-08-12 01:24', 'NM', '风神录'),
(5799065, '打完风神录Lnm之后感觉浑身没劲，这是为什么呢......大概是坑的时间长了点，还是找点力所能及的东西打打吧...于是就有了这个东西。其实这个东西月初就打出来了，可是电脑一直没空。满残太难，我选择咸鱼（', '放假是什么', '2016-08-13 18:15', 'NM', '神灵庙'),
(5846396, '入东方450天之际（放肆！）终于打出了第一个（正式的）LNB通关。\nmiss点太蠢，以下只包括符卡中：三七，反魂蝶x2（所以你别的都撞了啥233\n\n于是第一E、第一N、第一H、第一L、第一LNB都打妖的妖厨也算是圆满了呢（笑）\n由于NBNR全靠猴，也就不做解说了。如果以后能打出NMNB倒是可以来解说一下，就是不知道打不打的出\n谁能想到一年前误打误撞入坑的沙包现在居然会在研究LNN呢（\n最后，我就是不打rep楼，雨天姐姐来打我啊（\n\n上期：av5046638（全程咸鱼的NB）', '名字不能是空格', '2016-08-16 15:01', 'NBNR', '妖妖梦'),
(5910659, '5面日常NN。', 'DJRock', '2016-08-20 04:29', '低封NB', '绀珠传'),
(5986790, '第一Lneta，感谢追忆师傅的指导。', '纳兹燐', '2016-08-24 16:34', 'NB', '神灵庙'),
(5992575, '自制 第一次投稿视频，由于人太懒，就找了个挂比朋友来解说，封面也是瞎找的不要在意啦，最后亲民风超亲民！', '墨染丶Scarlet', '2016-08-24 22:07', 'NB', '风神录'),
(6037936, '初次解说有点紧张，大家多多包涵哈\n永lnb2m，机师是我，算是首个像话点的视频吧（\n亲民永抄亲民！\n咏唱大法好！', '露娜厨一百二十三号', '2016-08-27 18:05', 'NB', '永夜抄'),
(6043802, '总游戏时间 213小时25分钟 在打出NM后的21小时 风LNB也打了出来 发气四溢', '射命丸silva', '2016-08-28 00:18', 'NB', '风神录'),
(6076525, '从4月到8月，总算是完成了神灵庙的全机满残NM，NBNT，不敢说熟悉庙的系统，让我随便上个机体我还是可以的（欣慰，咦？），可以安心退坑了', '九条華恋', '2016-08-30 00:36', 'NM', '神灵庙'),
(6089455, '风神录lunatic难度梦C的NB通关，风神录灵梦3机体NB达成\n被ゆーみや桑评价道＂秒殺君は上手な人＂来着~顺便非常感谢所有还记得在下的各位。最近在认真学习备考职称考试中，打飞机的时间非常少，月底发个视频保持月更的好传统www\n考试过去之后再把所有的坑慢慢填掉吧，拖了好久的永夜抄攻略真是不好意思啊orz', 'mylove7210', '2016-08-30 21:12', 'NB', '风神录'),
(6111207, '糟了一个半月的妖Lnb终于发了，虽然打得很不好，但是真的挺高兴的，第一次尝试L难度的neta，只想说魔机赛高！其他机体能做到吗（被拖走）\n主要还是控樱和规划，底力还是一如既往的差，嗯，继续加油吧', '曦光布园', '2016-09-01 12:30', 'NB', '妖妖梦'),
(6114448, 'miss点:伞道中符，娘娘道中非，布嘟嘟天舟\n伞符因为太困了没看清\n不过神子超给面子居然NNN了\n撞了停枪的NT不想糟了（没错我就是咸鱼\n从暑假前开坑到开学才打出来，飞行时间40H\n坑填上了就可以推黄油去了(\n露娜露娜露！！', '追憶鎮魂歌', '2016-09-01 17:09', 'NBNT', '神灵庙'),
(6125887, 'miss分布：三面3次，五面5次，六面2次\n第一次投稿（紧张），以后可能会把一些以前打的也传上来吧。', '火罐发电机', '2016-09-02 16:05', 'NB', '地灵殿'),
(6178589, '补档向，miss点：毒蛾，二非，小行星带，五道中，兔子二符，舍利子', '火罐发电机', '2016-09-06 15:57', 'NB', '永夜抄'),
(6208528, '人生第一個LNN。\n\n神媽三非最驚險，失誤走錯路只好硬穿。', 'DJRock', '2016-09-09 10:40', 'NMNB', '风神录'),
(6211149, 'rep:http://pan.baidu.com/s/1hspw4b6  \nmiss点 小爱一非 四面道中4*4妖精 骚灵一非 二非 三魂七魄*2 生者必灭 八分饱*2  果然4*4妖精是我无法逾越的大山，骚灵的非也是完全不会，简直看不懂。三七的两miss也说不上冤，生者必灭依然不会走，后面的反魂蝶，虽然收了18卡依然被八分饱打成狗。不过碰巧收了爱丽丝全卡和吔风还是很高兴的。', 'chanveii', '2016-09-09 15:08', 'NB', '妖妖梦'),
(6216892, '今天刚出炉的rep，应机师的要求代投\n嘛其实Lnb对于这位挂b来说已经不是稀奇事了，这已经是第四次Lnb了吧\n剩一残all，挂长其实现在十分忙，开飞机的时间挺少的，然而还底力并没有削减，不得不服\n嘛作为机师的同班同学，我只能表示压力很大qwq\n先在这里说一声恭喜，期待你的 no miss（笑，奶一发', 'Lollypop', '2016-09-09 22:46', 'NB', '红魔乡'),
(6228428, '5月份打出来的，但因为之前一直不会做视频所以到现在才投...\n有几个地方是脸过去的，5面才吃到满资源，换句话说就是又脸又缩啦。', '火罐发电机', '2016-09-10 20:14', 'NMNB', '辉针城'),
(6258252, '已重置\n虽然没啥人看吧(\n自己都看不下去了\n赶紧重置了\nrep：pan.baidu.com/s/1o81vWIu', '残机消失之夜', '2016-09-13 03:17', 'NMNB', '辉针城'),
(6295779, '嗯，梦Cnb4天后出了这个，有点快啊（汗），这机体的游戏时间也有180小时了，是我入坑的第一台机体，陪伴了我一年终于有所回报了，人生第二个LNN还是有点小激动的，祝各位机师越来越发~', '九条爱丽丝', '2016-09-16 00:39 ', 'NMNB', '风神录'),
(6301718, '依旧是补档向（打不出新东西了），miss点：响子道中符，三道中，娘娘一非，通灵芳香，胎动，樱井寺，撞的都挺谐的。', '火罐发电机', '2016-09-16 14:14', 'NB', '神灵庙'),
(6319591, '风神录全机体nb达成！\n魔A机体超zz！\n下一个目标是nn！', '克劳恩啤酒', '2016-09-17 16:21', 'NB', '风神录'),
(6330321, '雾之湖畔的红魔馆所散发出的不详红雾，笼罩了整个幻想乡。同样居住在湖边废弃洋馆里的骚灵们，失去了往日的活力。“这样下去可不行，妹妹们会吃不消的。”这么想着，露娜萨找到了神社的巫女。“好麻烦啊，你要去就自己去吧。”巫女不耐烦地回答道。没有办法，为了妹妹们恢复往日的欢乐，露娜萨自己踏上了解决异变的道路。像她这样弱小的灵体，连一张拿得出手的符卡都没有。而有威力的符卡，通常都是和妹妹们三人一起释放的。', '零式嵐', '2016-09-18 13:44 ', 'NB', '红魔乡'),
(6336884, '龟速填坑', 'Yikos', '2016-09-18 23:39', 'NB', '风神录'),
(6349948, '某日，一个茄子厨忽悠了一帮人去打一种奇怪的neta\n然而只有一个傻子上钩了\n...\n没错，这个傻子就是我(捶地\n这个玩意，耗时不是很久，仗着熟练度打了两天不到10小时就填了\n路线也是临时定制的\n本来想字幕吐槽的，然而还是写了一些个人见解...\n如果真有人想学的话，建议对辉熟练度高点\n据说16a打这玩意好打，但是我不会用....\n惯例，如果电脑党发现视频屏幕不全有黑边，请开启全屏观看\nrep如果真有人要就留个言（估计没人）\n最后，打死函挂(', '残机消失之夜', '2016-09-20 11:31', 'NM', '辉针城'),
(6403126, '第二LNB，感谢蓝紫师傅的指导。坠机点：太多了自己看吧。全程瞎猴+谐比撞，能All真是奇迹。rep:http://pan.baidu.com/s/1i5FJTIX。封面id:57895853，别问我封面为什么用萌狼。', '纳兹燐', '2016-09-24 22:30', 'NB', '辉针城'),
(6412399, '本来想打nbnr的，结果二面撞了个结界。共计用时1h，只打了2把就发了（第一把疮墨染樱）。全程贼浪，有的地方扭的贼瞎，有的地方撞的贼傻。这个辣鸡红莲，明明说好的不会打妖的呢？1hLNB，人？两把就发，人？辣鸡红莲。', '紅蓮TsunDere', '2016-09-25 15:40', 'NB', '妖妖梦'),
(6421944, '人生第一NN（笑\n4月底～5月初，用时24h，龙珠x2，2Mx6，总的来说比膜C的NM要好一些，全程仅有1个糟点，道中的劣势没有想象的那么大。', '坑爹的事实', '2016-09-26 09:44', '低封NM', '风神录'),
(6444903, '......\n花了二十几个将近三十个小时\n视频里的收率不对，因为换了档，请勿参考\n“打NB不收终符和咸鱼有什么区别”\n被玉枝打脸后\n“讲道理除了红幻纯符哪个能打我脸”\n哪个都能(捂脸\n这次打的很谐，经历了七八次一面到四面疮痍，第一次进五\n发了\n啥也不说了........\n不过五面打的真的很谐，五面才是本体(\nPS:说好的星莲船呢，说好的神灵庙呢？怎么跑去打地灵殿了!(', '残机消失之夜', '2016-09-28 11:37', 'NB', '地灵殿'),
(6472011, '永夜抄lunatic难度50亿2机体目。\n发气来的如此突然，一不小心就顺便把NM50e的坑填上啦~\n又是半年啊，去年9月开打单妖梦的，大概红魔组也要等明年才能发啦www\n还是有不少失误的，所以55亿还是有希望的。\n感谢LMAX菊苣的指导，感谢莲子指导，感谢11区很多大触（尤其是王和绝两位）的指导。', 'mylove7210', '2016-09-30 19:21', 'NM', '永夜抄'),
(6491822, '风l初nb，1号凌晨打出来的，感觉我似乎都是深夜来的发气（\n坠机点：光学，3终符，4开，椛椛，210，五后半道中（这个撞的特呆B），天水，竟然还留了1残（\n封面p站：id=49032335', '清沙sk', '2016-10-02 00:23', 'NB', '风神录'),
(6519032, '音效太大就重新录了，新电脑到了发现开OBS和960也不会掉帧，于是鼓捣了半天。\n\n作为东方平衡把控最弱一作里的最失衡机体，\n这个机体大概能看成一个有控场能力的风魔B，不过相比下操作上会复杂一些。\n\n坑这种东西想起来了就打一把，说不定就发了呢', '姬川的翡翠', '2016-10-03 19:38', 'NMNB', '辉针城'),
(6588393, '麦有点渣，请见谅。开了9个月的坑终于填了，组内最晚红nb的菜鸡就是我，请尽情吐槽吧~', '九条華恋', '2016-10-07 21:08', 'NB', '红魔乡'),
(6590592, '没有幼女。。。', 'wasupandceacar', '2016-10-07 23:17', 'NB', '风神录'),
(6600997, '整个国庆都在糟风，一个国庆假期打出来3个9961。今天打算正式开始开荒殿LNB，抱着最后的希望打了打风，本来以为会理所当然的打出第4个9961，结果还是通了。这里要感谢一直在直播间奶我的几位挂长，没有你们的毒奶，我绝对不会有打第4个9961的想法（\nrep:http://pan.baidu.com/s/1i4AKDEX\n扯淡群：490839885', '纳兹燐', '2016-10-08 20:51', 'NB', '风神录'),
(6607004, '1.划了大半年水才把本命作通了，所以说风太难。\n2.2P是上次rep活动4面4000擦弹的任务，毕竟糟了8小时，就跟这次一起发出来留作纪念。\n3.没有特别瞎眼的地方，第一次NN6面。\n4.蜘蛛一非超难。', '蓝紫色的忧郁', '2016-10-09 11:09', 'NB', '地灵殿'),
(6607967, '可爱的妖精莉莉白', 'wasupandceacar', '2016-10-09 12:39', 'NB', '妖妖梦'),
(6638534, '第四LNB，耗时约6h。基本独立开荒，有少数地方请教了@妄想困 师傅，在此感谢。0残见勇仪，我当时的想法就是这tm也能通？结果四面...不剧透了，自己看吧。\n封面id:56945094\nrep:http://pan.baidu.com/s/1bp2zLKF\n扯淡群：490839885', '纳兹燐', '2016-10-11 21:21', 'NB', '地灵殿'),
(6712098, '機體靈夢B', 'DJRock', '2016-10-17 11:42', '低封NB', '红魔乡'),
(6720924, '东方星莲船Lunatic难度早苗B机体(蛙符)满残No Miss通关，时间：2016.10.14。\n初次尝试做了一下字幕，于是出现各种问题拖到现在。人生第二个LNM（亲民船超亲民.jpg），这次NM还是比较顺利的，只用了半个多月（不像某风神录（将近2个月）和某神灵庙（半年没出））。然后估计又要打EX划水了（或者连EX也打不了\nreplay： http://score.royalflare.net/th12/replay12/th12_ud11e4.rpy \n封面 id=1508165', 'Rainnye', '2016-10-18 00:03', 'NM', '星莲船'),
(6738990, '征得机师同意代投，瞎了我的狗眼的rep\n机师是我前辈，在我入东方坑之初第二个教我玩这游戏的人，同时又是学长，所以我一般这么称呼\n飞行时间长的机师，但是我记得这个坑他没开多久，看这rep感觉也像随手打的（\n全程打的瞎眼，撞的地方很谐，最后能顶住那么大的压力，不得不服（就差一碎片呢...\n5道中猫车那段失误较大，未能击破导致被大量增援淹没（\n6面在阿空简单的非符撞，理解不能（\n反正就是这样都通关了，糟点倒是没糟太多，只能跪着说声恭喜了\n你问我第一个教我玩的是谁？就是那个红Lnb的家伙（', 'Lollypop', '2016-10-19 17:06', 'NB', '地灵殿'),
(6786886, '自制 一个充满了神穿、欧气和结界开错时间的瞎眼rep，我自己都不知道怎么打出来的……大概是因为某人奶了一口？\n一样是XP，差劲的帧数、midi格式BGM以及……bandicam只让我一次录十分钟……于是能看出关卡间剪辑的痕迹，以后会重置的（大概吧）。\n什么，你问风神录NM是不是跳票了？不要问是不是我懒，问我的电脑乐不乐意不掉帧……\n字幕估计要到十几个小时后才会做完，我也感觉没什么好写的，毕竟这个rep没有太多参考价值……\n如果还有想补充的，请光顾一下评论区。', 'Oblivion117', '2016-10-23 00:41', 'NM', '妖妖梦'),
(6800244, '用了将近一个月终于把这破坑糟完了 作为一个诱导厨还是用直线机打过去了 不要问我为什么（死 录制的清晰度很渣 不过还好没有像上次那样没了一部分声音 打的很咸 请随意吐槽_(:зゝ∠)_ 封面id=9510077', '四季鮮花之主', '2016-10-23 20:34', 'NB', '风神录'),
(6801622, '1.没想到船的nb这么发，莲妈都没见过几次这次居然高残通了。。\n2.撞了好几个神奇的地方，也扭过了好几个神奇的地方\n3.终于没被小伞踢了，但还是糟在小伞\n4.感谢在直播间给我带来发气的西湖们(=・ω・=)', '蓝紫色的忧郁', '2016-10-23 21:56', 'NB', '星莲船'),
(6837080, '第一次NN4面，然而5、6面死于骚操作。', 'Yikos', '2016-10-26 21:17', 'NB', '风神录'),
(6876291, '自制，机师：STA\n\n于是这儿是搁置了很久的坑，今年的第三个LNB，选择了本命作永夜抄\n\n全程卖萌犯蠢撞注意（锤桌\n\n最后脸很好的NN了辉夜！今年的发气已用光系列。\n\nreplay : http://score.royalflare.net/th08/dlreplay.cgi?id=295c', '平坂景子', '2016-10-29 20:03', 'NB', '永夜抄'),
(6905493, '这里YuiDSK，祝贺自己成功升级为LN机师（亲民妖超亲民\n感谢同学帮忙录制的视频，有的地方还是有点掉帧\n攻略解说和难度评价都是自己写的，有遗漏错误之处欢迎指出w', 'TYSK秋', '2016-10-31 18:28', 'NB', '妖妖梦'),
(6926598, '滿殘滿B見兔子，然而並沒有什麼卵用。', 'DJRock', '2016-11-02 13:38', 'NB', '永夜抄'),
(6952372, '黑兔子萌萌的', 'wasupandceacar', '2016-11-04 14:21', 'NB', '永夜抄'),
(6967492, '东方地灵殿Lunatic难度No Bomb通关录像，机体：魔理沙B，残2.2，时间：2016/07/15\n东方退坑(？)纪念视频\n封面图pixiv ID=20140476', 'Shirob', '2016-11-05 13:59', 'NB', '地灵殿'),
(6974401, '感谢@蓝紫色的忧郁 师傅的指导。共12miss。miss点：伞妖 伞车 激光眼 四后半 虎一非 宝枪 虎二非 转转棒 净化 魔神 超人 飞钵。目前为止耗时最长的坑，约18h，其中16h练习，2h实战。收率有一部分是混关的时候保留下来的，仅供参考。\n终于没有再撞威光。\nrep:http://pan.baidu.com/s/1o80cLDo', '纳兹燐', '2016-11-05 21:12', 'NB', '星莲船'),
(7043522, '随手一打就发了，开始怀疑人生，已经面临退坑边缘，目标再填一个坑就正式退。在退坑之前好好娱乐一下吧233\n作品：东方永夜抄\n难度：Lunatic\n自机：结界组\n路线：6A\nneta：NO MISS\n机师：Yem樱吹雪', 'Yem樱吹雪', '2016-11-10 23:21', 'NM', '永夜抄'),
(7068079, '这是一个用发霉的键盘打出来的lnb，总计游戏时间；？？？', '隐蓝', '2016-11-12 18:36', 'NBNR', '妖妖梦'),
(7112960, 'miss点：魔理沙3非 魔炮 击月 五道中后半米弹狙 六道中永琳非 龙玉 佛石 玉枝（坑了许久的大坑 之前打出了6A线的nb8m 无奈控制不住罪恶的左手 丢了两个决死 导致最后结果是6m2b 又打了几次没打出来伤心就把这个破坑丢一边了 成功被船第三次劝退后又把这个sabi东西拿了起来 打了两个多礼拜经历了数个10m9961后终于坑出来了（撒花） 打的依旧很咸 比如撞了击月 击月 击月（怨念）欢迎随意吐槽_(:зゝ∠)_（（（封面id=52466937', '四季鮮花之主', '2016-11-15 20:05', 'NB', '永夜抄'),
(7129287, 'miss点：137 魔理沙2非 受兔懒符 永琳道中非 永琳一符 （这撞得什么玩意（摔））永的坑终于是填完了 nm太糟不打算打啦（懒癌*1）晚上回家睡了一觉起床一发打出来了 突然感觉我很强（sabi*1）打的依旧很咸 欢迎各位dalao随意吐槽_(:зゝ∠)_（哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈好开心好开心好开心（sabi*2））封面id=22409619', '四季鮮花之主', '2016-11-17 02:24', 'NB', '永夜抄'),
(7171651, '感谢沙包师傅帮忙录制的视频 36h的殿L初通+no bomb 尝试了一下初通带nb 没什么好介绍的 很欧就是了', '墨染丶Scarlet', '2016-11-20 00:16', 'NB', '地灵殿'),
(7172629, '辉夜PRPR\n没事水一水……', '幻想乡的天穹', '2016-11-20 01:36', 'NM', '永夜抄'),
(7199925, '前一天晚上浪太晚睡，一面开始恍惚，四面开始犯困，六面全程梦游…… BGM：https://share.weiyun.com/a2ba493f2540300006b76f99ed2625be', '七份睡觉圣代', '2016-11-21 21:16', 'NMNB', '永夜抄'),
(7239273, '无意间产物，通的猝不及防。4、5面各种梦游表现，在妖梦面前献丑了orz\n如果有兴趣的话大概会打个全角色NB之类的？\n感谢爱徒帮忙录制www', 'mylove7210', '2016-11-24 22:54', 'NB', '妖妖梦'),
(7281420, '自制 推把无数次，大小姐才允许我通过……录制时帧数有时候低得吓人。\n很多地方完全是脸过去的，大概字幕（会有这种东西吗）里会说吧？\n很多地方键盘抽风致死的，比如魔法阵，再比如魔法阵，再比如魔法阵……{{{(&gt;_&lt;)}}}\n风神录XP实在录不动，敬请原谅……', 'Oblivion117', '2016-11-27 18:19', 'NB', '红魔乡'),
(7305939, '普通的2MNBNT，之前也打过两个不过这把的参考价值高一些，NNN遥遥无期', '九条爱丽丝', '2016-11-29 14:57', 'NBNT', '神灵庙'),
(7311575, '历时24天达成的LNB，耗时约16h。共得到21个残机和一个碎片的溢出，miss点：团子影响力 月见酒*2 三前半激光阵 道中非 愁永远 二非 五后半白激光阵 太田飞行阵 道具雨 六流星雨 纯狐二非 三非 神灵界 四非 纯符*4，共计19miss，余2残。\nrep:http://pan.baidu.com/s/1pLexuYZ\n封面id:57078266', '纳兹燐', '2016-11-29 22:01', 'NB', '绀珠传'),
(7334677, '油管9D6fj5AUmnM 作者原简介（渣翻译）： 游戏很难但有20多残所以容错挺大，就算连撞几次关底结束还是能满残，大部分地方还是早苗比较好，然而迫于纯狐只好用灵梦。打灵梦NB推一面很烦人，不然火力不够2面得糟，但灵梦1面火力鸡且一符坑。2面对微移要求高因为灵梦得低封，得撑到章节结束前不被封。3面开始和早苗明显不同，123的非符下压药丸，梦我每次发弹站固定位置可以把反弹激光打成固定。4面比3简单，3面卜太崩容易打回满残，道中符没及时打掉阴阳玉糟了，非符比较固定。（字数限制，后半段在评论区2楼）', '秋名山猫车', '2016-12-01 18:00', 'NB', '绀珠传'),
(7355220, '2機體紺LNB殘8', 'DJRock', '2016-12-03 02:27', 'NB', '绀珠传'),
(7367870, '总时间300+  共9龙珠  不容易。。', '卖家具的家具屋', '2016-12-03 21:06', 'NMNB', '永夜抄'),
(7387853, 'www.youtube.com/channel/UCfMk9NuhdgCcLOOEwwB8wvw 这…是…人？\n\nP.S：视频原本的画质就这么糊', '秋名山猫车', '2016-12-04 22:47', '低封NB', '星莲船'),
(7402108, '一发实战打出来的，没什么好说。', '纳兹燐', '2016-12-05 22:47', 'NB', '永夜抄'),
(7430051, '历时约15h，第一lnb选择了这个最简单的开荒，底力太菜导致开全关还疮了3发，深夜在追忆师傅的一口奶之下直接发了，第一次前三NN，奥尔良还除了一个决死结界？？？然后进四就开始各种紧张sabi撞，全程谐比，四面花式谜，反魂蝶最后20s三残直接没有扭的欲望了，1000都没吃到撞出一个裸通，也算真正大坑的第一小步吧（说好的神隐呢）\n终于能上本命作这个一直舍不得用的封面了，待到灵梦睁眼时，大概是大坑填了的时候吧\n画师keta（这图这么有名就不用id了吧~）', '两仪式™', '2016-12-08 03:13', 'NB', '妖妖梦'),
(7459433, '完成时间2016.12.07，入坑一周年纪念，耗时约14h\n也算是最近打的最后一个坑了，在fgo活动之前打完\nrep：http://pan.baidu.com/s/1nvPjmzv\n封面ID找不到了\n感谢呆师傅的录制和压制', '猫耳蕾蒂', '2016-12-10 10:12', 'NB', '永夜抄'),
(7464464, '由于前天晚上直播被海叔等人奶糟（今天重打了一发，不是龙珠真是太好了！另外本菜鸡收可以教我打东方的师傅，有意者私信或Q759525435。会女装会卖萌不援交。', 'Yem樱吹雪', '2016-12-10 15:50', 'NBNT', '神灵庙'),
(7504676, '打得太脸，看了就懂，无法吐槽，根本没按规划走', '幽U子', '2016-12-13 00:37', 'NM', '永夜抄'),
(7507187, '瞎JB打，糟得一比', 'DJRock', '2016-12-13 10:56', '75FPSNB', '风神录'),
(7510855, '普通的2MNB，之前也打过一个不过这把的参考价值高一些，NN遥遥无期（复制粘贴大法好', '死灵の夜樱', '2016-12-13 16:23', 'NB', '地灵殿'),
(7646489, '2015/7/25\n东方妖妖梦LNNN\n\n弹幕难度：毒\nNN难度：中\n\n咕咕咕~咕咕咕~咕咕咕~咕咕咕~\n啊，啥时候能更完这破玩意儿？\n鬼知道\n不如听歌\nhttps://www.youtube.com/watch?v=92xEtE8Kivs', '砂砾籽', '2016-12-22 20:39', 'NMNBNR', '妖妖梦'),
(7649635, '惯例，有黑边开全屏\n收率什么的都是开无敌打的\n一晚上开了两把\n第一把四面崩\n第二把....\n这游戏真难\n不对，是我太菜了', '残机消失之夜', '2016-12-23 00:05', 'NB', '永夜抄'),
(7673729, '其实打这机体的初衷真的是看rf上没这机体的3N有点太可惜了，借此机会多钓一些早苗厨来打这个机体，应该是世界第一个苗机NNN的记录？（苗机厨都哪去了），如果有需要相关的解说的玩家可以提醒我一下，我会准备一下的，以上', '九条華恋', '2016-12-24 16:34', 'NMNBNT', '神灵庙'),
(7692864, '各种忘板咸鱼瞎扭打出来的神灵庙NB', '隐蓝', '2016-12-25 16:04', 'NBNT', '神灵庙'),
(7709142, '自制，第一次发视频的说。。。\n这次给大家带来的是风神录梦B的lunatic no miss，共计应该有20个小时左右？', '哼歌必灭之理', '2016-12-26 17:56', 'NM', '风神录'),
(7740921, '自制。9月28号打出来的人生第一个LN系列，距离今天正好3个月。\n妖这个游戏有毒的，现在打nb直接疮3面（\n录制的时候好像微信声音录进去了。。。', '哼歌必灭之理', '2016-12-28 22:09', 'NB', '妖妖梦'),
(7791256, '新年快乐，茄子生日快乐。\nrep完成于2016年11月28日，解说完成于12月31日（S比：咕咕咕）。\n一直没想过自己会打nb，在被庙打得弃坑后觉得还是风好玩，回来瞎打着玩，突发奇想研究了一下miss叠子机，挺有意思，就开了坑，也是让我从半个风厨彻底变成了魔c脑残粉。\n以后会专门做个全方位解析（咕咕咕）。\n明天1月2号，也是我风L初通一周年的日子，对于陪伴了我半个肥鸡生涯的魔c，接下来的一年也是，请多多关照。\nrep：http://pan.baidu.com/s/1mibh3BU\nS比萌音好棒（', '鹰富士茄子', '2017-01-01 00:00', 'NB', '风神录'),
(7791360, '新年快乐~~！！ \nNN什么的果然还是18年吧！', '塑料式胖次', '2017-01-01 00:04', 'NB', '地灵殿'),
(7803028, '人生第一Lneta，特此纪念。完成时间2016年5月22日。此前完成了6个lunatic的混关。因为庙的熟练度比较高，所以考虑打规划性较强的nm，用时大概有10h左右吧。\nrep：https://pan.baidu.com/s/1eRTGlMi', 'No丶Goodbye', '2017-01-01 17:18', 'NM', '神灵庙'),
(7843720, 'rep来自rf，http://replay.royalflare.net/replay2/th15_ud2032.rpy\n机师AMN 吃了几颗纯符的龙珠后的世界第三个绀LNN，整体打法和最初gobou、砂的打法相差不是特别多，然而AMN遭遇了哆唻咪的二三非下压，五道中三吴克生成不好，小妖精的一二非下压，百合神灵界随机弹的生成形状都比较糟，脸气极度惊险的形状在灵梦的判定优势下救了回来，有惊无险的NN，期待天朝的第二个绀LNN，妹挂加油！！！！！', '两仪式™', '2017-01-04 04:38', 'NMNB', '绀珠传'),
(7850007, '东方风神录L难度No Bomb，1月3日在B站直播间完成。\n满满的残机，说没就没了，这样的游戏太不友好了。', '失忆的稻草', '2017-01-04 17:01', 'NB', '风神录'),
(7899110, '机体：博丽灵梦，感觉没什么特别糟的地方，神子战日常脸黑，17条快全避了都撞，还好续了一命。希望近期能把妖的低封也坑出来，感觉比庙这个难百倍。', '九条華恋', '2017-01-07 21:42', '低封NBNT', '神灵庙'),
(7902967, '糟了大半年了，9961最多的一作，前一天才出一个9961）', '蓝紫色的忧郁', '2017-01-08 02:19', 'NB', '风神录'),
(7913556, '2015/5/23\n东方辉针城LNN\n\n弹幕难度：高\nNN难度（炮机）：低\nNN难度（非炮机）：高\n\n好像快填完了 还有5个\n咕咕咕', '砂砾籽', '2017-01-08 18:47', 'NMNB', '辉针城'),
(7919340, '通关NOMISS向通关练习，大致对风神录有了相对全面的了解\n混关策略 \n1面道中符炸 1BOSS1符炸，终符炸\n2面道中可炸的很多，中BOSS前一雷，中BOSS一雷，转转符卡全炸\n3面道中符炸，之后的大蝴蝶没走好炸，BOSS前大蝴蝶，四个出齐一起炸，3BOSS炸2符和终符\n4面第一段瀑布没走好就炸了，然后道中BOSS2雷13秒后击破。最后三连大蝴蝶看情况炸2雷。文文炸1符2符3非时符终符。\n5面中BOSS前一雷，道中符1雷，后半道中一雷，早喵符卡全炸\n6神妈炸1非2符3符4符终符', '小鸡法师', '2017-01-09 01:00', 'NM', '风神录'),
(7930009, '糟了几天在半夜出了，打的可能比较谜，比较随性。建议想学习neta的看看其他师傅的视频qwq\n第三作LNB，以后再试试NBNT吧。', '无耳桑', '2017-01-09 20:17', 'NB', '神灵庙'),
(7932882, '下了个神德练习器打了几发，结果就发了。神妈战NN，基本上是我打的最满意的一次，不过5面其实打的不是很熟呢', '无耳桑', '2017-01-09 23:19', 'NB', '风神录'),
(7934470, '好像比预期出的快，感觉这3个魔机还是挺需要技巧的，有兴趣的机师可以研究研究\n魔机打完以后就是风神录全机体也出了，附一下往期的梦机nb\n梦a：av5720784\n梦b（初nb）：av3311735\n梦c：av6245875\n宣传下梦bnn吧233：av6295779', '九条華恋', '2017-01-10 02:36', 'NB', '风神录'),
(7949623, '我为什么撞了这里，我为什么这么菜，我为什么这么智障，我还有救么\n我要糟，我要疮，我要猝死的\n这游戏我能糟一年', '两仪式™', '2017-01-11 03:50', 'NB', '妖妖梦'),
(7962198, '运气来了，坑说填坑，0残收风神，茅环，天龙，神德真是刺激的不行！', '小鸡法师', '2017-01-11 22:43', 'NB', '风神录'),
(7975458, '感谢函数西湖的发气 函数西湖棒棒的！', '射命丸silva', '2017-01-12 20:25', 'NM', '风神录'),
(7990193, '东方地灵殿L难度No Bomb\n一直想试试看不扔雷通关一次地灵殿，这次算是满足心愿啦。\n地灵殿的弹幕真是密啊，打下来感觉键盘君快被我敲坏了。\n更新P2：恋恋NMNB\n时隔一年半，算是完成了当初的目标，作为恋厨心愿已了。\n同是针机，放一起当个纪念吧。', '失忆的稻草', '2017-01-13 18:34', 'NB', '地灵殿'),
(7993507, '普通的殿L梦BNB', '死灵の夜樱', '2017-01-13 21:33', 'NB', '地灵殿'),
(8015500, '通的真是莫名其妙，看前两面就知道在瞎打，然而就是这瞎打发了。\n     这次星降生成真是糟，而且打的也乱了，以前看mmw的nm时听他说没b没c时龙珠星降时没太多感慨，听追比说他三颗星降的龙珠时也没太大波动，以前听到别人nnn到星降龙珠也只是笑笑，直到遇到自己被逼到底线时才感受到那种无奈，还好有个c。\n     看了下次数，1.1w+，想想大半都re在前两面了，这游戏真糟\n     庙是唯一陪我n至L的正作，200+h的时间都糟在这，也是我第一个想打neta的正作，nm了真是心情激荡。', '冰冻小伞', '2017-01-15 02:46', 'NM', '神灵庙'),
(8027535, '机师是鵺。主页：http://space.bilibili.com/4843535/#!/index\n开荒时间为16年12月20日至17年1月15日，飞行时间在60-70小时\n从总体来看我感觉还是算比较非的（和我那个完全不同），然而机师充分地发挥了避弹，说实话这个NB的避弹给我的感觉就是惊险而漂亮，6M通关也是理所当然的事，要不是最后时刻出现了一些失误，甚至可以获得更加惊艳的结果\n以下是机师原话（不代表我的观点）：\n感谢WASUP师傅让我想打红和对我的指导，感谢紫紫给的练习器（糟米超糟', 'wasupandceacar', '2017-01-15 20:22', 'NB', '红魔乡'),
(8048727, '2017年第一坑圆满填上了。总计游戏时间94小时，基本没开全关，一直在打无欠和纯符。然后今天我和二姨同时就发了233.总之纪念一下。也希望别的师傅们早日填坑，早日NN。另外欢迎加入东方stg群：115957138。', 'Yem樱吹雪', '2017-01-16 23:03', 'NB', '绀珠传'),
(8057985, '嗯，本菜鸡的第一个真正的lunatic no bomb，绀无欠是人生第一个L，然而不知道打了多久才脸通了这个nb，我果然没有打stg的天赋啊\n想想去年六月提醒我风萌AB傻傻分不清，殿魔A不知道贴脸雷，胶师傅来亲切指导，时隔半年多，从萌新变成不那么萌的萌新，然后能请到胶师傅来解说这个rep简直灰常极其无比的荣幸，感谢胶师傅以及各位师傅们的指导\n至于rep，全程谐，三面练了那么久还是被七杀，纯狐强势放水，全程靠脸，嗯，大概是这个样子\n最后  wa挂挂   wa挂挂挂挂\n封面id60685283', '两仪式™', '2017-01-17 16:02', 'NB', '绀珠传'),
(8087071, '考砸后打了一发庙的产物。意外的nb了，虽然也不能说意外，只是惊讶这么快，本来以为还要糟个几天。\n    miss点：2后半增援，道胎动，神子四非开幕，17条，星降狂暴开幕。\n    我竟然收了天舟？这把还是很给脸的啊\n    下一个坑未定，可能是满资源，可能是nbnt，可能是nmnb，目前倾向满自缢', '冰冻小伞', '2017-01-19 00:40', 'NB', '神灵庙'),
(8106636, '太发了 太发了 太发了！瞎J8猴猴出个NB！', '塑料式胖次', '2017-01-20 01:19', 'NB', '风神录'),
(8145664, '算不上致敬的致敬\n致敬的那一天怕是几年后了(\n东方永夜抄Lunatic 6B NMNB 咏唱组\n完成于2017.1.21晚\n吃了7颗龙珠\n这次的收率可以参考 没有开无敌打\n算是打响了新年第一炮?(\n片头只是截了几个比较惨的,被搞死还有很多次(\n祝大家新年快乐', '残机消失之夜', '2017-01-22 02:14', 'NMNB', '永夜抄'),
(8146959, 'MISS点：夜雀2非、4面前半道中、魔理沙道中2非、魔理沙终符、铃仙3符、舍利子、辉夜3非、生命泉', '無敵戰鬥者', '2017-01-22 08:13', 'NB', '永夜抄'),
(8174892, 'nn过程中的产物，极糟的一局，麻将山打节奏太high\nmiss点：无双风神，六面道中，麻将山', '克劳恩啤酒', '2017-01-23 17:27', 'NB', '风神录'),
(8208935, '东方神灵庙一命(NM)满残(FL)通关，机体：魂魄妖梦；分数：14亿；时间：2016-12-18（别问我为什么拖了这么长时间）。至此2016年个人STG全部目标完成，以后一段时间可能不会打STG了（再次陷入毫无目标的咸鱼状态 \nReplay：http://score.royalflare.net/th13/replay13/th13_ud0ad4.rpy\n封面 id=1006311', 'Rainnye', '2017-01-25 12:47', 'NM', '神灵庙'),
(8243994, '贺岁作品，刚打完红魔乡就顺势来用用红魔组，双线6面基本没练所以糟的很，轻喷。\np.s.咲夜判定在屁股上真的被坑到了（', '九条華恋', '2017-01-27 03:06', 'NB', '永夜抄'),
(8266931, '2015/5/17\n东方地灵殿LNN\n弹幕难度：中\nNN难度 ：中\n不知道会不会渣画质 然后\n新年好呀新年好呀新年好 钟繇的话说三遍\n然而日本并没有什么年味，我还是上完班才发的视频\n终于下期要出船了 我好兴♂奋呀', '砂砾籽', '2017-01-28 15:15', 'NMNB', '地灵殿'),
(8277671, '东方风神录L难度No Bomb All 2017-1-28\nmiss点：河童大瀑布 椛椛 乌鸦阵 二百十日 六面关底大蝴蝶 天水\nrep下载：http://pan.baidu.com/s/1gfHW76b\n音画不佳，感谢视听！', '神戸綾', '2017-01-29 05:09', 'NB', '风神录');
INSERT INTO `lneta_info` (`av`, `comment`, `name`, `time`, `type`, `work`) VALUES
(8288821, '怎么说呢......从15年8月打出第一个NBNT，到如今NNNFS，期间2miss五个，龙珠一枚（贪分），3miss不计其数，感慨挺深的。这个3N本来是16年寒假的坑，去年这个寒假也是士气最旺的一段时间，然而到最后也没碰到龙珠，开学后便不再打了。去年暑假打完L35亿后顿时感觉没了打飞机的动力，一直处于半弃坑的状态。也是没想到在一年后的寒假，能达成这个成就......很开心\nrep：http://score.royalflare.net/th13/replay13/th13_ud0aec.rpy', '幽谷啊哈', '2017-01-29 22:10', 'NMNBNT', '神灵庙'),
(8299096, '准备打全组机体B线nb，不过也就剩下一个绿魔了（\nNNtnl，残玩游0玩游打不了\n今天这个魔理沙简直不能再搞事情\n行星遍地游，黑洞带我走。魔炮一堵墙，击月脸上蛤？\n封面并找不到了', '猫耳蕾蒂', '2017-01-30 16:34', 'NB', '永夜抄'),
(8370877, '猴子型机体，不需要太多练习。\nrep:http://pan.baidu.com/s/1kUZjp3L', '纳兹燐', '2017-02-03 14:08', 'NB', '风神录'),
(8371248, '炮机，难点miss后控一下p，其他正常打。\nrep:http://pan.baidu.com/s/1c2cf0R2', '纳兹燐', '2017-02-03 14:27', 'NB', '风神录'),
(8372136, '这机体真难，不是很懂函比。\nrep:http://pan.baidu.com/s/1bE2WiU', '纳兹燐', '2017-02-03 15:12', 'NB', '风神录'),
(8372711, '火力劣势比较明显的机体，不过手感不错，比魔A好多了（\nrep:http://pan.baidu.com/s/1sl73azV', '纳兹燐', '2017-02-03 15:39', 'NB', '风神录'),
(8373091, '第一次打出龙珠，比较激动，虽然之前有一次更可惜，nn撞雨之源泉后崩盘，但还是这一发打的比较好\n打什么风神录nn，不如玩iwanna(╯°口°)╯(┴—┴', '克劳恩啤酒', '2017-02-03 15:57', 'NB', '风神录'),
(8380442, '感谢樱吹雪师傅的解说吐槽，初通的rep炸了（谁和说我红的rep不会炸的(），就又打了一个作纪念，尽显欧洲人本色。(', 'Scarlet墨染樱', '2017-02-03 21:30', 'NB', '红魔乡'),
(8383385, '机师是鵺。主页：http://space.bilibili.com/4843535/#!/index\n机师本来是想打NBNR来着，结果二面道中不慎爆了结界，最后反魂蝶也爆了一个。但由于残机都撞光了，伪NBNR都算不上啦\n前五面打得非常稳，虽然难的几个地方都撞了，但是没有在简单的地方掉链子，同样也是能够高残进六。\nUUZ战仗着残机多就怼过去了。UUZ三非究极究极究极究极究极究极究极究极究极究极究极究极究极究极究极究极究极究极究极究极究极究极究极究极究极究极究极究极究极究极究极难\nNBNR不远了', 'wasupandceacar', '2017-02-03 23:38', 'NB', '妖妖梦'),
(8434898, '这个玩意打了也这么久了，没打出来终归还是自己毅力不够，在吃了几个龙珠后几个月可能也就打了10把吧，想了想年都快过完了，就先拿这个凑个数吧，还有貌似压渣了，嘛，也懒得再录了，就这样吧。', '西行寺幽幽子_', '2017-02-06 13:56', 'NM', '妖妖梦'),
(8465152, '辣鸡梦a毁我青春 函数大法好！', '射命丸silva', '2017-02-07 20:24', 'NM', '风神录'),
(8472578, '本来想找解说的，结果全都咕咕咕然后搞得我也忘了传一份上来。应该不是特别难打，机体都算是比较均衡，感觉每个机体都挺好玩的。梦b先前传过我就不放到这里了，av6588393。', '九条華恋', '2017-02-08 03:25', 'NB', '红魔乡'),
(8487048, '2015/3/17\n东方星莲船LNNN\n\n弹幕难度：高\nNNN难度：高\n\n麦有些吵。见谅见谅\n如有需要以后可以出个开碟展示\n最后\n白蓮さん今日も美しいですね\nprprprprprppr', '砂砾籽', '2017-02-08 19:58', 'NMNBNV', '星莲船'),
(8489536, '菜比最近打得最好的一把NB（', '星条旗的小丑', '2017-02-08 21:40', 'NB', '星莲船'),
(8512840, '本来稳稳NBNR的局，墨染樱前想着“反正开幕简单”然后扣脚没暂停导致撞了墨染樱开幕大玉= =为什么会这样呢？\n总结：三面打得一团糟，五面NNN妖梦后看到了些许NBNR的希望。\n春之京>奥尔良（确信）\n埋骨于弘川>叶风神闪斩（确信）\n\n不出意外的话，下一次上传视频应该就是妖妖梦NNN了；如果没上传，那大抵是我猝死了= =\n\nreplay下载地址：http://pan.baidu.com/s/1kUVfXkV', '暗黑俯冲轰炸机', '2017-02-09 22:32', 'NB', '妖妖梦'),
(8541514, '东方妖妖梦Lunatic No Bomb All 2017-2-9\nmiss点：小爱一符 小爱三非 四面前半毛玉 四面后半妖精 现世执妄 六开幕 生者必灭×2 反魂蝶×2\nrep下载：http://pan.baidu.com/s/1mh6H0qW\n音画依旧不佳，依旧感谢视听！', '神戸綾', '2017-02-11 09:01', 'NB', '妖妖梦'),
(8599613, '东方妖妖梦lunatic nbnr  （不用看了除了骚灵二非都是呆逼撞）6面nnn\n之前专心被妖nn*，然后被*哭，朝圣之后圣师傅说nbnr比nn难，于是心如死灰的我第一次开了一把nbnr，然后就给了我一个这样的三七，这样的六开，为什么我nn见三七，nn见六开时总会喂我一口翔，喷血。。\n我要糟的，我发不了，我还要猝死的.jpg', '两仪式™', '2017-02-13 23:32', 'NBNR', '妖妖梦'),
(8650672, '封面ID=34658534，侵删，感谢！\n机师：青鼠\n总耗时：约75h（包括L混关开荒）\n本人的第一个L难度neta，尽管属于比较简单的neta但还是很开心，附上解说，不吝赐教~\n感谢jumbo师傅和泡泡师傅的规划及路线！\n感谢小伙伴们长久以来的陪伴和支持！\n新年的第一个投稿，首先祝大家鸡年大吉 吧（滑稽），一起发发发吧~~', '米加小青鼠', '2017-02-16 21:24', 'NB', '妖妖梦'),
(8657596, 'REP完成于去年7.5，前不久也是刚混完全作NB，近期就陆陆续续地把这些rep都录下来投稿了吧\n新人初投稿，折腾了好久(╯‵□′)╯︵┻━┻蠢死我了\n(～￣▽￣)～也不指望能有多少点击率啦只是投一个作为纪念嘛', '假装看风景的矮穷挫', '2017-02-16 23:42', 'NB', '风神录'),
(8664983, 'REP完成于16.7.27，机体针\n新人投稿第二弹(～￣▽￣)～话说这游戏我吃过8个9961呢（怨念\n录的时候出了点问题，一开始有点卡，六面还有弹窗卡了几秒……一想反正没人看就懒得重新录了orz', '假装看风景的矮穷挫', '2017-02-17 14:45', 'NB', '红魔乡'),
(8675565, '自制\n东方永夜抄Lunatic No Miss No Bomb All.\n完成时间为2017.02.12晚\n开荒时间约400H 共计2龙珠\n打的很菜，看看就好。\n\n辉夜最棒了！！！！！\n辉夜最棒了！！！！！\n辉夜最棒了！！！！！\n\nかぐや姫が一番好きだった！', '反恐突击特战队员', '2017-02-18 00:01', 'NMNB', '永夜抄'),
(8690941, '感谢jumbo师傅帮忙录制的视频\n3道中非第一次见老师往右走就慌了，金字塔没满P也不太会打\n4前半有个走位失误，还好问题不大\n嘛，总有种是在为自己菜而找借口的感觉。', 'Scarlet墨染樱', '2017-02-18 21:46', 'NB', '永夜抄'),
(8713802, '5小时打出来的垃圾，不建议作参考（', '纳兹燐', '2017-02-19 20:16', 'NB', '妖妖梦'),
(8771497, '在辉针城l初通三周年的前一天打出了lnb，感觉挺有缘分的。作为第一作混通的ex和l，个人对辉针城这一作有莫名的感情。本来打算和初通rep一起发的，可惜找了很久都没有找到。\n历时4小时，基本都在练单卡。由于常年咸鱼混关，导致道中基本没练过就发了。boss战还是半桶水 该撞的都撞了。全程撞成sb都能通，果然亲民城超亲民。\n道中运气好执行得挺不错的，想打的可以稍微参考一下。\n封面pid:37975477（+1s', '恋日天', '2017-02-22 21:34', 'NB', '辉针城'),
(8773610, '自制  普通的星莲船l全机nb合集，苗b见av3249038就不放上来了\n全机总共断断续续打了一年多，机体难度的话大致就是通关顺序，视频对想学红碟路线的有一定参考价值，至于boss战……反正什么都撞过（\n这个成绩也算是我个人在避弹向neta上唯一还算拿得出手的吧，至于nbnv什么的，已经无所谓了（', 'mengo', '2017-02-22 23:12', 'NB', '星莲船'),
(8817303, '自制，纪念本人第一个Lneta，也是肝了挺久吧（封面就是up现在的状态）。\n感谢两仪式和鼠宙一提供的指导，以及其他小伙伴的支持，感谢各位的观看。\nrep：http://pan.baidu.com/s/1dFiQpPJ', '1839059', '2017-02-25 10:50', 'NB', '妖妖梦'),
(8824499, 'REP完成于16.11.14，辉针城家里电脑录的时候会掉帧，全程56帧遭不住啊就先投庙的吧\n庙应该是我现在打的最熟练的一作了，回过头来看看这初NBNT感觉很多打法都不成熟，而且撞的都什么玩意儿，该撞的都没撞，明明是把nnn的局……（\n辣鸡庙蒸辣鸡', '假装看风景的矮穷挫', '2017-02-25 17:31', 'NBNT', '神灵庙'),
(8839995, '封面http://bcy.net/illust/detail/20386/970126\n\n为什么会这样呢，说好撞反魂蝶9961的，结果反魂蝶没死，9961都算不上。。。咳咳。。。\n妖LNBNR的失败典范，三七撞了一个结界，最后0残出6面，否则就能达成NBNR的说，然而现在只能算个LNB。\n\n整体打得也是挺谐的，比如3面撞固定弹，4面选错人，6面2符3非连撞，最后还撞墨染樱。\n这游戏还是太难了233', '哼歌必灭之理', '2017-02-26 14:00', 'NB', '妖妖梦'),
(8852147, '东方妖妖梦L难度低封通关，机体梦b\n所以说没事干不要以为资源多就可以浪，稳稳打好，像我这最后抱了进十个b差点浪输\n封面p站id=49189530', '八雲的妖怪闲者', '2017-02-26 20:05', '低封', '妖妖梦'),
(8862096, '我敢说这是全B站撞得最谐，过的最惊险的NBNR（\n\n关于标题，事情是这样的，在我上传上一个NBNR失败的视频的时候，又开了一把妖妖梦，谁知道就NBNR了（\n这游戏还是太难了，我还是打不出9961\n\n妖妖梦lunatic NBNR达成，距离LNB差了正好5个月，去年7月梦B的混关到9月打出LNB总共27小时，到今年2月总共加起来也就50小时，5个月只打了23小时，果然是学艹太忙了么。。。', '哼歌必灭之理', '2017-02-27 07:13', 'NBNR', '妖妖梦'),
(8871761, '咕咕咕！', '西行寺幽幽子_', '2017-02-27 19:06', 'NM', '风神录'),
(8897793, '初通的rep在电脑重装后丢失了于是打了第二发。\n前三NN，结果4面1残出xxxx，最后裸通。\n虽然糟挺久，不过应该算是比较简单的NB吧（？）', '无耳桑', '2017-03-01 03:00', 'NB', '辉针城'),
(8946111, '可爱的金发妖精怎能不全避', 'wasupandceacar', '2017-03-03 23:04', 'NBNR', '妖妖梦'),
(8961895, 'REP完成于2016.12.21，机体咏唱，咏唱大法好！（\n由于咏唱打炮伤害太高，少扭了很多东西，实际上这个NB还是非常水的……\n用其他机体打或许会难很多把', '假装看风景的矮穷挫', '2017-03-04 17:36', 'NB', '永夜抄'),
(9020072, '自己的第一个L neta，大概是最简单的L neta。我这种沙包也只能打打这样对底力要求不高的neta，很多地方都是用魔B的高火力bug速破的，执行到位就没问题，大部分难点都在4面。虽然如此，我还是经历了2个龙珠和不知道多少个2Miss。唉，别说了就是菜.jpg\nPS.已经打出了两颗龙珠的时候，我继续打却发现一直是2Miss，而且四面的大蝴蝶一言不合就要封我位。后来我发现少佐竟然和我在同一个群。于是我打风之前先禁(xian)言(ji)他半小时。结果今天没献祭就发了，所以说，我们还是要相信科学啊！', '青山散人', '2017-03-07 14:50', 'NM', '风神录'),
(9026794, '自制 最高难度NoMiss通关达成，难点在从4P见黑死蝶开始到2P见恶灵复活结束，4面Boss之前可以随便打，只要2.75P以上见Boss都没问题，但在此之后直到地底太阳（不包括地底太阳）每一个雷都是规划雷了，具体来讲很复杂，我以后有时间就在贴吧发个帖专门解释放雷的问题吧。\nPS：6面前半道中打得非常缩，跟平时完全不是一个风格……主要是因为第一次NM进6面，紧张得要死……\nreplay下载：http://pan.baidu.com/s/1i4LIfuX', '紫外信号', '2017-03-07 21:20', 'NM', '地灵殿'),
(9027717, '去年七月份开的坑，是最早开坑的LNB，也是最晚打出的LNB。还是感谢wasup师傅，鼓励我从咸鱼混关走进了LNB。\nrep:http://pan.baidu.com/s/1jIJUwxo', '纳兹燐', '2017-03-07 22:37', 'NB', '红魔乡'),
(9029465, '响子yahoo', 'wasupandceacar', '2017-03-08 01:12', 'NBNT', '神灵庙'),
(9030676, '最近没有成果实在很闷，本来计划魔anb初通，终于把持不住了，乘此机会多熟悉熟悉城吧。\np.s.miss数很多很咸轻喷\n封面id=55451359', '九条華恋', '2017-03-08 02:49', 'NB', '辉针城'),
(9047447, '1.路线以安全、固定。简单为优先，因此全程有大量全避和咸鱼走位和规划\n2.视频中的难度评价为不带灵界的个人主观评价，仅供参考（\n3.部分路线参考了伞师傅@冰冻小伞，条姐姐@九条华恋，胶妹妹@妄想困，感谢dalao们指导\n4.辣鸡六残低P崩盘游戏神灵庙', 'TYSK秋', '2017-03-09 01:37', 'NB', '神灵庙'),
(9064141, 'replay:http://score.royalflare.net/th14/replay14/th14_ud0763.rpy\n封面pixiv id：50216590\n2面录像出错，所以从3面开始只录了后4面', 'apple丶Y', '2017-03-10 00:57', 'NMNB', '辉针城'),
(9092706, '（', 'kindx', '2017-03-11 14:02', 'NB', '绀珠传'),
(9095122, '完成于16.12.28，机体自然是梦A了\n这一作感觉难度很高，虽然有10个左右的残机但是总觉得不够用（\n一面究极难，推把要推疯了orz其实还是太菜，打的时候心态有点浮躁，不过这把第一次进6就发了，多亏了前四面打的比较好……（五面5miss遭不住）\n总体还是训练价值挺高的', '假装看风景的矮穷挫', '2017-03-11 16:06', 'NB', '地灵殿'),
(9110330, '东方永夜抄Lunatic A路线No Bomb All 2017-3-10\nmiss点：到处都是\nrep下载：pan.baidu.com/s/1hrPOg8s\n实在是没有用心准备。。如果这样也能得到您的欣赏真的万分感激！', '神戸綾', '2017-03-12 06:37', 'NB', '永夜抄'),
(9119628, '这个rep上个月就打出来了，但是没录\n感谢呆师傅的录制，这也是最后一次帮我录了\n本来是想试着打10机B线nb，打完全组之后又打了单紫和单蕾米\n剩下三个还是有点难度所以鸽了\n咏唱太简单了我就不发了\n封面id找不到了', '猫耳蕾蒂', '2017-03-12 14:44', 'NB', '永夜抄'),
(9130553, 'http://score.royalflare.net/th10 Yuki说她打出sspnn我就女装，我说会不会有一种钦点的意思啊，不能你说女装就女装，女装也是要按照基本法的啊，你们啊， 还需要学习一个\np1机师：れいか，p2机师：dxk', '小大圣', '2017-03-12 22:11', 'NMNB', '风神录'),
(9136119, '没事瞎打的，看看就好', '水之早苗', '2017-03-13 07:41', 'NB', '永夜抄'),
(9184600, '残神收我为徒！', '纳兹燐', '2017-03-15 21:04', 'NB', '辉针城'),
(9187248, '使用机体魔A，NB兼初通。感谢各位师傅。', '妄想困', '2017-03-16 00:36', 'NB', '地灵殿'),
(9187248, '使用机体魔A，NB兼初通。感谢各位师傅。', '妄想困', '2017-03-16 00:36', 'NB', '妖妖梦'),
(9222908, '这应该是我打出来的第一个没蹭破结界的NBNR，梦A大法好\n来阐述一下梦A优于梦B的地方（：\n1、梦B控樱性能过高，容易出结界，一出结界就满脑子低封擦弹骚操作于是蹭破了（\n2、梦A道中轻松\n3、梦A火力比较弱，可以充分感受yym弹幕的魅力（？\n以上统统划掉（\n以后还是会以玩梦B为主，这个视频基本是演示一下梦A道中的压制方法吧，还是需要很多姿势的\n由于渣机原因，录的时候部分地方掉帧，不过总体应该不影响观看，真是抱歉啦', '假装看风景的矮穷挫', '2017-03-17 21:35', 'NBNR', '妖妖梦'),
(9254968, '机师是鵺.\n总体打的蛮好的，就是6面脸不好...\n道中打法很标准，有意开荒NB的同学可作适当的参考。\nP1为无解说版，P2为胖次解说...\n啊第一次解说0 0..好紧张啊233333。录了3次才算满意些...\n鵺爷爷，快点出个风Lnn吧！', '塑料式胖次', '2017-03-19 10:18', 'NB', '风神录'),
(9314739, '第一个L NETA，即使是混关亲民的永，NB依然很难，和混关完全是2种游戏\nmiss点 \n（1）4开 \n（2）4道中2非 \n（3）双重火花\n（4）白兔1非\n（5）6面道中非\n（6）6面1非\n（7）天人的系谱\n（8）阿波罗13\n除了miss点2和8意料之中，其他都是意外地糟糟糟，4残进6确实很紧张，天文密葬法差点撞，各种穿\n再吐槽一下蓝点没吃到1100奖残，所以只有8残，主要是漏了3后半开，5后半，6面的一波', 'jokerlixin', '2017-03-22 04:33', 'NB', '永夜抄'),
(9332971, '2014/3/18\n东方风神录LNN\n弹幕难度：低\nNN难度:低\n\n更新更新 \n第一次自己做视频（\n如果有啥问题可能会撤回重做', '砂砾籽', '2017-03-23 06:43', 'NMNB', '风神录'),
(9347392, '挂机升级什么的', 'Tabula', '2017-03-23 23:58', 'NM', '风神录'),
(9358148, '完成时间：2015.5.17\n前年打出的录像，因为当时不会录视频，没有在B站投稿，不过在我个人的STG经历上还是比较重要的一个成果吧，而且作为本命作，这里重新补上。', '星尘☆狂欢', '2017-03-24 15:41', 'NMNB', '辉针城'),
(9362412, '5miss\n骗硬币计划第一弹，无误\n阿姨神勇无敌！', '死灵の夜樱', '2017-03-24 19:10', 'NB', '风神录'),
(9364265, '封面ID=61406639\n转转好可爱！\n河童好可爱！\n早苗好可爱好可爱好可爱！！！！\n能通全是运气好。', '西行寺丶瓶', '2017-03-24 20:22', 'NB', '风神录'),
(9365372, '亲民船超亲民！\n开碟路线基本自己研究，把路线改到了自己能执行出来的程度，很多可以开的碟都缩了，求稳（例如四后半）\n不过尽管如此还是有这么多残机……完美路线应该能吃到14甚至15残？\n这把有些地方执行崩了，太菜了\n满残见莲妈，产生了一种我能满残NB的错觉……被教育了（飞钵这种卡基本不可能撞的.jpg\n不过还是要说  qmccqm！', '假装看风景的矮穷挫', '2017-03-24 21:12', 'NB', '星莲船'),
(9394243, '开坑前的试水  \n随时可能弃( 弃坑狂人IAH\n6A好难啊6A好难啊  0神教我打6A！', 'WAG老师的粉丝', '2017-03-26 02:08', 'NB', '永夜抄'),
(9408922, '符卡收取25/26 尽管很多sabi撞但依旧很满意。果然还是地灵殿好玩啊~\n封面当然要用这局的mvp了ww', '妄想困', '2017-03-26 16:41', 'NB', '地灵殿'),
(9412378, '40小时，19次9961，红魔乡L no bomb通关达成，这是步入Lneta党的第一步，好累啊啊啊。\n视频素材都是自己打的，都是全关素材，怎么都疮了呢，为什么会变成这样呢。', '殘雪之道', '2017-03-26 20:06', 'NB', '红魔乡'),
(9429922, '信魔b，得永生。ssp这个bug真的是太好用了，全程花式抱b还能剩三残all。也是人生第一次收麻将山啊\n封面p站id=20068975', '八雲的妖怪闲者', '2017-03-27 16:54', '低封', '风神录'),
(9460091, '感谢少佐发的符卡练习器练了几天，虽然你很糟\n感谢古明地KO的好奶，说这把要发就发了\n二姨我以为你说4开路线太猎奇了，因为我撞的时候才听到的弹幕，现在想来可能你说的是上海人偶符，还有我选梅露兰2符不是瞎选哦，平时练的就是这条线，当你们发现我开了莉莉卡的时候，一定是我开错了\n\n评论置顶有补充，简介字数有限\nMISS点\n（1）奥尔良\n（2）4开\n（3）4前半道中第一波尸体弹\n（4）梅露兰1非\n（5）饿鬼十王\n（6）6开\n800点奖残没拿到，所以一共只有9残，2和3miss点实在是太sabi了', 'jokerlixin', '2017-03-29 06:02', 'NB', '妖妖梦'),
(9462364, '咸鱼的缓慢更新进度的菜鸡机师，打出来的一个咸鱼nb，开荒时间未知，基本上是每天练一下就关，加上全开档，不是很清楚时间，但是绝对有100h以上（咸鱼），没想到这把居然能发，真是谢谢师匠她给脸，想说这个永nb最难的地方是不扔出雷太难了（qwq，每次想打nb总是会扔出那么一两个雷，虽然最后也是疮（，这次拔掉了x键，终于如愿，感谢咏唱组的陪伴。\n\n封面id=18755876', '曦光布园', '2017-03-29 10:57', 'NB', '永夜抄'),
(9476515, '果然我的NB初通那些结界要不要都没区别，NBNR还是扭那些，扭不了的还是撞，奥尔良就没收过，有一把6残见妖梦，最后还是9961了，那一把特别糟（sabi撞有蝶幻，反魂蝶最后一波下退坐子弹上），这一把刷脸总算通了\nMISS点\n（1）奇门遁甲\n（2）奥尔良\n（3）梅露兰1非\n（4）37\n（5）6开\n（6）墨染樱\n（7）反魂蝶', 'jokerlixin', '2017-03-30 01:32', 'NBNR', '妖妖梦'),
(9522965, '东方妖妖梦Lnb纪念，看熟练度就知道这个Lnb没打多久了= =槽点满满的一个rep，简单剧透一下，六面开场六面墨染樱六面八分饱意料之外很多。\n\n槽点的话...14卡...14卡...14卡_(:зゝ∠)_', '殘雪之道', '2017-04-01 14:29', 'NB', '妖妖梦'),
(9541130, '视频来自royalflare\n机师：KG   机体：萌A  rep地址：http://score.royalflare.net/th12/replay12/th12_ud10f3.rpy\n嗯。。。KG这大概不算龙珠了，二面开幕必须通过自杀炸出那个额外的飞碟，全程满飞碟碎片，无开启飞碟\n嗯。。。\n嗯。。。\n不想说了，太蛋疼了23333333', '两仪式™', '2017-04-02 03:16', 'NBNU', '星莲船'),
(9541407, 'miss点：3道中非结束、狼一符、四面后半段道中、1符、三非、3符、5面2符终符、6面阴阳玉阵第四波、小碗3非、辉针剑、终符2miss\n   奇葩死法合集。你见过打LNB的终符2miss吗，还是在p1、2里miss的，你见过在犬齿符卡宣言前体术杀吗？你见过打LNB的结果道中板子记错miss的吗？你见过用咲A的在四面一符miss吗？你见过有为了水群结果记错时间被三非糊脸的吗？不要错过了这个蠢比死法合集。\n   嘛。虽然各种sabi撞最好导致一个高残通变1残通挺可惜的，不过至少打出来了。', '冰冻小伞', '2017-04-02 02:47', 'NB', '辉针城'),
(9541423, '初通。。。真的。。。\n脸挺好的。。。\n键盘有点小问题。。。\n好，辣鸡游戏打完了扔了。。。', '两仪式™', '2017-04-02 02:47', 'NB', '红魔乡'),
(9554344, '普通的NB5M，阶段性产物\n对这个机体的使用还有很多不熟悉的地方，不过最近一段时间应该不会碰这个机体了，所以先发上来\n（顺便风神录打完一圈回来还是撞了210，mjl）\n如果魔A的5增援能找到比较好的打法的话接下来研究这个机体\n（猫步？那是什么，不存在的', '星色夜樱', '2017-04-02 22:12', 'NB', '地灵殿'),
(9567420, '经历了2把9961，总算通了，觉得实战或单面玉枝跟符卡练习的节奏不一致，还是欠练，永夜抄6面真难，1符2符被杀成日常，双杀都常有\nMISS点\n（1）慧音2非\n（2）魔理沙2非\n（3）帝1非\n（4）铃仙懒符', 'jokerlixin', '2017-04-03 07:31', 'NB', '永夜抄'),
(9617451, 'vp使用\n第二个LNB,两发就all了', 'kindx', '2017-04-05 00:34', 'NB', '妖妖梦'),
(9638361, '东方永夜抄Lnm6A结界组达成，留念。\n\n咸鱼产物，第三个Lneta，其实如果打NB指不定早就出来了，一定要打个破NM玩玩2333，难度也差不多吧，为啥都说6B简单呢。仍然是六面正片吧(垃圾规划，规划个毛\n\nPS：最近是不是打neta有点拼啊233一周俩neta啥玩意儿，休息一阵子吧', '星色殘雪', '2017-04-05 23:49', 'NM', '永夜抄'),
(9647961, '自制 录像来自皇家烈焰分数排行榜 机体：单妖梦 分数： 6,751,224,840 由机师 A.H 达成于 2016年12月13日', 'vjhvgu', '2017-04-06 15:07', 'NM', '永夜抄'),
(9657315, '噗，我也成为了会规划的friends呢，魔机NM参考，3b容错，1b糊二面终符了，1b糊六面终符了，1b糊up脸上了。\n\n封面《兽娘动物园》，才不是什么神灵庙呢2333', '星色殘雪', '2017-04-06 23:12', 'NM', '神灵庙'),
(9666714, '封面P站=45850948\n首先恭喜瓶师傅红nb，祝瓶师傅早日船nbnv\n羽天非常荣幸能给瓶师傅解说红lnb，其实nb视频也就是针对各个点介绍一下打法，但是因为瓶师傅撞的太谐了，给了我在正常的解说里加一些娱乐解说进去的机会233，讲真我都怀疑各种规划撞，瓶师傅太触啦\n因为羽天红打的也不多，一些细节方面的东西可能照顾不到，请瓶师傅和各位观众们多包涵orz\n\n瓶瓶好触好萌好可爱好想捏/\n\n话说羽天真的转职成东方stg解说玩家了233', 'W羽天', '2017-04-07 14:12', 'NB', '红魔乡'),
(9680172, '熬过了所有难关，即将见到终点时，总会杀出这么个黑马\n（三后半，反魂蝶）', '假装看风景的矮穷挫', '2017-04-07 23:28', 'NBNR', '妖妖梦'),
(9690023, '许多地方板子都忘了，1000蓝点都没有吃到，咸鱼nbnr。我瞎打，你们瞎看，岂不美哉！', '紅蓮TsunDere', '2017-04-08 13:14', 'NBNR', '妖妖梦'),
(9728523, '五面崩了6M..\n打小⑤時一定是歐皇血統、、各種臉白233333\n34面各1M 5面6M 共8M', '塑料式胖次', '2017-04-09 19:48', 'NB', '地灵殿'),
(9730244, '菜\n封面60322651\n下个坑考虑打船', '猫耳蕾蒂', '2017-04-09 20:51', 'NB', '妖妖梦'),
(9736651, '入坑一年终于打出点成绩。有欧有非，也有个别失误，总之过了。分数截图贴在视频最后。顶部弹幕写了一些解说。使用VsyncPatch，无mod，无判定点。\r\n符卡练习：av9734922\r\n灵梦A LNB 初通： av10870565', 'rufeel', '2017-04-10 00:45', 'NB', '红魔乡'),
(9743267, '录像来自皇家烈焰分数排行榜', 'vjhvgu', '2017-04-10 12:37', 'NM', '风神录'),
(9764649, '自制，录像来源不明，由机师SOC达成于2012年7月28日\n\n红魔乡由于各种原因不得不使用VP，导致在游戏发售十年后才出现了NN\n\nVP是一种游戏辅助工具，主要针对红魔乡，可以消除一定程度上的操作延迟，处理落不稳定，游戏BUG', 'vjhvgu', '2017-04-11 12:08', 'NMNB', '红魔乡'),
(9789870, '老虎战开始手抖，莲妈战笑死在街上。', '一条鹹魚', '2017-04-12 16:45', 'NB', '星莲船'),
(9852739, '封面id=61216363\n神灵庙最强机体妖梦，刀锋所指，所向披靡。', '桃雨洛熙', '2017-04-15 14:52', 'NM', '神灵庙'),
(9860024, '东方地灵殿灵梦B Lunatic no bomb，继梦A之后二机体目。\n幸福来的太突然了，梦C有生之年系列。', '星色风铃', '2017-04-15 18:51', 'NB', '地灵殿'),
(9874034, '没有什么好说的了，特别感谢函数西湖，感谢其他其他给我提供帮助的师傅，也算是完成了当年立下的flag，第一次完成了nm的neta，还是挺高兴的，虽然这个很简单，也就是混关的升级版，希望能给混关的朋友们带来一点帮助。\n\n另外就是这是收到了非常漂亮的魔改风神录，使用以后直接就出了nm！多么充满发气，这个魔改也真的非常漂亮，感谢制作这个魔改的rumia师傅！\n\n最后封面P站id=50455312', '曦光布园', '2017-04-16 09:30', 'NM', '风神录'),
(9925615, '自制。东方神灵庙 No miss 梦机渣操作录像。用时13小时所以走位背板什么的就无所谓了。\nUp主12入坑，由于手残和外部原因直到16年才尝试攻略L难度，希望有生之年能打出更多No miss吧（苦笑）。', '圣德の十七条威光', '2017-04-18 15:35', 'NM', '神灵庙'),
(9961698, '东方永夜抄6B/A lunatic NMNB\n2013/10/23&amp;2015/11/11\n\n弹幕难度：低\nNN难度：低\nNNFS难度：中\n\nED曲\n曲名：月见草\n社团：暁Records × Liz Triangle\n专辑：First Memory / Next Memory\n\n对这游戏 实在是 兴趣欠缺。', '砂砾籽', '2017-04-20 09:46', 'NMNB', '永夜抄'),
(9978296, '第一个Lneta，总算是打出来了。一直比较喜欢殿这一作，算是有个交代吧。这次尝试做了解说，第一次解说我个人感觉做的很渣，毕竟五毛钱的麦（划掉）。吹麦略严重，将就着听吧2333。撞的地方很谐，怕是以后要走谐星路线了。部分走位打法参考了胶41的视频av9408922，在此表示感谢。后面的计划大概是把剩下的几个ex坑给填了，暂时没啥想法了，嗯。封面PID=62494191', '拌面酱', '2017-04-21 01:25', 'NB', '地灵殿'),
(9988147, '解说声音有点小。人生5Lnb达成，入坑以来一直划水，快乐咸鱼每一天，可能无意间开了一局就会发。那么根据糟发守恒定律，未来的几个月内一定没有任何进度。总之来纪念一下，同时也恭喜拌面师傅在同一时间也打出了殿Lnb。最后感谢给我画自机的画师，有了老婆自机时候我是无敌的！安利东方STG群：115957138。欢迎萌新大触加入。', 'Yem樱吹雪', '2017-04-21 15:47', 'NB', '地灵殿'),
(9992929, '5miss 6残出\n*5后半高能注意\n感觉用掉了一年的脸\n当然是选择原谅她啊', '星色夜樱', '2017-04-21 18:43', 'NB', '地灵殿'),
(10022286, '萌新瞎打，混关的话看看道中就行了\n什么？这游戏能满残？咕咕咕', '明月清泉', '2017-04-22 22:01', 'NM', '神灵庙'),
(10049829, '正作整数作第五个no miss，东方地灵殿，希望对大家的通关有所参考。', '能用就吃翔', '2017-04-23 20:50', 'NM', '地灵殿'),
(10059252, '紅幻SB撞，不然6面NN了\n\n菜的一比', 'DJRock', '2017-04-24 08:24', '低封NB', '红魔乡'),
(10061472, '脸不行，好几处生成都太糟强扭救场，最后还是糟不过荆棘路，卒（封面id=61618000', '九条爱丽丝', '2017-04-24 11:27', 'NB', '辉针城'),
(10159047, '十凶星那吓尿了，纠结着微移卡安定，突然头顶冒出一个小玉，幸亏手一直紧紧贴着X，魂都吓出来了。。。', '西行寺幽幽子_', '2017-04-28 21:28', 'NM', '地灵殿'),
(10172879, '自制 禁雷通关，收22卡。4面发挥失常，两次出现同一地点连续miss的情况。3、5面发挥正常，但由于4面打得太差了，5面连黄F都出来了，有点惊险。6面算是唯一亮点吧，NMNB了。\nreplay下载：http://pan.baidu.com/s/1bppJzkF', '紫外信号', '2017-04-29 14:39', 'NB', '地灵殿'),
(10179696, '这期带来的是东方风神录的NM教（误）学（导）视频，希望给出的思路有助于各位在新作中开荒顺利，顺便为幽诗人的NM祈福。封面id=57864550', '九条爱丽丝', '2017-04-29 19:31', 'NM', '风神录'),
(10204262, '某只闲者的人生第一Lnb，完成于4月4日，结果打完第二天原来的电脑就坏掉了，幸好rep之前扔百度云了。\n换了台电脑之后终于可以接麦克风录音了，所以大概以后的视频都会带解说？\n封面P站id=44943211', '八雲的妖怪闲者', '2017-04-30 18:53', 'NB', '妖妖梦'),
(10245545, '2015/12/3\n东方绀珠传L NMNB\n弹幕难度：高\nNN难度：高\n\nED曲/图：11/ID\n感谢两位\n\n在最后难得的矫情了一把 真爽\n别感动啥的 就是我强行套路一波而已\n毕竟系列完结然后搞这种套路都感觉是固定套路了（\n随便听听别往心里去（\n顺便视频开始部分强迫症福利（\nth16的话 大概会玩 不过竞速之类的事很难参与\n估计事情不少 现在更了绀也是在16出来前了结一波\n迈向新的旅程.JPG\nMD又中二了 不说了 最后祝你们提前\n再见', '砂砾籽', '2017-05-01 23:37', 'NMNB', '绀珠传'),
(10248968, '封面P站=35311024，也是懒得去P站找了，从我存储里翻出来的（别问我咋存的我也不知道\n先恭喜鵺师傅打出了丧心病狂的恋符nb，太厉害了\n整个nb打的极其正常（个鬼），前三面撞的羽天都看了想跳楼.jpg，后三面倒是撞的都是比较糟的地方\n而羽天也是在一些地方比较了魔b与梦a魔a的区别\n这世界上打红nb的只有羽天不会翡翠巨石了\n这世界上打红nb的只有羽天不会翡翠巨石了\n这世界上打红nb的只有羽天不会翡翠巨石了\n以上', 'W羽天', '2017-05-02 01:25', 'NB', '红魔乡'),
(10260317, '自制 录像来自百度网盘（这样说应该没问题。。。）特殊挑战：低封NBNV（没有达成NM）由机师 SOC达成于2013年9月7日\n\n来自SOC的极致表演，大家看看就好（', 'vjhvgu', '2017-05-02 16:11', '低封NBNV', '星莲船'),
(10306723, '这是我第一次NN进4打出来的,你们信不信', 'EXTRAシューターA2', '2017-05-04 17:05', 'NB', '永夜抄'),
(10311326, '借着幽诗人活动研究的新路线，希望躲子弹苦手的同学能借着这条路线靠执行而非硬扭打出nm吧。\n建议炸掉河童一非，三关底四蝴蝶上顶：av6874184\nrep：http://score.royalflare.net/th10/replay10/th10_ud1976.rpy\nhint：http://pan.baidu.com/s/1jIBQdIQ\n使用方法，在游戏文件夹新建hint文件夹，将这个文件扔进去，到游戏option界面hint选on\n幽诗人加油\n祝wa女装成功（笑）', '鹰富士茄子', '2017-05-04 20:34', 'NM', '风神录'),
(10330868, '自制，机师：SW-el\n\n本来是趁着USR的活动热热手准备开荒天空璋的，没想到随手打出来了……于是凑个热闹\n\nreplay : http://score.royalflare.net/th10/replay10/th10_ud1979.rpy', '平坂景子', '2017-05-05 17:46', 'NM', '风神录'),
(10397587, '打了8个龙珠11个2m以后终于发了，8个龙珠分别是，麻将，风神，文一非，照国击破撞，准备，六道中，五道中，风神。太毒了这个游戏。至于封面为什么是爱丽丝，当然是因为我女儿又漂亮又可爱啦！', '幽U子', '2017-05-07 23:50', 'NM', '风神录'),
(10479478, '嗯，就是这样，为了参与幽诗人的女装抽奖而出卖灵魂（？？？）\n从混关玩家化身为neta玩家，打出NM(然后因为脸黑抽不到女装\nQAQ这次视频画质不太好（昨天直播卡就把码率调低了，然后忘调回来了\n题外话：直播间勋章已开，只要998，“冰镇”勋章带回家，还你夏日清凉（迫真）', '冰镇维C果汁', '2017-05-11 18:09', 'NM', '风神录'),
(10550791, '今早直播打的\n东方地灵殿 No bomb 2 miss（勇仪道中符，太阳）\n机体梦b。\n5开和6前半因为直播的原因有些掉频率，不过问题不大', '塑料式胖次', '2017-05-14 13:14', 'NB', '地灵殿'),
(10554903, 'id=32312086\n上个星期天打出来的，机体：梦B\n脸比较好，1、2、3、5面nn，4面撞了4残，果然4面才是这个游戏的本体啊（ 最后进六手抖得一比，好在还是过了=。=\n机师多动症，经常出现自机上下抽搐的现象，请不要在意（\nreplay：http://pan.baidu.com/s/1bo0t16n', '弱智qyy', '2017-05-20 16:20', 'NB', '风神录'),
(10560625, '苟利星奏生死以，岂因新岛避趋之。标题借用了一下贴吧的一篇文（      这个rep是被新岛老贼坑了第二次后心情郁闷躺床上打的，全程梦游，没想到竟然能发。。。最后说一句：吃屎啦！新岛！', '西行寺幽幽子_', '2017-05-14 18:31', 'NB', '地灵殿'),
(10684206, 'miss点:五道中七吴克', 'EXTRAシューターA2', '2017-05-20 10:18', 'NBNT', '神灵庙'),
(10718682, '虽然是3年前打的，还是放出来吧。。毕竟是项成就。\r\n1M撞在了阿空一符，太糟。', '惨淡的汪洋', '2017-05-21 13:46', 'NB', '地灵殿'),
(10812027, 'MISS点\n3面:光学\n4面:210,风神\n5面:准备\n6面:神德x3', 'EXTRAシューターA2', '2017-05-25 13:48', 'NB', '风神录'),
(10812543, 'MISS点\n3面: 一符\n4面:一非\n5面:一符\n6面:开幕,三非x2,五符', 'EXTRAシューターA2', '2017-05-25 14:10', 'NBNR', '妖妖梦'),
(10870565, '五面心态崩盘miss五次，其余2m分别是魔法阵和红幻，整体来是人品爆发了。分数贴在视频最后，顶部弹幕有一些解说。 \r\n使用 Vsync Patch 和 dx8 to dx9 converter，无mod，无判定点。 \r\n灵梦B LNB： av9736651', 'rufeel', '2017-05-28 01:18', 'NB', '红魔乡'),
(10902309, '风神录lnm，机体魔c。\n本来是最简单的一个lneta，结果菜鸡我打了50个小时才出，前41个小时忘了打vp，后面突然发现了补上vp补丁后又打了9小时（汗）。\n直播的时候一发出的，所以前面浪后面缩，打神德的时候胃都疼了，怂的不行（', '糟苗・_・', '2017-05-29 06:56', 'NM', '风神录'),
(11001283, '封面必须是本局MVP！\n东方神灵庙Lunatic 禁雷禁主动灵界 all\n去年11月开坑，4残见神子9961后弃坑了半年左右，终于如愿以偿，新档新发气.jpg\n1道中和4道中打的非常烂，你要问我为啥，因为打的好的都疮痍了\n\nreplay：http://score.royalflare.net/th13/replay13/th13_ud0b37.rpy', 'Little泡泡0', '2017-06-01 23:40', 'NBNT', '神灵庙'),
(11064152, '人参第一LNB纪念 就这样；菜的一笔\n封面大概只有玩了机战或幻少的人能get笑点（', '夢渡まくら', '2017-06-04 16:09', 'NB', '永夜抄'),
(11084769, '封面id=54100268\n正当我正在考虑怎么录个视频庆祝生日的时候发现了这个久远的视频，于是把这个视频发出来水一个好了（\nrep完成于去年10月26号，而秒杀（@mylove7210）录视频也早就在29号录完了，不过因为个人一些原因没有发出来。。\n总之也算是人参第一个L的neta。虽然up主还是要借某位神触的话：”妖的nb能算是NB吗？”\n嘛，总之一个菜字。', '夏花火', '2017-06-05 12:08', 'NB', '妖妖梦'),
(11119045, '妖妖梦Lnb第二机体咲夜b，又是一个很悬的裸通呢，收14张卡太尴尬了\n最近一直在打妖妖梦的分，然而人太菜打不好，到现在只能12亿QAQ，然后猛然间发现我一堆玩意都能扭了然后转战打nb，莫名其妙不到推把一次就出来了，突然有种想打妖Lnb全机体的冲动2333333', '八雲的妖怪闲者', '2017-06-06 19:44', 'NB', '妖妖梦'),
(11119862, '打的很烂，没什么好说的\n沙沙我爱你啊！做我老婆吧沙沙！\n1P录糟了，2P重录', '大型制空朱元璋', '2017-06-06 20:14', 'NM', '神灵庙'),
(11129763, 'MISS点:\n二面:后半道中,2非\n三面:道中符,后半道中\n四面:后半道中,3符\n五面:前半道中x2\n六面:道中,封兽球', 'EXTRAシューターA2', '2017-06-07 06:45', 'NB', '星莲船'),
(11189882, '打得很谐，全程sabi撞，残1，能通多亏文文给面子，不做多的评论了。\n\nmiss点：流刑人偶，三面关底大蝴蝶，水皿，狗椛，大和茅环，天水，麻将', '哼歌必灭之理', '2017-06-09 20:22', 'NB', '风神录'),
(11259527, '新人初投稿，纪念一下自己入东方坑一周年。\n普通的地灵殿lnb，使用机体灵梦B，糟大约两个星期，半个月之前终于总算打出来了。\n走位主要参考了鱼形和水月两位史诗级大触的梦B的rep，十分感谢前辈们的贡献，给了我很多启发\nmiss：四面道中非，户隐山x2，猫步x2，五面后半x2，核热\n个人操作还是不太稳，而且五面打得很菜，还请各位多多包涵', '遥云竹雨', '2017-06-12 03:42', 'NB', '地灵殿'),
(11295180, 'nn满地走，nb不如狗。这应该是毕业之前的最后一个坑了，下次填坑时间可能是很久以后啦。总体而言永夜抄不算难，不过比较糟，这个rep打的不太好，权当娱乐吧。最后想说一句，飞机真有意思呀~ 封面PID=11606595', '拌面酱', '2017-06-13 16:05', 'NB', '永夜抄'),
(11300629, '东方风神录 Lunatic难度 No-Miss满资源通关（满残、满火力、满最大得点）。机体：魔理沙C（魔法使装备），最终得分：1,421,094,270。大概连混分都算不上，只是一个普通的满资源。其实我在一年之前就已经打出风神录LNM了，但不是满power通关，而满资源在17.5.26才打出来，所以说风神录太难了.jpg \n若想观看原画质的游戏录像，请下载replay：http://score.royalflare.net/th10/replay10/th10_ud1993.rpy', 'Rainnye', '2017-06-13 20:05', 'NM', '风神录'),
(11337521, 'player：YDC\n直播一发出的，准确来说算是伪NBNT，被弹灵界是开了枪的，不过其实也差不多==\nmiss点：娘娘道中非，通灵芳香，胎动，天舟，狗眼光，星降\n娘娘究极难（', '樱华辉月', '2017-06-15 10:26', 'NBNT', '神灵庙'),
(11357834, '我的第一个正经的Lnate（之前打过一个低封）风L nomiss\n因为第一次解说比较紧张，所以有很多口误，在底端进行更正和补充', '411022', '2017-06-16 02:13', 'NM', '风神录'),
(11443857, 'Replay下载: https://pan.baidu.com/s/1gfqtQRh （中文版打的。。打完才意识到有什么不对。。） 虽然只是浩瀚星空中的一瞬微光 但个人而言无疑是历史性的一刻 敬请欣赏', '神戸綾', '2017-06-19 08:43', 'NMNB', '永夜抄'),
(11523818, '其实只是好久没发片了上来骗点播放量（划掉\n东方风神录魔a nm13.8e \n这破飞机把我心态打崩了，这个咸鱼nm居然打了22小时。打这机体主要是想看看魔A到底有多傻逼，打之前本来以为挺简单的，没想到糟了这么久（太菜了。只收了6张卡，这分数也是难看的不行（\n其实没啥好看的，道中基本套用的梦b的走位，唯一的看点大概就是御柱了吧（能掉1kw scb的机体我还是第一次见\n以后大概不会碰魔机了，太sabi', '999只琪露诺', '2017-06-22 11:44', 'NM', '风神录'),
(11577533, '其实以前就打出来了，但是没什么看点+rep损坏就没放上来，这次竟然收了神德……\n这次录制用的是60帧，应该看起来很流畅。\n感觉打的挺满意的，不好的地方可能就4面失误了一下吧，毕竟是风的四面啊。\n说收神德，其实这次脸意外的好，正常情况不能收的（\n话说河童还真是腹黑233，道中踹符，一非必须等对话时候出来的bgm名字消失再扭，不如会挡住自机。\n谢谢大家支持，请大家投币关注什么的quq', '极其普通的魔法使', '2017-06-24 10:42', 'NM', '风神录'),
(11581285, '东方永夜抄6BLNN \n技师：梦桜夜  梦&amp;紫\n不多说了，恭喜', 'BlaAue', '2017-06-24 13:50', 'NMNB', '永夜抄'),
(11587782, '发了发了发了，耶\n\n不容易啊，这玩意儿应该一共糟了46个小时，手抖的坏毛病是治不好的，纯符日常4M可还行，噩梦结束了\n\n说起来Lnb是看的人最少的却是花的时间最长的视频啊，唉，或许这种东西对自己的价值比较大吧\n\n不知道几个人是直播见发的，最近直播都有点卡，不过这次也还是直播打的，后期可能就不糟绀珠传了，不过也会回来打打吧www\n\n哦对，前面有评论里问我避弹方法的...建议私信，评论好像我手机这儿不会直接提示，容易漏掉(', '星色殘雪', '2017-06-24 17:55', 'NB', '绀珠传'),
(11602131, '终于把这个坑填上了 象征性的投一下稿 解说版本在av11581285 感谢BA鸽鸽 赞美BA鸽鸽', '四季鮮花之主', '2017-06-25 05:01', 'NMNB', '永夜抄'),
(11619852, '没NN六面不开心...0 0\nmiss点：一面关底青兰2非。二面铃湖道中非，后半妖精。三面道中关底，123一非×2，梦我梦中。四面前半激光，探女道中非，关底探女二符，三非，终符。五面后半红蓝星星，小妖精1非，三符。六面流星雨，神灵界。\n共17miss点... 太难了这游戏...QWQ...', '塑料式胖次', '2017-06-25 20:27', 'NB', '绀珠传'),
(11642309, '东方风神录 Lunatic难度 No-Bomb通关。机体：灵梦A（诱导装备），最终得分761,134,850，剩余2残机（6 miss）\r\n基本上是瞎打的，从开坑到出货只用半小时，为什么这么快，因为我用了梦A（确信），然而梦B的NB一直都没出。\r\n标题解读：欢迎观看本沙包在4面关底的激 寒表演（不剧透。\r\n若想观看原画质的游戏录像，请下载replay：http://score.royalflare.net/th10/replay10/th10_ud198b.rpy', 'Rainnye', '2017-06-26 15:47', 'NB', '风神录'),
(11647231, '断断续续打了半年，今天直播时终于打出来了，这也是人生第一个LNB', 'Saaawyeeer', '2017-06-26 18:54', 'NBNR', '妖妖梦'),
(11651955, '糟了半年的坑，上周挂机升级一个月回来打了一个9961，这次和上周一样也是2残见辉夜，然后通了。\nmiss点：夜雀二非X2（本来引到右边了，结果她跑左边去丢使魔了），侘（收率一直捉急），黑兔子一非（脸黑），大兔子二非（脸黑），大兔子二符，大兔子三符（火力太低拖太久），龙玉。\n总共25卡（含虫子，老师，灵梦的LSC），永夜返太紧张了导致一个都没收。\n因为使用了全开，所以估计游戏时间大概有五六十个小时？\n再也不开这种sabi坑了，NN的话有意向，但想到那些蛋疼的糟点就没干劲。\n封面：50353643', '荣术しょうこ', '2017-06-26 22:02', 'NB', '永夜抄'),
(11691638, '小碗超级萌，然后一非就糊了我一脸。', 'wasupandceacar', '2017-06-28 12:31', 'NB', '辉针城'),
(11725467, 'replay来源于网络,这位机师还打了魔B的NMNB，详情见av3123696\n机师SOC,replay由英文版播放', '圣神小夜', '2017-06-29 17:25', 'NMNB', '红魔乡'),
(11806488, '封面P站=62924192，不要问我连续投稿的封面为啥不是趴着就是躺着的，我也不知道\n这是考试期间接手的第三个rep\n那么也是恭喜条姐打（nian）出了妖nbnr，虽然也是各种谐比撞）\n机体是豆腐（划掉）面包（划掉）诱导机梦a，以后就叫条机好了，我好像就见到这么一个拿梦a打nbnr的\n顺便羽天又发动了奶rep的技能，详情请看uuz二符生者必灭\n条姐加油打个低封nbnr啥的吧', 'W羽天', '2017-07-02 09:01', 'NBNR', '妖妖梦'),
(11834296, '直播出的\nmiss点\n四面:后半道中,三符\n六面:紫云,香蕉船,魔神', 'EXTRAシューターA2', '2017-07-03 04:36', 'NBNU', '星莲船'),
(11853452, '人生第四lnb\n之前就有打出来过这个但是某些原因电脑被病毒弄炸了，重装之后才打了这一次23333', '塑料式胖次', '2017-07-03 19:20', 'NB', '辉针城'),
(11858402, '撞得实在是太谐了\n1残过了辉夜，开坑以来最好的一次了', 'BlaAue', '2017-07-03 23:50', 'NB', '永夜抄'),
(11874531, '恭喜羽天师傅永Lnb达成！这挂比这么懒，不然早打出来了。', 'Yem樱吹雪', '2017-07-04 15:04', 'NB', '永夜抄'),
(11920464, '这次没有1R自尽，也没有1R八分饱。萌B鸡体，打得很谐很咸，有点想尝试一下豆腐机qwq', '一条鹹魚', '2017-07-06 00:06', 'NBNR', '妖妖梦'),
(11946542, '沙包第一个LNB，录下来留作纪念。', 'HnnTs', '2017-07-06 20:24', 'NB', '永夜抄'),
(11952104, '这就是所谓的  不NN收卡多  NN局收卡糟\n上次我为什么撞了系谱!（不撞你后面也得糟。jpg）\n跟上个NN  6B 隔了这么久   真是越来越菜了\n祝大家发', '钦定级菜鸡IAH', '2017-07-07 01:07', 'NMNB', '永夜抄'),
(11957976, '该REP完成于2017-7-6\r\n本来是想着太久没STG复健下挑战永LNM，结果糟两个多月出了十个龙珠才打出来！orrz\r\n本来永LNM应该是简单的不能再简单了，但我一直很糟打了十个龙珠才出来。\r\n……其实中间被SJF大帝亲自祝福了。一定是这种神秘力量在阻止我LNM的，嗯嗯、【。\r\n十个龙珠之间还有各种奇葩的撞，什么高残进6被体术，撞铃仙一非，BOMB全道中决死- -b\r\n反正就是这个NM糟了太久心都碎了，但是终于发神还是眷顾我了打出来了。\r\n最后部分打的太咸了……不过总算告一段落了【吐魂】！！', '多多良小狐', '2017-07-07 05:52', 'NM', '永夜抄'),
(11984243, '风糟累了，打打混关休息一下，反正是娱乐嘛，灵梦机体中我最喜欢的也是妖梦b，于是试着打了一个低封的娱乐混关，没想到真的all了，纯粹当成娱乐吧，抱b有点多请见谅orz\n\nps：有弹幕提到录制22分钟业风那里出现问题，我不是很清楚，可能当然录制的时候不小心快进了？突然加速好奇怪，以前没有遇到类似的情况qwq，不知道是不是我自己按的，但是我好像是没有碰，给各位观看造成困扰很抱歉。', '曦光布园', '2017-07-07 22:32', '低封', '妖妖梦'),
(11990931, '這是我第一個Lneta\n第一個L不是獻給老婆，現在neta就一定要獻給她\n希望她能帶著我走過以後的所有初通。\n\n感謝JB，曦光，青鼠，泡，毛玉，書記.....等等等等群內師傅們的支持。\n\n如果聲音解說有雜音，請見諒，MIC太蛋疼了。\n\n總計去年所花上的時間約莫70小時，有25小時是夢B，也就是最近打的遊戲時間\n能夠打的如此發，也是得來不易\n親民妖，超親民！', '博麗洛曦', '2017-07-08 05:17', 'NB', '妖妖梦'),
(12008675, 'UP主永夜抄NMNB前最好的一个记录，话说竟然没有龙珠，不科学啊。\n在2016年8月打完船L后就进入半退坑状态，听到新作要来了就回坑了。不过从目前的体验版的状况来看还是等正式版出来吧。', '纵横TTT', '2017-07-08 19:18', 'NB', '永夜抄'),
(12012818, 'sabi猫步guna！！！！\n闲的没事来了一发。。。\n结果打成了NB1M!\n唉.. 就差那么一点。。。\n不过第一次龙珠，还是很开心的！', '塑料胖次', '2017-07-08 21:59', 'NB', '地灵殿'),
(12012825, '新鲜出炉的NB2M\nMISS点：花增援，天水。\n......\nsabi天水guna！', '塑料胖次', '2017-07-08 21:56', 'NB', '风神录'),
(12013620, '划水打了个红L低封all，4面后半激光阵失误严重', '411022', '2017-07-08 22:34', '低封', '红魔乡'),
(12018400, '沙包的第一个低封L，失误比较多。', '拿着锤子の肥宅王', '2017-07-09 02:28', '低封', '永夜抄'),
(12018550, '开坑NBNR的同时也开了个NB的坑，然后练习一段时间NBNR单面后打出了NB_(:з」∠)_很多地方没爆结界是因为想着反正一结界带不走，干脆扭着看能不能收？最后反魂蝶因为樱点不够愣是撞了两残才开启无限森罗\n总共收了21卡，miss点:天童，三道中二非，莉莉白，四增援，四结尾，墨染x2，反魂蝶x2。\n接下来就是NBNR，希望半年能发。', '荣术しょうこ', '2017-07-09 02:37', 'NB', '妖妖梦'),
(12030183, '第三个机体达成orz，但是离全机还是遥遥无期啊QAQ\n所以说三面真难QAQ，每次三面糟成狗，看来是时候安静练练三了\n封面就采用这次的敌方MVP小爱了，不过是黑化版的orz。\n封面p站id=56079279', '八雲的妖怪闲者', '2017-07-09 12:43', 'NB', '妖妖梦'),
(12048948, '1-6開機師:菜雞洛曦\n6開後機師:博麗靈夢\n\n過了6開老婆看不下去了讓我別打了她自己來\n\n我猜因為uuzsama每天跟老婆搶紫媽所以老婆心生怨恨要不然怎麼能把uuz打成這樣\n\nMiss:晴明大紋/三後半/蓬萊/四增援/騷靈一非/騷靈二非/鍵靈/垃圾人神劍/六開', '博麗洛曦', '2017-07-09 23:58', 'NB', '妖妖梦'),
(12075351, '比较中规中矩的一个NB规划，因为失误丢卡所以选择收取墨染樱凑齐15卡然后扭三波反魂蝶的策略，希望能够帮助到正在开坑的选手吧！（距离上次魔A满残已经一年多了，然而魔A的NN打了百余时还是出不来，弃之）\n————————不正经的分割线——————————\n光速填坑，从开坑到填坑共用时0.5小时（大雾，捶地）\n直播的时候洛曦师傅想让我用用梦B，然后亲自指导的，没想到居然……再次感谢洛曦师傅！\n顺便梦机跑的太慢啦', '星色Jumbo', '2017-07-10 21:45', 'NB', '妖妖梦'),
(12091028, '什么？又一个咏唱0037！\n算了算了，我不打了，坑坑0033吧，每天至少保证两把NB吧\n晚上直播,,,,,发了....发了....\n发的实在太快，没想到。真是幸运啊\n祝大家都发', '钦定级菜鸡IAH', '2017-07-11 11:50', 'NMNB', '永夜抄'),
(12116602, '地灵殿 lunatic no bomb 8miss 开荒用时8h\nmiss点：我不说你们绝对想不到\n今天就要让你们见识一下什么叫究极蛇皮呆逼\n四面开始正片\n封面 id=38590965', '四季鮮花之主', '2017-07-12 05:41', 'NB', '地灵殿'),
(12116804, '二面前半出现了重大的失误，损失2B，不过好在后面有容错就没有推把。四五面基本上执行的算是完美了吧，\n四面终符的2B和六面四非的2B但是差点让我心都凉了，不过还好飞钵放了我一马，没有出糟生成（天国的shin）\n——————分割线——————\n加了一下大概魔A的时间也有51个龙珠了。一年半，220小时了，算是入东方以来最大的一个坑了吧2333，算是夙愿也不为过了。\n普通的魔法使，如果努力的话，也是有机会击败大魔法使的吧！\n感谢这么长时间以来大家对我的支持，也特别感谢Aiissac和ggg的不杀之恩！', '星色Jumbo', '2017-07-12 05:51', 'NM', '星莲船'),
(12131228, '对东方永夜抄LNMNB做一下难度分析（字幕解说），如果里面有问题在评论区发言，原录像可以转到2P\n符卡收取为34/37\n作为一个灵梦厨怎么能不用灵梦机体？', '纵横TTT', '2017-07-12 17:35', 'NMNB', '永夜抄'),
(12134909, '前几天刚打出来的，机体结界\n话说最近好多永nn', '假装看风景的矮穷挫', '2017-07-12 19:40', 'NB', '永夜抄'),
(12139831, '沙包的第二个LNB，用时66小时，练习61小时，实战5小时', 'HnnTs', '2017-07-12 22:54', 'NB', '风神录'),
(12174818, '沙包的第二个低封通关www', '拿着锤子の肥宅王', '2017-07-14 10:05', '低封', '风神录'),
(12181180, '六月底开的坑，12号立了个半年打不出就女装的flag，结果13号一次疮埋骨一次NB1R裸通之后就打出来了！miss:莉莉白，业风，六开，生者，墨染，反魂蝶。\n五面800奖残溢出，不然应该留5残的（\n接下来应该会去打庙，这下真的要半年出了)', '荣术しょうこ', '2017-07-14 10:14', 'NBNR', '妖妖梦'),
(12219330, 'rf原话:ノーミスノーボムノーベントラー全スペカ取得\r\n         全作品LNN(N)FS達成です。いやー長かった。\r\n天菜之前就已经成为世界第四个东方全LNN达成者，全机体NB达成以及一些零零碎碎的成就，所以船LNNN打出来后也算是真正意义上的全LNN（N）了，另外其本人也有主页，记录了一些个人成绩；http://twpf.jp/amana_frandre\r\n最后再强调一下，这不是我打的，这不是我打的，这不是我打的\r\n封面p站:63490536', '九条華恋', '2017-07-15 14:02', 'NMNBNV', '星莲船'),
(12258719, '谢谢条姐的帮助！！！\n人生第一个LNNFS（好激动啊23333）\n入坑十个月终于有了回报...\n打风的时间也有85小时左右了。。这个NN真的是脸太好了...（殿打了快300小时了连个梦ANN都没出真是丢人23333）\n嘛..这个就当是一个给自己继续打下去的一个奖励吧233333。\n最后，祝各位师傅马上就发φ(≧ω≦*)♪！！！', '塑料胖次', '2017-07-16 19:01', 'NMNB', '风神录'),
(12258749, '瞎玩的...然后脸太好了...= =', '塑料胖次', '2017-07-16 19:02', 'NB', '风神录'),
(12281349, 'replay来自于网络\n机师SOC，符卡收取35张，最终得分 4,675,071,290', '博丽霊夜', '2017-07-17 11:57', 'NMNB', '永夜抄'),
(12311271, '感谢所有关注我，给我帮助的朋友和师傅们，用了将近70h的时间才从风nm打到风nb（菜），真的非常谢谢。\n非常高兴有生之年能够打出这个，也算是没有什么遗憾了。\nmiss点：三面后半毛玉阵，椛椛*2，五开毛玉，开海，六大蝴蝶，神粥，神德\n三次元越来越忙，可能再也没有开坑的经历和时间了，这个就当作我的退坑留念吧23333，虽然不开坑了，我的朋友们，我还是永远爱你们。', '曦光布园', '2017-07-18 10:04', 'NB', '风神录'),
(12505272, '封面id=63518428\n时间2017.7.23 机体结界组，大约40+h？\n结算13B 25卡\n第一个Lneta，打出来还是非常开心的，4颗龙珠(1Miss，200+发玉枝，不知多少次的BR、单关练习。\n终于也从混关向前迈出了一小步，希望以后能打出更好的成绩。', 'Hakurei西柚子', '2017-07-23 20:09', 'NM', '永夜抄'),
(12520451, '东方地灵殿 Lunatic 灵梦A NMNB\n幸福来的太突然.... 都不知道该说啥了qwq\n打殿也有300小时了，梦A目前只吃了一颗四开猫龙珠。。。\n总之就是脸好2333333', '塑料胖次', '2017-07-24 09:26', 'NMNB', '地灵殿'),
(12569429, '首先感谢llh佬的录制和ed制作\n十分不辞辛苦，ed做得很用心\n时不我予，0033的坑以后再填\n很遗憾，今年至今没成功填坑\n视频中内容多为吐槽去年的我\n未来几天会陆续上传些旧录像\n因为害怕ed不够清晰而上传P2\n（补充：五面道中二非，我说的e是小写的e，开始的时候说的应该是31卡而非30卡，ed所用BGM为Lunaptaris）\n永琳大人，你看见了吗？', 'Oblivion117', '2017-07-25 17:49', 'NB', '永夜抄'),
(12571632, '封面P站id=63677209\n东方妖妖梦Lnb第四个机体，emmmmm\n事实证明ennn比Lnb难，这几天全在糟ennn，结果这玩意打完忘了录视频orz\n全机nb还差两个梦机，我和灵梦真的没默契，不会玩，用灵梦打个ennn结果rep炸了，绝望', '八雲的妖怪闲者', '2017-07-25 18:07', 'NB', '妖妖梦'),
(12598655, '东方绀珠传 灵梦no bomb 满残 通关\n...最近发的太突然了\nNN感觉再练练差不多就可以了。\n辣鸡小妖精辣鸡123！！', '塑料胖次', '2017-07-26 13:38', 'NB', '绀珠传'),
(12605075, '因作者意愿隐藏，想看可以去视频页面', 'Oblivion117', '2017-07-26 16:31', 'NB', '风神录'),
(12611450, '状态极糟 脸也不太好\nNN遥遥无期\n\n收率为NB开始以来的真实收率.\n机体梦A. 直到NN前除梦B外不碰其他机体.\n\n总游戏时间约34h. 想想隔壁300h才出NN的塑料胖次, 心中不寒而栗. C92一过要到1年后才能接着打.\n\n本录像1-2面NN, 即使1面一非遭遇下压（\n3面...你跟我说撞了大江山颪这种菜卡??\n4面道中因为1意外miss而导致节奏紊乱, 附赠1miss.\n5面呆比3miss.\n黑死蝶不给面子. 阿空更加不给面子. 地底太阳手滑（\n虽然不满意, 但估计暂时就这点水平了（', '羽毛掺了铬II', '2017-07-26 19:30', 'NB', '地灵殿'),
(12627756, '这个rep诞生于39度没有空调的闷热宿舍里。', '糟苗・_・', '2017-07-27 08:39', 'NM', '神灵庙'),
(12655626, '于是她选择了逃避——接标题\n看了一圈发现B站这边没投过梦ANB的视频就顺便投一个\nMISS点：【疑似】怨灵猫乱步\n（之所以放这个视频是因为短期不会再碰这个机体了，嗯\n（HiScore是开无敌打的NN的路线', '星色夜樱', '2017-07-28 00:38', 'NB', '地灵殿'),
(12754592, '10个2m，4个1m，错过了很多次成功的机会后，终于发了一回——或许这就是缘分吧\n神子战多处高能', '假装看风景的矮穷挫', '2017-07-30 15:57', 'NMNBNT', '神灵庙'),
(12772217, '封面p站id=57725305\n第五个机体完成，梦B是一开始打LNB就使用的机体，结果一直糟，后来才换了魔A。结果最近这拿到一个魔改之后几发就出来了，emmmmmm，一定是灵梦的问题23333333\n最后感谢小夜的魔改', '八雲的妖怪闲者', '2017-07-31 02:17', 'NB', '妖妖梦'),
(12775373, '东方妖妖梦LNMNBNR，机体梦A\n有意栽花花不开，无心插柳柳成荫吧，太幸运了\n四道中增援高能，六道中符超高能', '假装看风景的矮穷挫', '2017-07-31 05:18', 'NMNBNR', '妖妖梦'),
(12776682, '如标题所示。\r\n一发打的东西，充分证明了魔机比梦机好用多了.jpg 。路线就是nn残8路线，婶子战打的拼了点。\r\nmiss点：道胎动，天舟，大火，星降。都是sabi撞。\r\n所以菜鸡的技能就是把发气变成糟气。', '冰冻小伞', '2017-07-31 06:24', 'NB', '神灵庙'),
(12789393, 'repaly来自于rf\n机师原话：Touhou 15 LNNFS!!!\n完成时间：2017年7月29日', '更衣小夜IX', '2017-07-31 14:52', 'NMNB', '绀珠传'),
(12807838, '练了六个月的产物。三面神穿一次，总算是nb了。\n高二下假期真的少，每次开直播练习都是疮四面，本来想着根本不可能nb了，结果就……\n我脸真的够好，一面nn，二面nn，三面nn，四面5m，五面nn，六面2m。\n然后，我特别想向零师傅@零式嵐 道个歉的，因为我在刚入坑的时候，曾经因为过不了e麻将发愁，那时加到他的群里，他给我很多视频并教我打，但是我那时不会说话，也说了很多冲话，让他很伤心……（哭）我在这儿向他道个歉……\n最后，高三学习紧，先不打东方了，大家18年6月再见~\n封面pid：21576582', 'a100xiaoxue', '2017-08-01 05:22', 'NB', '风神录'),
(12891185, '封面P站id=60456410\n4月4日魔A 11miss16卡 推把次数500+ av10204262\n6月6日咲B 11miss14卡 推把次数286 av11119045\n7月8日咲A 10miss13卡 推把次数67 av12030183\n7月15日魔B 9miss18卡 推把次数12 av12571632\n7月26日梦B 5miss15卡 推把次数7 av12772217\n7月26日梦A 7miss18卡 推把次数3\n至此，闲者的东方妖妖梦全机体lunatic难度no bomb完成', '八雲的妖怪闲者', '2017-08-03 12:00', 'NB', '妖妖梦'),
(12927957, 'replay均来自皇家烈焰\n蛇符：ノーミスノーボムノーベントラーフルスペカ。\n星LNN3機体目、NNNは初達成。再挑戦するならこの機体でという希望を叶えられて嬉しい。2017/06/22 23:29\n蛙符：ノーミスノーボムフルスペカ。\nLNNFS3作品目。UFO回しありの8-9だけど、蛙符で達成できて嬉しいです。2015/03/14 16:11\n\n这位机师还打了蛙符的最高分33.57亿，见av5946624', '更衣小夜IX', '2017-08-04 02:13', 'NMNBNV', '星莲船'),
(12958808, '噗，下次去弄个麦，希望没人看系列作品，墨染妹妹超厉害，超萌超可爱，想...(', '星色殘雪', '2017-08-04 21:11', 'NBNT', '神灵庙'),
(13001424, '大家好，这里是Yuki。\n现在投稿还要绑定手机了，真麻烦。\n糟了大半年，昨天终于在直播间打出了nb\n(我才不会跟你说是在sjf和少佐的注视下发的)\n本视频你将会看见:\n高残见神妈差点玩脱\n傻逼撞×3\n因为脸黑被封位弹逼到墙角\n欧洲人の原地站捅\n明天是我风神录梦b初通一周年，非常感谢一年中各位师傅对我的教导\n最后，欢迎加入普通じゃないの498裙，群号码：596215633', '桃雨洛薰', '2017-08-05 23:02', 'NB', '风神录'),
(13012768, 'rep来自皇家烈焰\n\n机师：KG\n机体：魔B\n达成时间：2017/8/5\n\nKG，著名东方玩家、闲比，星莲船专精。曾打过各作的花式neta、分数，最为著名的是以33.57亿的分数夺得星莲船最高分纪录。这一次的NN打得也是相当的瞎眼……玩过星莲船这一作的都知道魔B这机体有多杨伟，火力弱、雷伤害小，加之星莲船L难度酸爽的弹幕，能达成这一成就确实不容易。大概对于KG而言，普通的LNN已经是随手的事情了吧。', '凋叶色', '2017-08-06 08:00', 'NMNB', '星莲船'),
(13028530, '没有残的游戏，满满都是糟点\n什么？道中简单？我这菜鸡5开兔子阵撞过2次，真是太菜了\n吐槽下魔理沙的小星星旋转，星星正中心也会旋转移动的，并不仅仅是自转，黑洞边缘经常判断轨迹出错\n\n这次的扔雷10次13个雷：\n1.137 1雷\n2.小行星带 决死2雷\n3.2非 1雷\n4.3非 1雷\n5.帝1非 1雷\n6.永琳道中非\n7.龙玉 1雷\n8.辉夜2非 决死2雷\n9.舍利子 1雷\n10.玉枝 决死2雷\n所有雷都是使用妖梦的符卡，毕竟幽幽子的雷伤害不足', 'jokerlixin', '2017-08-06 17:17', 'NM', '永夜抄'),
(13087622, '15年打的，现在看看好像水平还不如当年了（（', '彩笔沙包⑨', '2017-08-08 03:28', 'NM', '风神录'),
(13108045, 'miss点：12阶、豪族，12阶实际上是紧张导致缩比引起的miss，而豪族是站位错误导致的体术。\n      这个就是打nn残8打烦了后散心的产物，本来就知道nbnt认真打随手的，抱着随便打打nnn的态度打nbnt，但实际上还是太菜了。\n      本来以为nn8-9比nnn简单的，但现在看起来差不多的样子。\n      这次脸不错，所以实际上还是有点可惜。12阶和豪族习惯灵界过去导致nt时有点不适应。\n      因为我觉得nt就是nm，所以还是nc吧', '冰冻小伞', '2017-08-08 21:13', 'NBNT', '神灵庙'),
(13117589, '时隔一段时间，复健瞎打的产物。\r\nsabi撞非常多。\r\n假装是第一个lneta（跑）', '博丽燐梦', '2017-08-08 22:22', '低封', '地灵殿'),
(13131234, '东方地灵殿lunatic 机体萌A  机体时间12h\n一个究极谐的智障nb，录着看完一遍笑死我了\n放上来婊自己娱乐大众.jpg\n你群就剩我最菜了，但我就是打死也不回坑打船，再见', '两仪式™', '2017-08-09 04:25', 'NB', '地灵殿'),
(13143098, '全场最佳：射命丸文 &amp; 犬走椛\n（图转萌娘百科）\n游戏时长：5小时46分钟\n\nNM转NB的产物，确实比NM简单多了.jpg，不过NM打的东西NB全都没用，只能重新开荒了2333，第一把比发了的这把打的好多了(md\n\n致敬yu哥和荒芜(', '星色殘雪', '2017-08-09 15:02', 'NB', '风神录'),
(13210684, '1456面NN。\n肝NN糟的气的牙疼，\n肝到猴年马月。。\n唉。', '塑料胖次', '2017-08-11 01:05', 'NB', '绀珠传'),
(13264144, '封面P站=63340754\n这次是瓶姐姐的永幽冥lnb\n半灵控制的非常到位可以学习\nlsc全收了太强\n火蜥蜴笑疯，然后漂亮的收掉了玉枝\n瓶姐姐mua', 'W羽天', '2017-08-12 11:17', 'NB', '永夜抄'),
(13264207, '封面P站=64206671\n这次是书记的妖魔b lnb\n书记之前已经有梦b的nbnr，所以打其他机体nb应该不难\n前四面结界控的非常出色，最后的无限森罗看呆\n羽天再一次发动了奶rep的能力，详情请看莉莉卡一非\n书记要不要试试打妖全机nbnr啊？', 'W羽天', '2017-08-12 11:23', 'NB', '妖妖梦'),
(13277473, '封面P站=29578117\n这次是瓶姐姐的风梦cnb，太触了没啥好说的，各种miss也在常理之中（个鬼啦，六后半咋回事啦）\n最后的神德占了整个视频时间的6%，不愧是梦c\n瓶姐姐不考虑考虑打打风梦bnn吗）', 'W羽天', '2017-08-12 19:23', 'NB', '风神录'),
(13284659, '整局突出一个谐字\nmiss：毒蛾、魔2非、击月、黑兔1非、6道中非、3非、火蜥蜴、生命泉。\n最后致敬桜神的火蜥蜴龙珠(', 'Hakurei西柚子', '2017-08-12 22:53', 'NB', '永夜抄'),
(13335076, '机体：梦冬\n真给脸.jpg\n最后两张卡大家就当没看见.jpg', '露娜厨一号', '2017-08-14 04:15', 'NBNC', '天空璋'),
(13348183, 'http://replay.royalflare.net/replay2/th16_ud4487.rpy\nreplay http://replay.royalflare.net/replay2/th16_ud4487.rpy\n机体梦冬.\n这是一个恐怖的replay.\n恐怖在于它不是单6面练习3N, 而是一个3MNBNR实战录像, 最后满残ALL.\nmiss点为4面后半道中和5面boss战(一非和三符).\n\n这似乎意味着一群顶级触手3N已经势在必得了.\n\n机师Mino我并不认识（希望评论里有人能补充\n\n最后', '羽毛掺了铬II', '2017-08-14 15:27', 'NBNC', '天空璋'),
(13355390, '首先感谢羽天师傅帮忙录制\n诈尸投稿视屏，假的终焉\n一天不到打出来的，运气爆表了\n打完听说这是nnn最远距离？反正我已经没有闲暇来打nnn了\ned太好听了，所以录了一段放在P2，恕我不会日文不能把名字打出来，白……旅人，录的时候疯狂掉帧，希望没有影响音频\n祝各位好运，也祝我自己好运', 'Oblivion117', '2017-08-14 19:31', 'NBNC', '天空璋'),
(13374163, '运气好，一下就过了（打完后再试，被4，5面各种吊打）\n6面NNN龙珠（气炸）', 'kindx', '2017-08-15 04:25', 'NBNC', '天空璋'),
(13397109, '东方天空璋正式版lunatic难度NBNR，机体魔理沙秋。 显然打nbnr要在灵梦和魔理沙中选，冬很强春很弱所以梦冬显然强过魔春。魔冬应付不了5后半的阴阳玉阵，但是魔秋可以。并且由于45面boss又许多逼迫走位的弹幕，导致直线输出的时间很少，使得魔秋的火力比想象中要高很多，可以说是nbnr中十分强力的机体了（虽然瞎）。', '姬川的翡翠', '2017-08-15 19:23', 'NBNC', '天空璋'),
(13413165, '东方风神录LNM达成，所以说沉迷ssp无法自拔了啊我，连nm都咸鱼用弑神炮233333 魔b打nm其实很简单的，唯一难点在四面，还有就是细节操作比较多，扭力不需要太高（混关党都可以打得nm） 开荒一共8h，四发龙珠之后就出来了23333（醉挂好奶，以后打啥先找他奶一口orz）', '八雲的妖怪闲者', '2017-08-16 03:52', 'NM', '风神录'),
(13433275, '感谢麦师傅帮忙录制的视频，大概是15h的产物，欧皇局，搞人的地方都没搞我，纪念向视频，就这样吧。', 'Scarlet墨染樱', '2017-08-16 18:32', 'NBNT', '神灵庙'),
(13489393, '我的天空璋L难度低封通关，机体灵梦冬。和我的初通一样在笔记本上打在台式机上录的，所以收率显示为0/0。路线和混关一样，难度也没比混关提升多少', '411022', '2017-08-18 02:54', '低封', '天空璋'),
(13536367, '打了几天，道中还是不太熟，不过全程没有多少特别脸的东西，可能后期会写一写有关打法的文章，就这样~', '九条華恋', '2017-08-19 05:36', 'NBNC', '天空璋'),
(13536576, 'sabi一非guna sabi纯符guna 辣鸡游戏guna', 'kindx', '2017-08-19 08:20', 'NB', '绀珠传'),
(13598309, '糟\n下午一个2m晚上两个3m。。这游戏太玄学', 'kindx', '2017-08-20 21:26', 'NB', '绀珠传'),
(13612610, '在梦冬和魔秋之间来回打了将近30小时，终于妥协梦冬(\n撞了刀哥终符就憋了鼓气，四面撞飞更是没打算发了，结果五面NNN真是吓死我自己(\n话说车万的新作真是越来越带不动了\n录完压了好几遍发现压不动，只能这么大了，再小就马赛克了.jpg', '钦定级菜鸡IAH', '2017-08-21 04:22', 'NBNC', '天空璋'),
(13650818, 'miss点 神灵界 脸气.', '塑料胖次', '2017-08-22 03:20', 'NB', '绀珠传'),
(13671300, '12小时 东方踢楷子\n打完删游\n4面4miss\n5面2miss\n6面2miss\n四道中不会走\n五六面全部脸过\n没脸你打什么飞机.jpg\n（你本来就不该打飞机）', '打死露娜厨', '2017-08-22 17:52', 'NBNC', '天空璋'),
(13675518, 'miss点 123三非', '我选择俺不', '2017-08-22 20:04', 'NB', '绀珠传'),
(13752443, '自制 纪念向\n       几乎没有规划和背板，全是瞎扭的，视频里很容易就能看出来\n       入坑两年来的第一个Lneta，其实一年前我就想尝试打LNB，后来打了一段时间深感底力不足，于是在这一年期间我几乎没有挑战过全关，只要上游戏就打纯符，游戏时间150小时左右，纯符60小时（，这次妖LNB是正式开坑的第三把全关（包括续关）\n       身为咸鱼玩家，短期内应该不会打全关了，不如继续打单卡提升底力（', '完美潇洒的大爷', '2017-08-24 19:12', 'NB', '妖妖梦'),
(13774550, 'P1是真LNB。6残见黑死蝶0.6残见关底猫.jpg ，吓得我赶紧nn了后面。波粒上去睡了觉，爽到。见道中猫先自杀一次以示友好，核热第一波高能。\nP2节选自前几天的伪NB，5道中吓出1雷（全程残机没下过1，然后也是残3.6all的，表示不服所以重打了一个.jpg', '999只琪露诺', '2017-08-25 09:26', 'NB', '地灵殿'),
(13812633, '在天空璋发布两周之际，gob终于达成了LNNN的成就，于火紫、Yatsuzume其后位列第三。\n\n有趣的是，gob早在天空璋刚发售时就开始打NNN了，在火紫出货后肝得尤其凶(，接连吃了4、5发龙珠，被打成sabi。就在当晚Yats达成NNN之际，gob不知是眼红还是突然来了气势，怒开游戏一发NNN()。 可喜可贺，可喜可贺(\n\n最后附上萌豚gob的NNN感言()：天空璋LNNNできました！！！！！！！！！！！！！！！！！！！！！！！！！！！！！天使の３P！に感謝！！！！！！！！！！', '凋叶色', '2017-08-26 04:53', 'NMNBNC', '天空璋'),
(13814051, 'https://www.twitch.tv/videos/169669050\n守着他的直播看了好几天，还是没看到LNNN的时候\n按实况最后来看全关时间是33小时\nnnn进六还在不停口胡甚至哼歌\nYats的twitch：https://www.twitch.tv/yatsuzume', 'wasupandceacar', '2017-08-26 05:55', 'NMNBNC', '天空璋'),
(13834020, 'replay来自网络\n东方天空璋LNNN,机师Yats.\n实况:av13814051', '更衣小夜IX', '2017-08-26 19:34', 'NMNBNC', '天空璋'),
(13838216, 'rep：http://pan.baidu.com/s/1c2EQ244\n上高中了，已经没有时间打全关了', '克劳恩啤酒', '2017-08-26 21:49', 'NMNB', '风神录'),
(13848380, '封面id=64518300\n天空璋流程比前作安定不少，所以目前据说已经出了3个NNN了\n本视频供想尝试NR通关的同学参考', '克雷威尔', '2017-08-27 03:26', '低封', '天空璋'),
(13914792, '手动高亮:ssp使用\n花映塚疮四季了以后一怒之下打出来的东西\nnn局打糟了，哈哈哈哈哈哈哈.mp3\n第一次魔机收椛椛居然是在实战里\n所以说练习练个鬼\n六面道中那下是失误，移动幅度太大了\n别说了，就是菜\n四学霸你先女装我再打nn好不好，不然我没动力耶', '桃雨洛薰', '2017-08-28 19:21', 'NB', '风神录'),
(13977898, '封面P站=59995658，minust聚聚的小五\n恭喜瓶姐姐第五lnb，接下来就是船了\n太阳之前3m（好像是吧）这还是人吗赶紧打nn\n最后太阳全避注意，bgm变化注意\n突然觉得我当年殿nb残三啥都不是）', 'W羽天', '2017-08-30 10:46', 'NB', '地灵殿'),
(14074254, '残太多了，miss点都忘光了.jpg\n\nPID:39475775\n游戏时间：5小时54分钟\n\n正邪和两个四面应该都是会低P循环的，开荒城NB的同学稍微注意一下，残机虽然多但是1m可能带来的是直接疮痍(这次四面就打的挺不好的，后面非符直接各种打炮失败', '星色殘雪', '2017-09-01 23:04', 'NB', '辉针城'),
(14090987, '神灵界.jpg', '塑料胖次', '2017-09-02 14:03', 'NB', '绀珠传'),
(14091035, '脸好', '塑料胖次', '2017-09-02 13:58', 'NB', '辉针城'),
(14128410, 'PID:56935221\n\n地灵殿初NB，历时六个多月，游戏时间6-7个小时，匿粑粑还是有发气的嘛，蹭了一波直接NN六面，成为第二个NN的六面boss\n\n= =不对啊怎么突然又弄出来一个NB，是不是快没东西打了.jpg', '星色殘雪', '2017-09-03 14:39', 'NB', '地灵殿'),
(14148165, '没推几发就打出来了，不小心碰破了两个结界，不过得到残机和被弹的顺序是对的，就当是伪低封NBNR了吧\n致敬偶像泪世一？（\n顺便不管怎么弄，幽幽子一非刚开始的时候总会掉帧，就这一个地方真邪门', '假装看风景的矮穷挫', '2017-09-04 01:26', '低封NBNR', '妖妖梦'),
(14154849, '封面P站=63045922\n这次是发哥的庙nbnt\n随手碾出来的吧，（一看就打的没殿熟练），各种瞎扭救场，毕竟发哥太强了，（所以殿梦cnn....）\n可能是之前奇怪的东西撞的比较多，最后欧皇把十七条打成了 冰符[冰瀑 - easy]（我从来没见过这种十七条.jpg）\n发哥我错了，要不是我奶rep你这把应该龙珠的\n发哥我错了，要不是我奶rep你这把应该龙珠的\n发哥我错了，要不是我奶rep你这把应该龙珠的', 'W羽天', '2017-09-04 10:40', 'NBNT', '神灵庙'),
(14168515, 'https://www.twitch.tv/videos/162851042\nYats的twitch：https://www.twitch.tv/yatsuzume\n如Yats打到纯符时所说\nmake it happen', 'wasupandceacar', '2017-09-04 19:23', 'NMNB', '绀珠传'),
(14179722, '又菜又谐', '一条鹹魚', '2017-09-05 02:47', 'NB', '永夜抄'),
(14181260, 'https://www.twitch.tv/videos/144381535\nYats的twitch：https://www.twitch.tv/yatsuzume\n貌似Yats曾经NN到太阳键盘失灵而亡\n所以他对此作大概有着很大的心理阴影', 'wasupandceacar', '2017-09-05 08:17', 'NMNB', '地灵殿'),
(14190093, 'PID：30144962\n\n6残游戏究极难.jpg\n我第一次看到这么非的十七条（菜硬要怪脸黑.jpg）\n8LNB了，还剩天空璋和星莲船，加油加油', '星色殘雪', '2017-09-05 15:30', 'NBNT', '神灵庙'),
(14192020, 'https://www.twitch.tv/videos/105539355\nYats的twitch：https://www.twitch.tv/yatsuzume\n平稳的NN', 'wasupandceacar', '2017-09-05 16:34', 'NMNB', '风神录'),
(14209594, 'https://www.twitch.tv/videos/97306891\nYats的twitch：https://www.twitch.tv/yatsuzume\n这是一个只有700+蓝点的NNN', 'wasupandceacar', '2017-09-06 08:31', 'NMNBNR', '妖妖梦'),
(14209722, 'https://www.twitch.tv/videos/61802540\nYats的twitch：https://www.twitch.tv/yatsuzume\n星降极限击杀', 'wasupandceacar', '2017-09-06 08:48', 'NMNBNT', '神灵庙'),
(14238746, '我知道你们想看的不是这个，但是因为是先打的所以就先投出来（大雾', '星色夜樱', '2017-09-07 10:33', 'NBNC', '天空璋'),
(14241325, '*hint使用注意\n感谢大家的支持和鼓励（', '星色夜樱', '2017-09-07 12:26', 'NMNB', '地灵殿'),
(14267010, '東方星蓮船 Lunatic 满残 No Miss\n封面id54254047', 'Moandor', '2017-09-08 11:09', 'NM', '星莲船'),
(14300252, 'https://www.youtube.com/watch?v=gP0VzbxQseU\n于是这人昨天用灵梦秋打出了nnn\n秋比冬的6boss似乎好打了一些？\n然后这个终符，据说红色鳞弹是固定然后黄色是随机？', '幽U子', '2017-09-09 12:36', 'NMNBNC', '天空璋'),
(14320123, '辉针城LNB经历11.5小时的奋战总算通掉了，最大的感受就是道中比boss难，然后低P见boss接着糟，开荒过程中甚至被狼6杀成1P\n\n感谢伞师傅的NB路线指导\n\nMISS点：\n1面1符 水符1m\n3面后半道中1m\n3面1符 狼符1m\n4面道中2非1m\n4面3符 五线谱1m\n5面前半道中1m\n6面道中1m\n\n4残通，一共只有11残，可能是道中收点太差了吧', 'jokerlixin', '2017-09-09 23:04', 'NB', '辉针城'),
(14325502, '仅仅只是开打第一天，甚至只是想试水而已，没想到打几把就发了，仅仅NMNB进六面一次即拿下。 认识我的应该知道，这东西是我非常早期但最后弃掉的坑，那么现在可以说夙愿已了。 游戏过程基本都在掌控之中，但是偶尔也有非常棘手的情况。师匠的三非玩过的都懂，这次不走运来了好几波史诗级生成，钻成傻逼才活了。', 'アルマリア', '2017-09-10 02:19', 'NMNB', '永夜抄'),
(14409005, '来自青鼠师傅的船NB，1P是曦光他们的逗比解说，2P是青鼠本人的认真向解说，希望大家能够喜欢233\r\n250小时，15000次推把。2600次宝塔，1300次飞钵。猛男NN五面，欢迎收看！', '星色Jumbo', '2017-09-12 21:04', 'NB', '星莲船'),
(14416552, '我永远喜欢永夜超.jpg\n挺亲民的一作\n最气的是第一把，我忘记关SpoilerAL了，NN进4结果直接进2非，第二把，傻逼6残进6疮，龙玉3杀我，疮生命泉\n第三把也就是稿子这一把，龙玉继续双杀\n\n8个MISS点\n3面道中非\n4面前半道中\n4面后半道中（能用一个姿势撞道中小玉2次也只有我了）\n5面帝1非\n5面3符生神停止\n6面1符龙玉\n6面1符龙玉\n6面4符生命泉', 'jokerlixin', '2017-09-13 01:56', 'NB', '永夜抄'),
(14443049, '亲民永超亲民\n2个机体的LNB打出来了，别跟我提3前半道中，我不会我不会我不会！\n\n红魔组3miss\n3面后半道中\n3面1符137\n3面1符137 \n\n咏唱组7miss\n3面前半道中\n4面2符，梦想封印寂\n4面2符，梦想封印寂\n5面道中1非\n5面3符 生神停止\n6面开幕\n6面4符 生命泉', 'jokerlixin', '2017-09-14 03:01', 'NB', '永夜抄'),
(14450046, '1.rep转载自royalflare排行榜\n2.封面P站id=64896352；\n3.机师SOC，目前红魔乡世界纪录保持者，也是目前已知第一位打出红7亿的玩家，除此之外还打出过多作LNN(N)，包括红的全机体。最近正在奋斗1.5倍速的全作LNB，这个LNN估计是被樱fa神触钓过来随手一发打的；\n4.本rep并未完成全卡，5面道中选择全避2非拖掉了猫步，各种打法也较为安定，大概可供直线NB党参考；\n5.自此本作全机体的LNN已被人类（？攻略完毕，估计一些糟机的nn即将成为那些神触的玩物。。。', '夏花火', '2017-09-14 13:57', 'NMNB', '地灵殿'),
(14513848, '第一个正作LNB（\n终于晋级成LN党了（不对\n机体：梦秋，橡皮擦真好用.jpg，根本没怎么避弹的NB（\n你的风呢（被拖走\n时间10h46min（包括了开荒和初通的时间', '小大圣', '2017-09-16 16:54', 'NB', '天空璋'),
(14514388, '其实梦B并不在近期目标之内……只能说缘分到了233', '星色夜樱', '2017-09-16 16:59', 'NMNB', '地灵殿'),
(14583293, 'replay来自网络\n机师:Clio 十分精彩的刷分NMNB,全符卡收取', 'IV小夜', '2017-09-18 18:15', 'NMNB', '永夜抄'),
(14635077, 'P站上不去，太呆比了.jpg\n\n9LNB达成，船齐霸业开始.jpg', '星色殘雪', '2017-09-20 17:19', 'NBNC', '天空璋'),
(14685041, '东方天空璋梦秋LNB，避弹点仅有⑨，10个左右，主要依靠执行规划打到几乎全程碾压的效果。执行难度：秋c能混通L难度，对c一换一有一定了解即可。（没有看错，这比神灵庙NM还要低）\n机师：Yui~\n部分打法参考（主要是四五六面）：av14513848', 'TYSK秋', '2017-09-22 14:34', 'NB', '天空璋'),
(14730858, '想了想还是把这个东西扔上来吧（\n重新回忆复健第一发实战莫名其妙打出了这个NB.\n2个月没玩变成挂机升级了（\n\n当然复健效应还是很明显的（这个rep的miss次数我弄错了2次才数对（\n\n1面NN 2面NN 3面3M 4面NN 5面6M 6面NN\n这个阿燐怕不是闭着眼睛打出来的（反正呆逼撞居多\n\n我永远喜欢古明地觉.jpg\n她的子弹太亲民了！！！\n\n个人认为的看点\n4面前半道中 飞行虫 爆符\n\n这个3面和5面如果复习过得话 其实这个replay应该是个2MNB（\n说那么多，还是自己太菜（\n\n2p发糟', '羽毛掺了铬II', '2017-09-23 20:54', 'NB', '地灵殿'),
(14732204, '19小时，也算是比较长的了...\n上周无聊开了一把发了qwq', '塑料胖次', '2017-09-23 21:27', 'NBNC', '天空璋'),
(14755036, '首先还是恭喜mhbb打出妖lnm，据他自己说是练太久了结果直接碾出来了2333，快去打NMNB啦.jpg\n\n规划好像不是很一般哦，我解说不来啦就不口胡了，等mhbb铺一下弹幕吧~\n\n应mhbb的要求把bgm改成midi了，据说这是规划的一部分.jpg\n\n顺便，妖妖梦流程真是长，真不会睡着嘛？', '星色殘雪', '2017-09-24 15:21', 'NM', '妖妖梦'),
(14798366, '封面P站=59596109\n这次是威光师傅的庙lnm\n他自己说是能当成nm攻略的，然后也写了一份\n我就是先看了一遍rep，然后对照他的攻略进行了解说，同时在一些细节方面进行了补充，希望能有助于开荒庙的朋友们。\n羽天是第一次解说带规划性质rep，有解说不到位的地方还请各位师傅多包涵。', 'W羽天', '2017-09-25 22:53', 'NM', '神灵庙');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `lneta_info`
--
ALTER TABLE `lneta_info`
  ADD PRIMARY KEY (`av`,`work`);
--
-- Database: `osu`
--
CREATE DATABASE IF NOT EXISTS `osu` DEFAULT CHARACTER SET utf8 COLLATE utf8_general_ci;
USE `osu`;

-- --------------------------------------------------------

--
-- 表的结构 `osu_High_pps`
--

CREATE TABLE `osu_High_pps` (
  `bid` int(20) NOT NULL,
  `uid` int(20) NOT NULL,
  `user` varchar(50) NOT NULL,
  `pp` float NOT NULL,
  `map_info` varchar(300) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `osu_High_pps`
--

INSERT INTO `osu_High_pps` (`bid`, `uid`, `user`, `pp`, `map_info`) VALUES
(129891, 124493, 'Cookiezi', 799.793, 'xi - FREEDOM DiVE [FOUR DIMENSIONS] +HD,HR (99.83%)'),
(328472, 2558286, 'Rafis', 614.504, 'Fujijo Seitokai Shikkou-bu - Best FriendS -TV Size- [Fycho\'s Insane] +HD,HR,DT (99.15%)'),
(328472, 2831793, 'filsdelama', 625.057, 'Fujijo Seitokai Shikkou-bu - Best FriendS -TV Size- [Fycho\'s Insane] +HD,HR,DT (99.36%)'),
(422328, 4787150, 'Vaxei', 638.253, 'Maffalda - pensamento tipico de esquerda caviar [Gangsta] +HD,DT (98.15%)'),
(516322, 2831793, 'filsdelama', 615.485, 'Sana - Byoumei Koiwazurai [Lovesick] +HD,HR,DT (97.29%)'),
(544850, 1777162, 'firebat92', 626.749, 'Matsumoto Sara - Suika [Evanescence] +DT (99.59%)'),
(555797, 124493, 'Cookiezi', 649.169, 'UNDEAD CORPORATION - Everything will freeze [Time Freeze] (98.66%)'),
(574471, 27055, 'Astar', 605.221, 'Fujijo Seitokai Shikkou-bu - Best FriendS [Insane] +HD,HR,DT (97.95%)'),
(574471, 2558286, 'Rafis', 719.857, 'Fujijo Seitokai Shikkou-bu - Best FriendS [Insane] +HD,HR,DT (99.06%)'),
(574471, 2831793, 'filsdelama', 719.857, 'Fujijo Seitokai Shikkou-bu - Best FriendS [Insane] +HD,HR,DT (99.06%)'),
(574471, 4787150, 'Vaxei', 650.117, 'Fujijo Seitokai Shikkou-bu - Best FriendS [Insane] +HD,HR,DT (97.80%)'),
(642687, 50265, 'hvick225', 621.853, 'Mitsuki Kotono - Fuyu ni Saku Hana [Sanctuary] +HD,DT (99.70%)'),
(642687, 2558286, 'Rafis', 609.189, 'Mitsuki Kotono - Fuyu ni Saku Hana [Sanctuary] +HD,DT (99.41%)'),
(642687, 2562987, 'osu player84', 603.318, 'Mitsuki Kotono - Fuyu ni Saku Hana [Sanctuary] +HD,DT (99.26%)'),
(657917, 124493, 'Cookiezi', 634.471, 'xi - Blue Zenith [ktgster\'s Extreme] +HD,HR (99.27%)'),
(657917, 1419095, 'bro_gamer72', 618.071, 'xi - Blue Zenith [ktgster\'s Extreme] +HD,HR (98.94%)'),
(657917, 1883865, 'Yaong', 602.725, 'xi - Blue Zenith [ktgster\'s Extreme] +HR (99.38%)'),
(657917, 3043603, 'kablaze', 604.672, 'xi - Blue Zenith [ktgster\'s Extreme] +HD,HR (98.64%)'),
(658127, 124493, 'Cookiezi', 727.442, 'xi - Blue Zenith [FOUR DIMENSIONS] +HR (99.71%)'),
(658127, 1883865, 'Yaong', 706.872, 'xi - Blue Zenith [FOUR DIMENSIONS] +HR (98.82%)'),
(658127, 4650315, 'idke', 612.986, 'xi - Blue Zenith [FOUR DIMENSIONS] +HR (97.22%)'),
(665787, 124493, 'Cookiezi', 631.295, 'BLOOD STAIN CHILD - MOON LIGHT WAVE [Effulgence] +HD,HR (99.91%)'),
(668662, 2757689, 'Toy', 604.573, 'Yooh - Ice Angel [Saint] +HD,HR (99.47%)'),
(668662, 3219026, 'Rohulk', 604.573, 'Yooh - Ice Angel [Saint] +HD,HR (99.47%)'),
(680394, 652457, '_index', 607.59, 'DragonForce - The Last Journey Home [Legend] +HR (98.14%)'),
(696225, 50265, 'hvick225', 663.33, 'HoneyWorks - Miraizu feat.Aida Miou(CV:Toyosaki Aki) [Special] +HD,DT (98.73%)'),
(696225, 1419095, 'bro_gamer72', 635.256, 'HoneyWorks - Miraizu feat.Aida Miou(CV:Toyosaki Aki) [Special] +HD,DT (99.17%)'),
(696225, 2558286, 'Rafis', 646.805, 'HoneyWorks - Miraizu feat.Aida Miou(CV:Toyosaki Aki) [Special] +HD,DT (99.46%)'),
(696225, 4407567, 'Wookiezi', 615.321, 'HoneyWorks - Miraizu feat.Aida Miou(CV:Toyosaki Aki) [Special] +HD,DT (98.98%)'),
(696225, 4787150, 'Vaxei', 640.128, 'HoneyWorks - Miraizu feat.Aida Miou(CV:Toyosaki Aki) [Special] +HD,DT (98.78%)'),
(718156, 39828, 'WubWoofWolf', 669.143, 'DragonForce - Defenders [Legend] +HR (98.46%)'),
(718156, 124493, 'Cookiezi', 718.423, 'DragonForce - Defenders [Legend] +HD,HR (98.64%)'),
(718156, 613592, 'Adamqs', 664.021, 'DragonForce - Defenders [Legend] +HD,HR (97.96%)'),
(718156, 1883865, 'Yaong', 639.291, 'DragonForce - Defenders [Legend] +HR (99.45%)'),
(718156, 4650315, 'idke', 665.63, 'DragonForce - Defenders [Legend] +HR (98.75%)'),
(725718, 124493, 'Cookiezi', 687.494, 'Seiryu - BLUE DRAGON [Blue Dragon] +HD,HR (99.78%)'),
(736215, 124493, 'Cookiezi', 699.839, 'Panda Eyes & Teminite - Highscore [Game Over] +HD,HR (99.60%)'),
(741467, 124493, 'Cookiezi', 632.895, 'Zeami feat. Ayane - Senpuu no Mai [Fly Senpuu] +HD,DT (96.38%)'),
(772476, 2558286, 'Rafis', 630.505, 'SoundTeMP - Dreamer\'s Dream [PRESSURE] +HD,HR,DT (96.89%)'),
(772476, 2831793, 'filsdelama', 682.425, 'SoundTeMP - Dreamer\'s Dream [PRESSURE] +HD,HR,DT (98.25%)'),
(774965, 50265, 'hvick225', 645.759, 'kradness&Reol - Remote Control [Max Control!] +HD,DT (98.72%)'),
(774965, 124493, 'Cookiezi', 817.164, 'kradness&Reol - Remote Control [Max Control!] +HD,DT (99.55%)'),
(774965, 227717, 'rustbell', 608.15, 'kradness&Reol - Remote Control [Max Control!] +HD,DT (98.07%)'),
(774965, 256802, 'HappyStick', 613.078, 'kradness&Reol - Remote Control [Max Control!] +DT (96.52%)'),
(774965, 652457, '_index', 665.219, 'kradness&Reol - Remote Control [Max Control!] +DT (98.66%)'),
(774965, 718454, 'ThePooN', 622.029, 'kradness&Reol - Remote Control [Max Control!] +DT (96.93%)'),
(774965, 754565, 'Dustice', 716.501, 'kradness&Reol - Remote Control [Max Control!] +HD,DT (98.15%)'),
(774965, 1777162, 'firebat92', 626.065, 'kradness&Reol - Remote Control [Max Control!] +DT (98.95%)'),
(774965, 2558286, 'Rafis', 606.764, 'kradness&Reol - Remote Control [Max Control!] +HD,DT (98.44%)'),
(774965, 2831793, 'filsdelama', 655.89, 'kradness&Reol - Remote Control [Max Control!] +DT (99.29%)'),
(774965, 4787150, 'Vaxei', 813.483, 'kradness&Reol - Remote Control [Max Control!] +HD,DT (99.49%)'),
(774965, 5182050, 'Bubbleman', 660.668, 'kradness&Reol - Remote Control [Max Control!] +HD,DT (98.32%)'),
(774965, 5339515, 'Mathi', 600.557, 'kradness&Reol - Remote Control [Max Control!] +HD,DT (98.29%)'),
(774965, 6304246, '_RyuK', 704.261, 'kradness&Reol - Remote Control [Max Control!] +HD,DT (97.76%)'),
(777055, 2558286, 'Rafis', 606.041, 'YuugouP - YELLOW TRICK [oko\'s Extra] +HD,DT (99.15%)'),
(782160, 2558286, 'Rafis', 675.639, '*namirin - Sakurairo Time Capsule [Petal] +HD,DT (99.22%)'),
(785097, 50265, 'hvick225', 621.369, 'Kano - Stella-rium [Starlight] +HD,DT (98.65%)'),
(785097, 124493, 'Cookiezi', 621.886, 'Kano - Stella-rium [Starlight] +HD,DT (98.16%)'),
(785097, 1777162, 'firebat92', 616.776, 'Kano - Stella-rium [Starlight] +HD,DT (98.22%)'),
(785097, 2558286, 'Rafis', 657.879, 'Kano - Stella-rium [Starlight] +HD,DT (99.04%)'),
(785097, 4787150, 'Vaxei', 624.526, 'Kano - Stella-rium [Starlight] +HD,DT (98.74%)'),
(790048, 124493, 'Cookiezi', 664.095, 'Konuko - Toumei Elegy [Skystar\'s Tragic Love Extra] +HD,HR (99.75%)'),
(790415, 50265, 'hvick225', 710.869, 'TRUE - DREAM SOLISTER [Melody] +HD,DT (99.14%)'),
(790415, 124493, 'Cookiezi', 685.645, 'TRUE - DREAM SOLISTER [Melody] +HD,DT (98.51%)'),
(790415, 652457, '_index', 627.221, 'TRUE - DREAM SOLISTER [Melody] +DT (98.74%)'),
(790415, 2558286, 'Rafis', 708.072, 'TRUE - DREAM SOLISTER [Melody] +HD,DT (99.03%)'),
(790415, 2831793, 'filsdelama', 683.067, 'TRUE - DREAM SOLISTER [Melody] +DT (99.83%)'),
(791274, 124493, 'Cookiezi', 693.135, 'goreshit - burn this moment into the retina of my eye [extra] +HD,HR (99.88%)'),
(794670, 2558286, 'Rafis', 671.658, 'Agnete Kjolsrud - Get Jinxed [Master] +HD,DT (99.56%)'),
(794670, 2735250, 'Moffo', 619.393, 'Agnete Kjolsrud - Get Jinxed [Master] +HD,DT (97.28%)'),
(794670, 4787150, 'Vaxei', 672.5, 'Agnete Kjolsrud - Get Jinxed [Master] +HD,DT (99.04%)'),
(794670, 5339515, 'Mathi', 624.652, 'Agnete Kjolsrud - Get Jinxed [Master] +HD,DT (99.04%)'),
(794670, 6304246, '_RyuK', 682.447, 'Agnete Kjolsrud - Get Jinxed [Master] +HD,DT (98.82%)'),
(795627, 124493, 'Cookiezi', 775.699, 'HoneyWorks - Akatsuki Zukuyo [Taeyang\'s Extra] +HD,DT (95.81%)'),
(795627, 2558286, 'Rafis', 710.699, 'HoneyWorks - Akatsuki Zukuyo [Taeyang\'s Extra] +HD,DT (97.19%)'),
(795627, 4787150, 'Vaxei', 686.563, 'HoneyWorks - Akatsuki Zukuyo [Taeyang\'s Extra] +HD,DT (97.04%)'),
(795988, 50265, 'hvick225', 610.137, 'Horie Yui - Asymmetry [Flourite\'s Kiss] +HD,DT (99.81%)'),
(795988, 124493, 'Cookiezi', 602.984, 'Horie Yui - Asymmetry [Flourite\'s Kiss] +HD,DT (99.62%)'),
(804164, 124493, 'Cookiezi', 691.323, 'Reol - MONSTER [FOREVER] +HD,DT (96.84%)'),
(804164, 1777162, 'firebat92', 612.922, 'Reol - MONSTER [FOREVER] +DT (98.50%)'),
(804411, 2558286, 'Rafis', 609.02, 'Yamazaki Haruka, Tadokoro Azusa, Machico - Dreaming! [Startrick\'s H@ppiness] +HD,DT (99.83%)'),
(807074, 2558286, 'Rafis', 636.853, 'xi - Ascension to Heaven [Final Moment] (98.98%)'),
(808848, 1777162, 'firebat92', 638.34, 'WEAVER - Kuchizuke Diamond [Lemur] +HD,HR,DT (98.16%)'),
(808848, 2614511, 'Axarious', 695.206, 'WEAVER - Kuchizuke Diamond [Lemur] +HD,HR,DT (93.62%)'),
(812590, 2558286, 'Rafis', 599.854, 'supercell - My Dearest (TV Edit) [Guilt] +HD,HR,DT (97.10%)'),
(812590, 2831793, 'filsdelama', 639.496, 'supercell - My Dearest (TV Edit) [Guilt] +HD,HR,DT (95.89%)'),
(812590, 4787150, 'Vaxei', 647.112, 'supercell - My Dearest (TV Edit) [Guilt] +HD,HR,DT (96.23%)'),
(814293, 2614511, 'Axarious', 607.56, 'Station Earth - Cold Green Eyes ft. Roos Denayer [Divine] +HD,HR,DT (95.79%)'),
(816327, 124493, 'Cookiezi', 663.382, 'Wagakki Band - Tengaku [Uncompressed Fury of a Raging Japanese God] +HD (97.81%)'),
(816600, 1777162, 'firebat92', 607.028, 'Ni-Sokkususu - Blade Dance [Kneesocks] +HD,DT (96.88%)'),
(816600, 2003326, 'Emilia', 707.009, 'Ni-Sokkususu - Blade Dance [Kneesocks] +HD,DT (94.47%)'),
(816600, 2558286, 'Rafis', 637.359, 'Ni-Sokkususu - Blade Dance [Kneesocks] +HD,DT (97.44%)'),
(816600, 2562987, 'osu player84', 656.942, 'Ni-Sokkususu - Blade Dance [Kneesocks] +HD,DT (97.84%)'),
(816600, 4787150, 'Vaxei', 636.491, 'Ni-Sokkususu - Blade Dance [Kneesocks] +HD,DT (97.36%)'),
(821548, 124493, 'Cookiezi', 639.39, 'nanobii - rainbow road [Eun & Irvin\'s Rainbow] +HD,DT (99.42%)'),
(827488, 50265, 'hvick225', 682.686, 'Hana - Sakura no Uta [Euphoria] +HD,DT (99.44%)'),
(827488, 1777162, 'firebat92', 649.71, 'Hana - Sakura no Uta [Euphoria] +HD,DT (99.12%)'),
(827488, 4787150, 'Vaxei', 632.495, 'Hana - Sakura no Uta [Euphoria] +HD,DT (99.28%)'),
(843155, 50265, 'hvick225', 658.043, 'Kano - Stella-rium [Pleiades] +HD,DT (99.32%)'),
(843155, 124493, 'Cookiezi', 609.145, 'Kano - Stella-rium [Pleiades] +HD,DT (97.61%)'),
(843155, 1777162, 'firebat92', 640.461, 'Kano - Stella-rium [Pleiades] +HD,DT (98.81%)'),
(843155, 2558286, 'Rafis', 644.262, 'Kano - Stella-rium [Pleiades] +HD,DT (98.98%)'),
(848345, 1777162, 'firebat92', 619.371, 'Primary - Sweets Weekend [Sweet Neko] +HD,DT (99.83%)'),
(848345, 2558286, 'Rafis', 610.469, 'Primary - Sweets Weekend [Sweet Neko] +HD,DT (99.66%)'),
(848345, 6304246, '_RyuK', 610.469, 'Primary - Sweets Weekend [Sweet Neko] +HD,DT (99.66%)'),
(848994, 50265, 'hvick225', 644.231, 'CINDERELLA PROJECT - M@GIC* [M@gic] +HD,DT (98.75%)'),
(848994, 2558286, 'Rafis', 613.744, 'CINDERELLA PROJECT - M@GIC* [M@gic] +HD,DT (98.52%)'),
(851255, 124493, 'Cookiezi', 604.266, 'Primary - Inai Sekai [Kimi ni Todoku Ka Na?] +HD,HR (99.10%)'),
(858271, 124493, 'Cookiezi', 631.539, 'Hagumi Nishizawa - My Hero! Up to you! [My Hero!] +HD,DT (97.67%)'),
(858271, 2291265, 'Arnold24x24', 626.017, 'Hagumi Nishizawa - My Hero! Up to you! [My Hero!] +HD,DT (97.52%)'),
(858271, 2831793, 'filsdelama', 624.374, 'Hagumi Nishizawa - My Hero! Up to you! [My Hero!] +DT (99.53%)'),
(858271, 5182050, 'Bubbleman', 647.366, 'Hagumi Nishizawa - My Hero! Up to you! [My Hero!] +HD,DT (98.26%)'),
(869222, 124493, 'Cookiezi', 653.183, 'BABYMETAL - Road of Resistance [Rebellion] +HR (98.45%)'),
(869222, 2558286, 'Rafis', 612.53, 'BABYMETAL - Road of Resistance [Rebellion] (99.21%)'),
(869222, 4650315, 'idke', 633.019, 'BABYMETAL - Road of Resistance [Rebellion] (99.77%)'),
(875761, 2558286, 'Rafis', 631.242, 'ClariS - CLICK(Soleily Remix) [Niseclick] +HD,DT (99.94%)'),
(877625, 2831793, 'filsdelama', 612.85, 'Tarpey - Close Call [Near Miss] +HD,HR,DT (98.53%)'),
(878963, 50265, 'hvick225', 624.911, 'Machico - fantastic dreamer [Blessing] +HD,DT (99.50%)'),
(878963, 2558286, 'Rafis', 624.143, 'Machico - fantastic dreamer [Blessing] +HD,DT (99.50%)'),
(880321, 124493, 'Cookiezi', 634.444, 'sana - Packet Hero [Ruthless] +HD,HR (99.05%)'),
(888010, 3219026, 'Rohulk', 600.123, 'Sleeping With Sirens - If You Can\'t Hang [Bearizm\'s Extreme] +HD,HR (99.70%)'),
(889729, 124493, 'Cookiezi', 628.627, 'S3RL feat Mixie Moon - FriendZoned [Slayed\'s Extreme] +HD,DT (99.75%)'),
(889729, 1777162, 'firebat92', 601.834, 'S3RL feat Mixie Moon - FriendZoned [Slayed\'s Extreme] +HD,DT (99.25%)'),
(890190, 124493, 'Cookiezi', 676.333, 'Imperial Circus Dead Decadence - Uta [Himei] +HD (99.64%)'),
(890190, 256802, 'HappyStick', 607.116, 'Imperial Circus Dead Decadence - Uta [Himei] (99.28%)'),
(890190, 718454, 'ThePooN', 626.732, 'Imperial Circus Dead Decadence - Uta [Himei] (99.74%)'),
(890190, 754565, 'Dustice', 615.447, 'Imperial Circus Dead Decadence - Uta [Himei] (99.48%)'),
(890190, 903978, 'waaiiru', 603.427, 'Imperial Circus Dead Decadence - Uta [Himei] (99.18%)'),
(890190, 1777162, 'firebat92', 604.664, 'Imperial Circus Dead Decadence - Uta [Himei] (99.22%)'),
(890190, 2204373, 'Spare', 607.606, 'Imperial Circus Dead Decadence - Uta [Himei] (99.65%)'),
(890190, 3043603, 'kablaze', 618.063, 'Imperial Circus Dead Decadence - Uta [Himei] (99.55%)'),
(890190, 3179601, 'Tarulas', 610.376, 'Imperial Circus Dead Decadence - Uta [Himei] (99.36%)'),
(890190, 3533958, 'fieryrage', 615.483, 'Imperial Circus Dead Decadence - Uta [Himei] (99.49%)'),
(890190, 4650315, 'idke', 624.259, 'Imperial Circus Dead Decadence - Uta [Himei] (99.68%)'),
(890467, 50265, 'hvick225', 640.932, 'sana - Miraizu [Forever] +HD,DT (98.21%)'),
(894189, 124493, 'Cookiezi', 654.413, 'Yousei Teikoku - Torikago [Extra] +HD,DT (99.27%)'),
(894189, 1777162, 'firebat92', 654.644, 'Yousei Teikoku - Torikago [Extra] +HD,DT (99.27%)'),
(894189, 5182050, 'Bubbleman', 617.137, 'Yousei Teikoku - Torikago [Extra] +HD,DT (99.30%)'),
(895275, 2831793, 'filsdelama', 679.226, 'Petit Rabbit\'s - Takarabako no Jet Coaster [Jet Coaster] +HD,HR,DT (99.09%)'),
(898577, 2558286, 'Rafis', 657.952, 'fhana - Kimi to Iu Tokuiten [singular you] [Melancholy] +HD,DT (99.56%)'),
(901854, 124493, 'Cookiezi', 667.831, 'Remo Prototype[CV: Hanamori Yumiri] - Sendan Life [Nostalgia] +HD,HR (99.85%)'),
(901854, 754565, 'Dustice', 612.971, 'Remo Prototype[CV: Hanamori Yumiri] - Sendan Life [Nostalgia] +HD,HR (99.74%)'),
(901854, 2831793, 'filsdelama', 600.24, 'Remo Prototype[CV: Hanamori Yumiri] - Sendan Life [Nostalgia] +HR (99.85%)'),
(901854, 4787150, 'Vaxei', 632.184, 'Remo Prototype[CV: Hanamori Yumiri] - Sendan Life [Nostalgia] +HD,HR (99.18%)'),
(907850, 124493, 'Cookiezi', 637.696, 'Ito Kanako - Skyclad no Kansokusha [Time Travel] +HD,DT (98.56%)'),
(907850, 2558286, 'Rafis', 670.002, 'Ito Kanako - Skyclad no Kansokusha [Time Travel] +HD,DT (99.28%)'),
(907850, 4787150, 'Vaxei', 672.708, 'Ito Kanako - Skyclad no Kansokusha [Time Travel] +HD,DT (99.34%)'),
(908042, 3219026, 'Rohulk', 602.219, 'DragonForce - Above the Winter Moonlight [Freedom] +HD,HR (99.70%)'),
(915210, 1777162, 'firebat92', 641.25, 'dj TAKA - quaver [Crescendo] +HD,HR (99.38%)'),
(915210, 3043603, 'kablaze', 699.951, 'dj TAKA - quaver [Crescendo] +HD,HR (99.77%)'),
(915210, 3478883, 'Pring', 616.73, 'dj TAKA - quaver [Crescendo] +HR (99.55%)'),
(941197, 2558286, 'Rafis', 624.896, 'Suzuki Konomi - Redo [Extra] +HD,DT (99.24%)'),
(946685, 2831793, 'filsdelama', 638.696, 'Petit Rabbit\'s - Takarabako no Jet Coaster [Fleur de Lapin] +HD,HR,DT (98.56%)'),
(948389, 2558286, 'Rafis', 635.149, 'EVO+ - [A]ddiction [Vert\'s Expert] +HD,DT (99.42%)'),
(949011, 1777162, 'firebat92', 611.628, 'Chino(CV.Minase Inori) - Shinsaku no Shiawase wa Kochira! [Dan Dan] +HD,DT (99.05%)'),
(949011, 2558286, 'Rafis', 612.854, 'Chino(CV.Minase Inori) - Shinsaku no Shiawase wa Kochira! [Dan Dan] +HD,DT (99.08%)'),
(949011, 2562987, 'osu player84', 629.231, 'Chino(CV.Minase Inori) - Shinsaku no Shiawase wa Kochira! [Dan Dan] +HD,DT (99.47%)'),
(949011, 4183454, '-Zirba-', 613.417, 'Chino(CV.Minase Inori) - Shinsaku no Shiawase wa Kochira! [Dan Dan] +HD,DT (99.08%)'),
(949011, 4787150, 'Vaxei', 623.727, 'Chino(CV.Minase Inori) - Shinsaku no Shiawase wa Kochira! [Dan Dan] +HD,DT (99.34%)'),
(949029, 1777162, 'firebat92', 706.929, 'LiSA - Kimi ni Pierrot [Emotions] +HD,DT (98.03%)'),
(949029, 4787150, 'Vaxei', 635.147, 'LiSA - Kimi ni Pierrot [Emotions] +HD,DT (98.06%)'),
(951053, 1777162, 'firebat92', 677.975, 'TrySail - High Free Spirits -TV.Ver- [StarR\'s Extra] +DT (98.55%)'),
(951053, 2003326, 'Emilia', 673.491, 'TrySail - High Free Spirits -TV.Ver- [StarR\'s Extra] +HD,DT (96.03%)'),
(951053, 2562987, 'osu player84', 647.94, 'TrySail - High Free Spirits -TV.Ver- [StarR\'s Extra] +HD,DT (97.65%)'),
(951053, 4787150, 'Vaxei', 668.303, 'TrySail - High Free Spirits -TV.Ver- [StarR\'s Extra] +HD,DT (97.74%)'),
(953586, 50265, 'hvick225', 643.206, 'Chino(CV.Minase Inori) - Shinsaku no Shiawase wa Kochira! [Happy~!] +HD,DT (98.93%)'),
(953586, 606544, 'My Angel Haruna', 622.114, 'Chino(CV.Minase Inori) - Shinsaku no Shiawase wa Kochira! [Happy~!] +DT (98.62%)'),
(953586, 652457, '_index', 613.222, 'Chino(CV.Minase Inori) - Shinsaku no Shiawase wa Kochira! [Happy~!] +DT (98.37%)'),
(953586, 1777162, 'firebat92', 730.488, 'Chino(CV.Minase Inori) - Shinsaku no Shiawase wa Kochira! [Happy~!] +HD,DT (99.50%)'),
(953586, 2558286, 'Rafis', 730.488, 'Chino(CV.Minase Inori) - Shinsaku no Shiawase wa Kochira! [Happy~!] +HD,DT (99.50%)'),
(953586, 3069354, 'DanyL', 646.7, 'Chino(CV.Minase Inori) - Shinsaku no Shiawase wa Kochira! [Happy~!] +HD,DT (96.48%)'),
(953586, 4787150, 'Vaxei', 714.798, 'Chino(CV.Minase Inori) - Shinsaku no Shiawase wa Kochira! [Happy~!] +HD,DT (99.12%)'),
(954692, 2003326, 'Emilia', 744.152, 'HO-KAGO TEA TIME - Kira Kira Days [Shiawase!!] +HD,DT (99.10%)'),
(954692, 3205678, 'EbonSol', 614.732, 'HO-KAGO TEA TIME - Kira Kira Days [Shiawase!!] +HD,DT (83.42%)'),
(954692, 4787150, 'Vaxei', 729.802, 'HO-KAGO TEA TIME - Kira Kira Days [Shiawase!!] +HD,DT (98.03%)'),
(954692, 8482062, 'freedomdiver', 660.354, 'HO-KAGO TEA TIME - Kira Kira Days [Shiawase!!] +HD,NC (93.08%)'),
(962194, 1883865, 'Yaong', 639.188, 'DragonForce - Soldiers of the Wasteland [Legend] (99.81%)'),
(965243, 39828, 'WubWoofWolf', 645.558, 'DragonForce - Seasons [Legend] +HD,HR (98.93%)'),
(965243, 124493, 'Cookiezi', 697.605, 'DragonForce - Seasons [Legend] +HD,HR (99.26%)'),
(968065, 124493, 'Cookiezi', 654.679, 'Syaro(CV.Uchida Maaya) - Caffeine Fighter [Kilimanjaro] +HD,HR,DT (99.14%)'),
(968065, 1777162, 'firebat92', 611.907, 'Syaro(CV.Uchida Maaya) - Caffeine Fighter [Kilimanjaro] +HD,HR,DT (96.20%)'),
(968065, 2558286, 'Rafis', 705.308, 'Syaro(CV.Uchida Maaya) - Caffeine Fighter [Kilimanjaro] +HD,HR,DT (98.64%)'),
(968065, 2831793, 'filsdelama', 686.628, 'Syaro(CV.Uchida Maaya) - Caffeine Fighter [Kilimanjaro] +HD,HR,DT (98.28%)'),
(969681, 1777162, 'firebat92', 703.834, 'Nanamori-chu*Gorakubu - Acchu~ma Seishun! [Fycho\'s Seishun] +HD,DT (99.17%)'),
(969681, 2003326, 'Emilia', 606.526, 'Nanamori-chu*Gorakubu - Acchu~ma Seishun! [Fycho\'s Seishun] +HD,DT (94.43%)'),
(969681, 2558286, 'Rafis', 673.119, 'Nanamori-chu*Gorakubu - Acchu~ma Seishun! [Fycho\'s Seishun] +HD,DT (98.93%)'),
(969681, 3876402, 'FlySlime', 599.745, 'Nanamori-chu*Gorakubu - Acchu~ma Seishun! [Fycho\'s Seishun] +HD,DT (95.96%)'),
(969681, 4787150, 'Vaxei', 675.343, 'Nanamori-chu*Gorakubu - Acchu~ma Seishun! [Fycho\'s Seishun] +HD,DT (98.35%)'),
(970048, 124493, 'Cookiezi', 702.181, 'BABYMETAL - Gimme chocolate!! [BLACK CHOCOLATE!!] +HD,HR (99.59%)'),
(970048, 4650315, 'idke', 609.722, 'BABYMETAL - Gimme chocolate!! [BLACK CHOCOLATE!!] +HR (98.72%)'),
(970048, 4852013, 'Monko2k', 610.91, 'BABYMETAL - Gimme chocolate!! [BLACK CHOCOLATE!!] +HR (99.71%)'),
(974854, 124493, 'Cookiezi', 616.142, 'Jun Maeda x yanaginagi - Killer Song [Edge] +HD,DT (100.00%)'),
(974854, 2204373, 'Spare', 601.607, 'Jun Maeda x yanaginagi - Killer Song [Edge] +HD,DT (99.71%)'),
(974854, 2558286, 'Rafis', 605.111, 'Jun Maeda x yanaginagi - Killer Song [Edge] +HD,DT (99.78%)'),
(977770, 124493, 'Cookiezi', 630.273, 'Kano - Yuudachi no Ribbon [Extreme] +HD,HR (99.76%)'),
(978382, 1777162, 'firebat92', 617.078, 'TWICE - CHEER UP [SHASHASHA] +HD,DT (99.65%)'),
(978382, 2558286, 'Rafis', 620.835, 'TWICE - CHEER UP [SHASHASHA] +HD,DT (99.74%)'),
(978382, 2562987, 'osu player84', 629.917, 'TWICE - CHEER UP [SHASHASHA] +HD,DT (99.91%)'),
(980431, 124493, 'Cookiezi', 652.834, 'TrySail - High Free Spirits -TV.Ver- [Skystar\'s Extra] +HD,DT (93.87%)'),
(980431, 1777162, 'firebat92', 620.297, 'TrySail - High Free Spirits -TV.Ver- [Skystar\'s Extra] +DT (97.12%)'),
(980431, 3069354, 'DanyL', 691.701, 'TrySail - High Free Spirits -TV.Ver- [Skystar\'s Extra] +HD,DT (96.79%)'),
(980431, 4787150, 'Vaxei', 746.393, 'TrySail - High Free Spirits -TV.Ver- [Skystar\'s Extra] +HD,DT (98.82%)'),
(983680, 1777162, 'firebat92', 696.873, 'Ayase Rie - Yuima-ru*World TVver. [Extra] +HD,HR,DT (98.88%)'),
(983680, 2558286, 'Rafis', 712.674, 'Ayase Rie - Yuima-ru*World TVver. [Extra] +HD,HR,DT (99.25%)'),
(983680, 2831793, 'filsdelama', 670.868, 'Ayase Rie - Yuima-ru*World TVver. [Extra] +HD,HR,DT (98.13%)'),
(983680, 4787150, 'Vaxei', 636.582, 'Ayase Rie - Yuima-ru*World TVver. [Extra] +HD,HR,DT (97.00%)'),
(985141, 39828, 'WubWoofWolf', 670.536, 'DragonForce - Symphony of the Night [Legend] +HD,HR (99.17%)'),
(985141, 251683, 'Musty', 619.944, 'DragonForce - Symphony of the Night [Legend] +HR (98.86%)'),
(985141, 1883865, 'Yaong', 645.769, 'DragonForce - Symphony of the Night [Legend] +HR (99.36%)'),
(985141, 4787150, 'Vaxei', 600.165, 'DragonForce - Symphony of the Night [Legend] +HR (98.41%)'),
(988793, 124493, 'Cookiezi', 603.079, 'nameless - SLoWMoTIoN [LoLIS] +HD,DT (99.67%)'),
(988793, 1419095, 'bro_gamer72', 603.764, 'nameless - SLoWMoTIoN [LoLIS] +HD,DT (99.68%)'),
(994495, 124493, 'Cookiezi', 657.986, 'Ayase Rie - Yuima-ru*World TVver. [Ultimate] +HD,DT (96.50%)'),
(994495, 1777162, 'firebat92', 614.249, 'Ayase Rie - Yuima-ru*World TVver. [Ultimate] +DT (96.33%)'),
(994495, 2003326, 'Emilia', 688.436, 'Ayase Rie - Yuima-ru*World TVver. [Ultimate] +HD,NC (97.50%)'),
(994495, 3205678, 'EbonSol', 628.477, 'Ayase Rie - Yuima-ru*World TVver. [Ultimate] +HD,DT (86.08%)'),
(994495, 4787150, 'Vaxei', 619.126, 'Ayase Rie - Yuima-ru*World TVver. [Ultimate] +HD,DT (97.17%)'),
(994495, 8482062, 'freedomdiver', 644.387, 'Ayase Rie - Yuima-ru*World TVver. [Ultimate] +HD,NC,SD (88.58%)'),
(999944, 124493, 'Cookiezi', 750.437, 'yuikonnu - Yume Chizu [Lost] +HD,DT (95.56%)'),
(999944, 2558286, 'Rafis', 631.179, 'yuikonnu - Yume Chizu [Lost] +HD,DT (98.34%)'),
(999944, 4787150, 'Vaxei', 607.464, 'yuikonnu - Yume Chizu [Lost] +HD,DT (97.53%)'),
(1003944, 124493, 'Cookiezi', 705.886, 'Chitose Sara - Merry Merry Go Round [Extra] +HD,DT (99.22%)'),
(1003944, 1777162, 'firebat92', 624.156, 'Chitose Sara - Merry Merry Go Round [Extra] +HD,DT (98.44%)'),
(1003944, 2562987, 'osu player84', 718.056, 'Chitose Sara - Merry Merry Go Round [Extra] +HD,DT (99.53%)'),
(1003944, 6304246, '_RyuK', 652.809, 'Chitose Sara - Merry Merry Go Round [Extra] +HD,DT (97.35%)'),
(1008851, 124493, 'Cookiezi', 616.523, 'petit milady - Hakone Hakoiri Musume [Simple] +HD,HR (100.00%)'),
(1026729, 1389663, 'talala', 613.736, '3 Nen E Gumi Utatan (Nagisa & Kayano & Karuma & Isogai & Maehara) - Bye Bye YESTERDAY [Taeyang\'s Good Good Time] +HD,DT (100.00%)'),
(1026729, 2562987, 'osu player84', 604.79, '3 Nen E Gumi Utatan (Nagisa & Kayano & Karuma & Isogai & Maehara) - Bye Bye YESTERDAY [Taeyang\'s Good Good Time] +HD,DT (99.82%)'),
(1029562, 251683, 'Musty', 629.23, '9mm Parabellum Bullet - Inferno [Tortured Soul Extra] +HD,HR (99.18%)'),
(1029562, 1777162, 'firebat92', 603.038, '9mm Parabellum Bullet - Inferno [Tortured Soul Extra] +HR (99.76%)'),
(1029562, 1837989, 'MrBooM', 616.971, '9mm Parabellum Bullet - Inferno [Tortured Soul Extra] +HD,HR (98.82%)'),
(1029562, 2155578, 'Azer', 602.418, '9mm Parabellum Bullet - Inferno [Tortured Soul Extra] +HD,HR (98.35%)'),
(1029562, 3219026, 'Rohulk', 647.605, '9mm Parabellum Bullet - Inferno [Tortured Soul Extra] +HD,HR (99.65%)'),
(1031991, 124493, 'Cookiezi', 691.746, 'Imperial Circus Dead Decadence - Yomi yori Kikoyu, Koukoku no Tou to Honoo no Shoujo. [Kyouaku] +HD (99.07%)'),
(1041710, 124493, 'Cookiezi', 607.791, 'fourfolium - SAKURA Skip [Press START] +HD,DT (99.82%)'),
(1041710, 1777162, 'firebat92', 610.859, 'fourfolium - SAKURA Skip [Press START] +HD,DT (99.88%)'),
(1041710, 2558286, 'Rafis', 613.986, 'fourfolium - SAKURA Skip [Press START] +HD,DT (99.94%)'),
(1041710, 4495871, 'Mizuru', 610.859, 'fourfolium - SAKURA Skip [Press START] +HD,DT (99.88%)'),
(1046339, 50265, 'hvick225', 686.828, 'Kanon Wakeshima - Tsukinami [Fragile] +HD,DT (98.11%)'),
(1046339, 1777162, 'firebat92', 695.83, 'Kanon Wakeshima - Tsukinami [Fragile] +HD,DT (98.36%)'),
(1046339, 4787150, 'Vaxei', 708.625, 'Kanon Wakeshima - Tsukinami [Fragile] +HD,DT (98.71%)'),
(1053520, 1777162, 'firebat92', 670.056, '*namirin - Koi no Hime Hime Pettanko [Taeyang\'s Ultra Princess] +HD,DT (99.29%)'),
(1053520, 2003326, 'Emilia', 602.512, '*namirin - Koi no Hime Hime Pettanko [Taeyang\'s Ultra Princess] +HD,DT (96.97%)'),
(1053520, 2831793, 'filsdelama', 608.701, '*namirin - Koi no Hime Hime Pettanko [Taeyang\'s Ultra Princess] +DT (99.47%)'),
(1053520, 4163860, 'Piggey', 643.404, '*namirin - Koi no Hime Hime Pettanko [Taeyang\'s Ultra Princess] +HD,DT (98.57%)'),
(1053520, 4787150, 'Vaxei', 656.254, '*namirin - Koi no Hime Hime Pettanko [Taeyang\'s Ultra Princess] +HD,DT (98.93%)'),
(1053520, 6806754, 'Weabole', 609.663, '*namirin - Koi no Hime Hime Pettanko [Taeyang\'s Ultra Princess] +HD,DT (97.33%)'),
(1054525, 50265, 'hvick225', 637.175, 'yuikonnu - Yume Chizu [Extra] +HD,DT (98.98%)'),
(1054525, 1777162, 'firebat92', 654.76, 'yuikonnu - Yume Chizu [Extra] +HD,DT (99.35%)'),
(1054525, 2558286, 'Rafis', 670.358, 'yuikonnu - Yume Chizu [Extra] +HD,DT (99.63%)'),
(1054525, 4787150, 'Vaxei', 607.333, 'yuikonnu - Yume Chizu [Extra] +HD,DT (98.25%)'),
(1055147, 1920049, 'itsamemarioo', 674.602, 'Izumi Akazawa (CV. Madoka Yonezawa) - Responsibility Response [Slayed\'s Answer] +HD,DT (81.52%)'),
(1055147, 2003326, 'Emilia', 613.109, 'Izumi Akazawa (CV. Madoka Yonezawa) - Responsibility Response [Slayed\'s Answer] +HD,DT (97.02%)'),
(1055147, 2813864, 'Girl', 617.619, 'Izumi Akazawa (CV. Madoka Yonezawa) - Responsibility Response [Slayed\'s Answer] +DT (90.20%)'),
(1055147, 4787150, 'Vaxei', 632.057, 'Izumi Akazawa (CV. Madoka Yonezawa) - Responsibility Response [Slayed\'s Answer] +HD,DT (98.08%)'),
(1055147, 8482062, 'freedomdiver', 708.448, 'Izumi Akazawa (CV. Madoka Yonezawa) - Responsibility Response [Slayed\'s Answer] +HD,NC (90.10%)'),
(1059894, 27055, 'Astar', 641.771, 'mimimemeMIMI - Harebare Fanfare [Bright & Cheerful] +HD,HR,DT (98.27%)'),
(1059894, 2831793, 'filsdelama', 764.976, 'mimimemeMIMI - Harebare Fanfare [Bright & Cheerful] +HD,HR,DT (99.81%)'),
(1059894, 6806754, 'Weabole', 673.355, 'mimimemeMIMI - Harebare Fanfare [Bright & Cheerful] +HD,HR,DT (98.56%)'),
(1063410, 4787150, 'Vaxei', 710.767, 'Aqours - Aozora Jumping Heart [hvick225\'s Extra] +HD,DT (98.73%)'),
(1068383, 4787150, 'Vaxei', 603.544, 'Drop - Granat [Expert] +HD,HR,DT (94.54%)'),
(1071242, 4787150, 'Vaxei', 658.712, 'Tia - The Glory Days [Glory] +HD,DT (99.02%)'),
(1071424, 2003326, 'Emilia', 647.209, 'Drop - Granat [Kyshiro\'s Extra] +HD,DT (96.15%)'),
(1076952, 124493, 'Cookiezi', 606.917, 'Mami Kawada - Contrail ~Kiseki~ [Dreams] +HD,DT (99.93%)'),
(1078552, 2558286, 'Rafis', 634.507, 'Tamura Yukari - MERRY MERRY MERRY MENU... Ne! [Little\'s Extra] +HD,DT (98.83%)'),
(1078552, 4787150, 'Vaxei', 628.333, 'Tamura Yukari - MERRY MERRY MERRY MENU... Ne! [Little\'s Extra] +HD,DT (97.57%)'),
(1081936, 124493, 'Cookiezi', 674.855, 'supercell - My Dearest [Last Love] +HD,DT (98.39%)'),
(1081936, 1777162, 'firebat92', 602.814, 'supercell - My Dearest [Last Love] +HD,DT (97.87%)'),
(1081936, 2831793, 'filsdelama', 605.724, 'supercell - My Dearest [Last Love] +DT (98.08%)'),
(1082245, 4787150, 'Vaxei', 678.246, 'TRUE - Soundscape [StarR\'s Euphonious] +HD,DT (97.85%)'),
(1087664, 2562987, 'osu player84', 661.025, 'TRUE - Soundscape [Kagetsu\'s Extra] +HD,DT (98.16%)'),
(1091249, 2558286, 'Rafis', 653.216, 'RADWIMPS - Zen Zen Zense (movie ver.) [Extra: Taki] +HD,DT (99.86%)'),
(1091249, 2831793, 'filsdelama', 621.946, 'RADWIMPS - Zen Zen Zense (movie ver.) [Extra: Taki] +HD,NC (99.28%)'),
(1091249, 4163860, 'Piggey', 615.997, 'RADWIMPS - Zen Zen Zense (movie ver.) [Extra: Taki] +HD,NC (99.14%)'),
(1092090, 2558286, 'Rafis', 630.925, 'RADWIMPS - Zen Zen Zense (movie ver.) [Extra: Mitsuha] +HD,DT (99.57%)'),
(1092090, 2831793, 'filsdelama', 622.92, 'RADWIMPS - Zen Zen Zense (movie ver.) [Extra: Mitsuha] +HD,DT (99.43%)'),
(1092090, 4163860, 'Piggey', 609.406, 'RADWIMPS - Zen Zen Zense (movie ver.) [Extra: Mitsuha] +HD,NC (99.14%)'),
(1093078, 2021758, 'Wilchq', 600.924, 'Camellia - Light it up [Brightness] +HD,HR (99.76%)'),
(1093078, 3219026, 'Rohulk', 601.062, 'Camellia - Light it up [Brightness] +HD,HR (99.76%)'),
(1097543, 1777162, 'firebat92', 630.33, 'MISATO - Necro Fantasia [Lasse\'s Lunatic] +HD,DT (98.97%)'),
(1097543, 4787150, 'Vaxei', 608.818, 'MISATO - Necro Fantasia [Lasse\'s Lunatic] +HD,NC (98.60%)'),
(1102144, 124493, 'Cookiezi', 717.12, 'Kanae Asaba - Endless Starlight ~Inochi no Kirameki~ (OP ver.) [Challenger] +HD,DT (100.00%)'),
(1102144, 1777162, 'firebat92', 632.138, 'Kanae Asaba - Endless Starlight ~Inochi no Kirameki~ (OP ver.) [Challenger] +HD,DT (98.85%)'),
(1102144, 2003326, 'Emilia', 639.011, 'Kanae Asaba - Endless Starlight ~Inochi no Kirameki~ (OP ver.) [Challenger] +HD,DT (98.05%)'),
(1102144, 2558286, 'Rafis', 599.636, 'Kanae Asaba - Endless Starlight ~Inochi no Kirameki~ (OP ver.) [Challenger] +HD,DT (99.38%)'),
(1102144, 4787150, 'Vaxei', 622.753, 'Kanae Asaba - Endless Starlight ~Inochi no Kirameki~ (OP ver.) [Challenger] +HD,DT (97.52%)'),
(1102144, 6304246, '_RyuK', 649.569, 'Kanae Asaba - Endless Starlight ~Inochi no Kirameki~ (OP ver.) [Challenger] +HD,DT (98.40%)'),
(1102688, 1777162, 'firebat92', 601.515, 'TRUE - Soundscape [Slayed\'s Extra] +HD,DT (99.36%)'),
(1102688, 4787150, 'Vaxei', 603.319, 'TRUE - Soundscape [Slayed\'s Extra] +HD,DT (99.36%)'),
(1107674, 2558286, 'Rafis', 641.297, 'TRUE - Soundscape [Settia\'s Extra] +HD,DT (98.77%)'),
(1107674, 4787150, 'Vaxei', 609.793, 'TRUE - Soundscape [Settia\'s Extra] +HD,DT (97.49%)'),
(1114754, 124493, 'Cookiezi', 612.997, 'supercell - Sayonara Memories [Farewell] +HD,DT (99.59%)'),
(1115737, 124493, 'Cookiezi', 690.187, 'Foreground Eclipse - From Under Cover (Caught Up In A Love Song) [I\'ve Stopped Time and Everything is at My Mercy] +HD,HR (99.32%)'),
(1120682, 2558286, 'Rafis', 720.176, '*Namirin - Yasashisa no Riyuu [Happiness] +HD,DT (99.68%)'),
(1154766, 124493, 'Cookiezi', 599.556, 'NU-KO - Pochiko no Shiawase na Nichijou (Long Version) [Pochiko] +HD,HR (99.59%)'),
(1169038, 124493, 'Cookiezi', 621.232, 'petit milady - Himawari no Sakamichi [Hana] +HD,DT (99.32%)'),
(1174467, 1777162, 'firebat92', 603.603, 'Ayaka Ohashi - Wagamama MIRROR HEART [Revenge] +HD,DT (98.47%)'),
(1174467, 2558286, 'Rafis', 640.556, 'Ayaka Ohashi - Wagamama MIRROR HEART [Revenge] +HD,DT (99.43%)'),
(1177269, 2558286, 'Rafis', 632.138, 'Ayaka Ohashi - Wagamama MIRROR HEART [StarR-kun\'s Revenge] +HD,DT (99.27%)'),
(1177269, 4787150, 'Vaxei', 602.253, 'Ayaka Ohashi - Wagamama MIRROR HEART [StarR-kun\'s Revenge] +HD,DT (99.27%)'),
(1185036, 2003326, 'Emilia', 607.033, 'Primary - Inai Sekai [Regret] +HD,HR (98.52%)'),
(1187393, 2003326, 'Emilia', 625.875, 'Hiromi Sato - Jiyuu no Hane [A Feather] +HD,DT (97.89%)'),
(1187393, 4787150, 'Vaxei', 695.833, 'Hiromi Sato - Jiyuu no Hane [A Feather] +HD,DT (99.68%)'),
(1193476, 2558286, 'Rafis', 629.934, 'TrySail & TRUE - High Free Spirits vs. DREAM SOLISTER [Pentarks\' Extra] +HD,DT (99.39%)'),
(1201636, 754565, 'Dustice', 630.419, 'BABYMETAL - Road of Resistance [Crimson Rebellion] (98.07%)'),
(1201636, 2831793, 'filsdelama', 655.716, 'BABYMETAL - Road of Resistance [Crimson Rebellion] (98.38%)'),
(1201636, 4650315, 'idke', 718.335, 'BABYMETAL - Road of Resistance [Crimson Rebellion] (99.23%)'),
(1221602, 2558286, 'Rafis', 712.825, 'Saiya - Remote Control [Take Control!] +HD,DT (99.18%)'),
(1221602, 2831793, 'filsdelama', 686.858, 'Saiya - Remote Control [Take Control!] +HD,NC (99.28%)'),
(1221602, 4787150, 'Vaxei', 719.911, 'Saiya - Remote Control [Take Control!] +HD,DT (99.28%)'),
(1221602, 5339515, 'Mathi', 621.691, 'Saiya - Remote Control [Take Control!] +HD,DT (98.12%)'),
(1246395, 124493, 'Cookiezi', 670.086, 'supercell - Kimi no Shiranai Monogatari [Our Story in the Stars] +HD,DT (99.24%)'),
(1246395, 2831793, 'filsdelama', 658.349, 'supercell - Kimi no Shiranai Monogatari [Our Story in the Stars] +DT (99.67%)'),
(1256809, 1837989, 'MrBooM', 609.974, 'Avenged Sevenfold - Save Me [Tragedy] +HD,HR (99.10%)'),
(1256809, 2021758, 'Wilchq', 622.207, 'Avenged Sevenfold - Save Me [Tragedy] +HD,HR (99.31%)'),
(1256809, 3043603, 'kablaze', 633.677, 'Avenged Sevenfold - Save Me [Tragedy] +HD,HR (99.67%)'),
(1256809, 3048222, '[ Wakson ]', 607.671, 'Avenged Sevenfold - Save Me [Tragedy] +HR (99.71%)'),
(1256809, 3219026, 'Rohulk', 648.851, 'Avenged Sevenfold - Save Me [Tragedy] +HD,HR (99.70%)'),
(1262433, 2558286, 'Rafis', 634.133, 'RADWIMPS - Yume Tourou [Extra: Mitsuha] +HD,HR,DT (97.99%)'),
(1262433, 2831793, 'filsdelama', 599.732, 'RADWIMPS - Yume Tourou [Extra: Mitsuha] +HD,NC (100.00%)'),
(1262433, 4163860, 'Piggey', 599.732, 'RADWIMPS - Yume Tourou [Extra: Mitsuha] +HD,NC (100.00%)'),
(1262433, 6806754, 'Weabole', 609.134, 'RADWIMPS - Yume Tourou [Extra: Mitsuha] +HD,HR,DT (96.34%)'),
(1262434, 1777162, 'firebat92', 734.345, 'RADWIMPS - Yume Tourou [Extra: Taki] +HD,HR,DT (98.25%)'),
(1262434, 2558286, 'Rafis', 734.05, 'RADWIMPS - Yume Tourou [Extra: Taki] +HD,HR,DT (98.43%)'),
(1262434, 2831793, 'filsdelama', 728.675, 'RADWIMPS - Yume Tourou [Extra: Taki] +HD,HR,DT (98.08%)'),
(1262434, 4787150, 'Vaxei', 627.265, 'RADWIMPS - Yume Tourou [Extra: Taki] +HD,HR,DT (97.64%)'),
(1262832, 124493, 'Cookiezi', 600.609, 'ClariS - Hitorigoto -TV MIX- [Soliloquy] +HD,HR,DT (95.29%)'),
(1262832, 1777162, 'firebat92', 712.449, 'ClariS - Hitorigoto -TV MIX- [Soliloquy] +HD,HR,DT (99.22%)'),
(1262832, 2558286, 'Rafis', 725.814, 'ClariS - Hitorigoto -TV MIX- [Soliloquy] +HD,HR,DT (99.41%)'),
(1262832, 2562987, 'osu player84', 604.906, 'ClariS - Hitorigoto -TV MIX- [Soliloquy] +HD,HR,DT (96.76%)'),
(1262832, 2831793, 'filsdelama', 725.814, 'ClariS - Hitorigoto -TV MIX- [Soliloquy] +HD,HR,DT (99.41%)'),
(1262832, 4787150, 'Vaxei', 648.816, 'ClariS - Hitorigoto -TV MIX- [Soliloquy] +HD,HR,DT (97.65%)'),
(1262832, 6806754, 'Weabole', 636.999, 'ClariS - Hitorigoto -TV MIX- [Soliloquy] +HD,HR,DT (97.94%)'),
(1264972, 2291265, 'Arnold24x24', 604.604, 'ClariS - Hitorigoto -TV MIX- [Kencho\'s Insane] +HD,HR,DT (99.58%)'),
(1264972, 2831793, 'filsdelama', 604.604, 'ClariS - Hitorigoto -TV MIX- [Kencho\'s Insane] +HD,HR,DT (99.58%)'),
(1289927, 5339515, 'Mathi', 682.301, 'Minazuki Airi with Atsushi - Daisuki, Evolution [Xexxar\'s Best... Girl?!] +HR (98.54%)'),
(1312156, 1920049, 'itsamemarioo', 640.421, 'Wan Ho-Kit, Lee Hon-Kam - Unknown Title [Let\'s show them Monstrata\'s powerful stance.] +HD,DT (79.88%)'),
(1312156, 3205678, 'EbonSol', 681.642, 'Wan Ho-Kit, Lee Hon-Kam - Unknown Title [Let\'s show them Monstrata\'s powerful stance.] +HD,DT,SD (89.34%)'),
(1312156, 8482062, 'freedomdiver', 668.868, 'Wan Ho-Kit, Lee Hon-Kam - Unknown Title [Let\'s show them Monstrata\'s powerful stance.] +HD,NC (88.19%)'),
(1313431, 2165650, 'mcy3', 600.075, 'Tapimiru - Hakkensha wa Watashi (Anime Size) [Kencho\'s Grimoire] +HD,DT (98.58%)'),
(1313431, 2204373, 'Spare', 632.56, 'Tapimiru - Hakkensha wa Watashi (Anime Size) [Kencho\'s Grimoire] +HD,DT (99.48%)'),
(1313431, 2558286, 'Rafis', 639.95, 'Tapimiru - Hakkensha wa Watashi (Anime Size) [Kencho\'s Grimoire] +HD,DT (99.66%)'),
(1313431, 2562987, 'osu player84', 656.889, 'Tapimiru - Hakkensha wa Watashi (Anime Size) [Kencho\'s Grimoire] +HD,DT (100.00%)'),
(1313431, 3641404, 'uyghti', 607.744, 'Tapimiru - Hakkensha wa Watashi (Anime Size) [Kencho\'s Grimoire] +HD,DT (98.79%)'),
(1313431, 4448118, 'Koba', 600.386, 'Tapimiru - Hakkensha wa Watashi (Anime Size) [Kencho\'s Grimoire] +HD,DT (99.14%)'),
(1313431, 4858573, 'Syph', 640.756, 'Tapimiru - Hakkensha wa Watashi (Anime Size) [Kencho\'s Grimoire] +HD,DT (99.66%)'),
(1321542, 2558286, 'Rafis', 601.703, 'supercell - Kimi no Shiranai Monogatari -TV Edit- [Your story] +HD,HR,DT (98.65%)'),
(1372306, 2558286, 'Rafis', 667.382, 'Duca - Jewel Days [Illumination] +HD,DT (99.73%)');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `osu_High_pps`
--
ALTER TABLE `osu_High_pps`
  ADD PRIMARY KEY (`bid`,`uid`);
--
-- Database: `tools`
--
CREATE DATABASE IF NOT EXISTS `tools` DEFAULT CHARACTER SET utf8 COLLATE utf8_general_ci;
USE `tools`;

-- --------------------------------------------------------

--
-- 表的结构 `tool_info`
--

CREATE TABLE `tool_info` (
  `tid` int(20) NOT NULL,
  `name` varchar(100) NOT NULL,
  `type` varchar(20) NOT NULL,
  `info` varchar(500) NOT NULL,
  `url` varchar(200) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `tool_info`
--

INSERT INTO `tool_info` (`tid`, `name`, `type`, `info`, `url`) VALUES
(1, 'B站视频封面下载器 BiliCoverDownloader', '下载工具', '输入av号，下载对应视频的封面到你的手机。', 'BiliCoverDownloader_v0.2.apk'),
(2, 'B站弹幕发送者搜索 BiliDanmuFucker', '破解', '输入av号和你想要查找弹幕包含的关键词，即可找到该弹幕的发送者。', 'BiliDanmuFuckerv0.93.apk'),
(3, '东方天空璋修改器 BugZhangSetter for xp', '游戏修改', 'xp适配版。缺dll请自行添加至文件夹。', 'BugZhangSetter for xp_v0.76.zip'),
(4, '东方天空璋修改器 BugZhangSetter', '游戏修改', '支持修改和锁定天空璋的四种数据。', 'BugZhangSetter_v0.76.zip'),
(5, '天空璋修改器打分版 BugZhangSetter', '游戏修改', '打分版。添加最大得点的修改功能，然而并没有锁定。', 'BugZhangSetter_v0.77（打分用）.zip'),
(6, '自定义键位监视 KeyWatcher', '游戏辅助', '完全自定义游戏进程和按键的键位监控。支持最多100个进程和41个按键。', 'KeyWatcher_v0.11.zip'),
(7, '非想天则键位监视 FxtzWatcher', '游戏辅助', '非想天则专用键位监控。监控10个键位。', 'FxtzWatcher_v0.92.zip'),
(8, '东方键位监视 FlyingWatcher', '游戏辅助', '东方STG系列键位监控。支持8个键位和TH06-15。', 'FlyingWatcher_v0.92.zip'),
(9, 'pp变化显示 ppcatcher', '游戏辅助', '显示你开启软件时的pp，并监控你接下来精确的pp变化。', 'ppcatcher_v0.7.zip'),
(10, '东方红魔乡修改器 ScareletSetter', '游戏修改', '支持红魔乡八种数据的修改和锁定。', 'ScareletSetter_v0.91.zip');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `tool_info`
--
ALTER TABLE `tool_info`
  ADD PRIMARY KEY (`tid`);

--
-- 在导出的表使用AUTO_INCREMENT
--

--
-- 使用表AUTO_INCREMENT `tool_info`
--
ALTER TABLE `tool_info`
  MODIFY `tid` int(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;--
-- Database: `visited_ip`
--
CREATE DATABASE IF NOT EXISTS `visited_ip` DEFAULT CHARACTER SET utf8 COLLATE utf8_general_ci;
USE `visited_ip`;

-- --------------------------------------------------------

--
-- 表的结构 `ip_info`
--

CREATE TABLE `ip_info` (
  `ip_id` int(20) NOT NULL,
  `ip_address` varchar(100) NOT NULL,
  `ip_location` varchar(200) NOT NULL,
  `time` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `ip_info`
--

INSERT INTO `ip_info` (`ip_id`, `ip_address`, `ip_location`, `time`) VALUES
(1, '202.119.45.170', '中国江苏省南京市教育网', '2017-09-24 00:08:52'),
(1, '202.119.45.170', '中国江苏省南京市教育网', '2017-09-24 00:09:04'),
(1, '202.119.45.170', '中国江苏省南京市教育网', '2017-09-24 02:29:44'),
(1, '202.119.45.170', '中国江苏省南京市教育网', '2017-09-24 02:29:55'),
(1, '202.119.45.170', '中国江苏省南京市教育网', '2017-09-24 12:14:59'),
(1, '202.119.45.170', '中国江苏省南京市教育网', '2017-09-24 12:15:17'),
(1, '202.119.45.170', '中国江苏省南京市教育网', '2017-09-25 02:34:56'),
(1, '202.119.45.170', '中国江苏省南京市教育网', '2017-09-25 04:10:17'),
(1, '202.119.45.170', '中国江苏省南京市教育网', '2017-09-25 04:40:29'),
(2, '104.200.31.52', '美国新泽西州', '2017-09-24 00:10:08'),
(3, '159.203.40.251', '加拿大', '2017-09-24 00:10:59'),
(4, '139.162.180.116', '德国', '2017-09-24 00:11:48'),
(5, '77.68.40.189', '英国', '2017-09-24 00:12:48'),
(6, '114.221.246.236', '中国江苏省南京市电信', '2017-09-24 00:13:07'),
(6, '114.221.246.236', '中国江苏省南京市电信', '2017-09-24 00:22:28'),
(6, '114.221.246.236', '中国江苏省南京市电信', '2017-09-24 00:39:09'),
(6, '114.221.246.236', '中国江苏省南京市电信', '2017-09-24 00:39:17'),
(6, '114.221.246.236', '中国江苏省南京市电信', '2017-09-24 00:39:41'),
(7, '82.223.71.149', '西班牙', '2017-09-24 00:14:19'),
(8, '139.59.17.160', '印度', '2017-09-24 00:15:09'),
(9, '106.185.37.39', '日本', '2017-09-24 00:15:57'),
(10, '188.226.131.252', '荷兰', '2017-09-24 00:20:02'),
(11, '111.206.36.143', '中国北京市北京市联通', '2017-09-24 03:29:01'),
(12, '111.206.36.11', '中国北京市北京市联通', '2017-09-24 03:29:01'),
(13, '106.75.85.103', '中国北京市北京市联通', '2017-09-24 05:12:10'),
(14, '61.135.169.40', '中国北京市北京市联通', '2017-09-24 08:17:02'),
(14, '61.135.169.40', '中国北京市北京市联通', '2017-09-25 03:28:26'),
(15, '139.162.114.70', '日本', '2017-09-24 09:51:21'),
(16, '106.11.242.130', '中国上海市上海市阿里巴巴', '2017-09-24 10:00:13'),
(17, '60.191.38.77', '中国浙江省杭州市电信', '2017-09-24 10:22:46'),
(18, '120.92.32.140', '中国北京市北京市电信', '2017-09-24 11:35:57'),
(19, '220.181.159.77', '中国北京市北京市电信', '2017-09-24 19:55:43'),
(20, '123.125.67.165', '中国北京市北京市联通', '2017-09-25 02:20:25'),
(21, '61.135.165.43', '中国北京市北京市联通', '2017-09-25 03:28:26'),
(22, '111.206.36.141', '中国北京市北京市联通', '2017-09-25 08:17:02'),
(23, '140.205.201.8', '中国上海市上海市阿里巴巴', '2017-09-25 09:05:19'),
(24, '106.11.225.221', '中国上海市上海市阿里巴巴', '2017-09-25 09:59:14'),
(25, '80.82.77.33', '荷兰', '2017-09-25 15:46:07'),
(26, '106.11.227.63', '中国上海市上海市阿里巴巴', '2017-09-25 16:20:30');

-- --------------------------------------------------------

--
-- 表的结构 `lneta_ip_info`
--

CREATE TABLE `lneta_ip_info` (
  `ip_id` int(11) NOT NULL,
  `ip_address` varchar(200) NOT NULL,
  `time` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `lneta_ip_info`
--

INSERT INTO `lneta_ip_info` (`ip_id`, `ip_address`, `time`) VALUES
(1, '202.119.45.170', '2017-09-24 00:36:35'),
(1, '202.119.45.170', '2017-09-24 00:37:58'),
(1, '202.119.45.170', '2017-09-24 01:46:59'),
(1, '202.119.45.170', '2017-09-24 01:57:42'),
(1, '202.119.45.170', '2017-09-24 03:52:13'),
(1, '202.119.45.170', '2017-09-24 11:00:47'),
(1, '202.119.45.170', '2017-09-24 12:14:56'),
(1, '202.119.45.170', '2017-09-25 20:51:26'),
(2, '113.91.189.182', '2017-09-24 00:38:14'),
(2, '113.91.189.182', '2017-09-24 00:38:25'),
(2, '113.91.189.182', '2017-09-24 14:48:10'),
(3, '180.154.51.33', '2017-09-24 01:34:43'),
(3, '180.154.51.33', '2017-09-24 11:32:01'),
(4, '223.73.9.231', '2017-09-24 10:25:50'),
(5, '115.239.213.141', '2017-09-24 11:16:49'),
(6, '115.239.213.166', '2017-09-24 11:17:43'),
(7, '115.239.216.149', '2017-09-24 11:17:54'),
(8, '115.239.215.168', '2017-09-24 11:18:24'),
(9, '115.239.214.249', '2017-09-24 11:18:30'),
(10, '115.239.212.54', '2017-09-24 11:19:15'),
(11, '115.239.212.192', '2017-09-24 11:19:29'),
(12, '115.239.212.240', '2017-09-24 11:24:01'),
(13, '223.90.186.167', '2017-09-24 11:39:48'),
(14, '113.224.9.67', '2017-09-24 11:41:18'),
(14, '113.224.9.67', '2017-09-24 11:41:50'),
(14, '113.224.9.67', '2017-09-24 15:40:38'),
(15, '115.205.225.121', '2017-09-24 11:50:00'),
(16, '123.168.189.70', '2017-09-24 12:03:21'),
(17, '202.119.42.107', '2017-09-24 12:37:38'),
(18, '14.215.176.136', '2017-09-24 12:40:50'),
(19, '120.229.107.121', '2017-09-24 12:54:12'),
(20, '112.66.100.255', '2017-09-24 13:41:36'),
(21, '106.120.160.109', '2017-09-24 15:41:28'),
(21, '106.120.160.109', '2017-09-25 13:10:04'),
(22, '101.199.112.51', '2017-09-24 15:41:42'),
(23, '14.214.63.203', '2017-09-24 16:58:44'),
(24, '223.67.100.232', '2017-09-24 17:17:35'),
(25, '115.239.138.179', '2017-09-24 17:26:53'),
(26, '223.104.7.139', '2017-09-24 18:35:59'),
(26, '223.104.7.139', '2017-09-24 18:36:22'),
(27, '114.94.248.253', '2017-09-24 18:41:42'),
(28, '36.23.88.74', '2017-09-24 18:52:55'),
(28, '36.23.88.74', '2017-09-24 18:58:33'),
(28, '36.23.88.74', '2017-09-24 19:07:47'),
(29, '60.20.108.178', '2017-09-24 20:25:59'),
(30, '106.91.51.123', '2017-09-24 20:29:33'),
(31, '111.192.147.95', '2017-09-24 20:41:49'),
(31, '111.192.147.95', '2017-09-24 20:47:32'),
(31, '111.192.147.95', '2017-09-25 14:12:25'),
(31, '111.192.147.95', '2017-09-25 14:12:57'),
(31, '111.192.147.95', '2017-09-25 14:13:03'),
(32, '119.0.4.61', '2017-09-24 21:23:18'),
(33, '115.239.215.146', '2017-09-25 04:17:32'),
(34, '14.215.176.9', '2017-09-25 05:36:37'),
(35, '36.23.19.78', '2017-09-25 06:25:16'),
(35, '36.23.19.78', '2017-09-25 10:48:27'),
(35, '36.23.19.78', '2017-09-25 10:55:31'),
(36, '106.11.159.163', '2017-09-25 10:05:39'),
(37, '112.16.91.49', '2017-09-25 11:15:20'),
(38, '120.236.174.133', '2017-09-25 13:06:31'),
(38, '120.236.174.133', '2017-09-25 13:08:09'),
(38, '120.236.174.133', '2017-09-25 13:08:12'),
(39, '101.199.108.51', '2017-09-25 13:09:07'),
(40, '101.199.112.52', '2017-09-25 13:10:24'),
(41, '111.26.32.50', '2017-09-25 16:58:39'),
(42, '110.52.211.225', '2017-09-26 00:11:07');

-- --------------------------------------------------------

--
-- 表的结构 `rep_ip_info`
--

CREATE TABLE `rep_ip_info` (
  `ip_id` int(11) NOT NULL,
  `ip_address` varchar(200) NOT NULL,
  `time` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Indexes for dumped tables
--

--
-- Indexes for table `ip_info`
--
ALTER TABLE `ip_info`
  ADD PRIMARY KEY (`ip_id`,`time`);

--
-- Indexes for table `lneta_ip_info`
--
ALTER TABLE `lneta_ip_info`
  ADD PRIMARY KEY (`ip_id`,`time`);

--
-- Indexes for table `rep_ip_info`
--
ALTER TABLE `rep_ip_info`
  ADD PRIMARY KEY (`ip_id`,`time`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
